// __________________Меню____________________
let id = 0;

const menu = [
  {
    id: id++,
    name: 'Бутики',
    link: '/#bitiki',
  },
  {
    id: id++,
    name: 'Рестораны',
    link: '/butiks/kafe',
  },
  {
    id: id++,
    name: 'Новости',
    link: '/news',
  },

  {
    id: id++,
    name: 'Кинотеатр',
    link: '/events',
  },
  {
    id: id++,
    name: 'Детям',
    link: '/butiks/children',
  },
  {
    id: id++,
    name: 'Сервисы',
    link: '/services',
  },
  {
    id: id++,
    name: 'Контакты',
    link: '/contacts',
  },
  {
    id: id++,
    name: 'Парковка',
    link: '/parking',
  },
  {
    id: id++,
    name: 'Арендаторам',
    link: '/rent',
  },
  {
    id: id++,
    name: 'Рекламодателям',
    link: '/marketing',
  },
  {
    id: id++,
    name: 'Юридическая информация',
    link: '/documents',
  },
];

// __________________Верхний слайдер____________________
const sliderTop = [
  {
    id: 1,
    src: '/slide_main/m_1.jpg',
    alt: 'Изображение 1',
  },
  // {
  //   id: 2,
  //   src: '/slide_main/m_2.jpg',
  //   alt: 'Изображение 2',
  // },
  // {
  //   id: 3,
  //   src: '/slide_main/m_3.jpg',
  //   alt: 'Изображение 3',
  // },
];

// __________________Слайдер Кино____________________
const sliderCenter = [
  {
    id: 1,
    src: '/slide_main/kino-banner-1.jpg',
    alt: 'Кинобаннер 1',
  },
  {
    id: 2,
    src: '/slide_main/kino-banner-2.jpg',
    alt: 'Кинобаннер 2',
  },
  {
    id: 3,
    src: '/slide_main/kino-banner-3.jpg',
    alt: 'Кинобаннер 3',
  },
  {
    id: 4,
    src: '/slide_main/kino-banner-4.jpg',
    alt: 'Кинобаннер 4',
  },
  {
    id: 5,
    src: '/slide_main/kino-banner-5.jpg',
    alt: 'Кинобаннер 5',
  },
];

// _______Список Бутиков на Главной_____________

const shopList = [
  {
    id: 1,
    title: 'Женская одежда',
    link: '/butiks/women_clothing',
    url: 'bg-[url("../public/site_img/shop-1.png")]',
  },
  {
    id: 2,
    title: 'Мужская одежда',
    link: '/butiks/men_clothing',
    url: 'bg-[url("../public/site_img/shop-2.png")]',
  },
  {
    id: 3,
    title: 'Для детей',
    link: '/butiks/children',
    url: 'bg-[url("../public/site_img/shop-3.png")]',
  },
  {
    id: 4,
    title: 'Купальники и нижнее белье',
    link: '/butiks/underwear',
    url: 'bg-[url("../public/site_img/shop-4.png")]',
  },
  {
    id: 5,
    title: 'Ювелирные изделия и часы',
    link: '/butiks/clocks',
    url: 'bg-[url("../public/site_img/shop-5.png")]',
  },
  {
    id: 6,
    title: 'Обувь и сумки',
    link: '/butiks/shoes_and_bags',
    url: 'bg-[url("../public/site_img/shop-6.png")]',
  },
  {
    id: 7,
    title: 'КОСМЕТИКА И ПАРФЮМЕРИЯ',
    link: '/butiks/cosmetics',
    url: 'bg-[url("../public/site_img/shop-7.png")]',
  },
  {
    id: 8,
    title: 'Интерьер',
    link: '/butiks/interior',
    url: 'bg-[url("../public/site_img/shop-8.png")]',
  },
  {
    id: 9,
    title: 'Подарки и книги',
    link: '/butiks/gifts_and_books',
    url: 'bg-[url("../public/site_img/shop-9.png")]',
  },
  {
    id: 10,
    title: 'Очки и аксессуары',
    link: '/butiks/glasses',
    url: 'bg-[url("../public/site_img/shop-10.png")]',
  },
  {
    id: 11,
    title: 'РЕСТОРАНЫ И КАФЕ',
    link: '/butiks/kafe',
    url: 'bg-[url("../public/site_img/shop-12.png")]',
  },
  {
    id: 12,
    title: 'Развлечения',
    link: '/butiks/game',
    url: 'bg-[url("../public/site_img/shop-11.png")]',
  },
];

// __________________Новости____________________
// import news1 from '@/public/news/1.jpg';
// import news2 from '@/public/news/2.jpg';
// import news2m from '@/public/news/2m.jpg';
// import news3 from '@/public/news/3.jpg';
// import news3m from '@/public/news/3m.jpg';
// import news4 from '@/public/news/4.jpg';
// import news4m from '@/public/news/4m.jpg';
// import news5 from '@/public/news/5.jpg';
// import news6 from '@/public/news/6.jpg';
import news7 from '@/public/news/7.jpg';

const news = [
  {
    id: 1,
    title: '',
    link: '/news',
    url: 'bg-[url("../public/news/7.jpg")]',
    img: news7,
    text: [
      {
        id: 1,
        t1: [
          'Модные, локальные, премиальные бренды в одном пространстве в ТРК «СИТИ ЦЕНТР»!',
          '20 июля открытие POP UP STORE - пространства с уникальными локальными дизайнерами. Следите за подробностями в наших социальных сетях.',
        ],
      },
    ],
  },
  {
    id: 2,
    title: '',
    link: '/news',
    url: 'bg-[url("../public/news/1.jpg")]',
  },
  {
    id: 3,
    title: '',
    link: '/news',
    url: 'bg-[url("../public/news/1-1.jpg")]',
  },
  {
    id: 4,
    title: '',
    link: '/news',
    url: 'bg-[url("../public/news/3.jpg")]',
  },
  // {
  //   id: 1,
  //   img: news4,
  //   imgm: news4,
  //   title: ['Уважаемые Гости!'],
  //   text: [
  //     {
  //       id: 1,
  //       t1: [
  //         'Сегодня — День Рождения ТРК «СИТИ ЦЕНТР» 🎉',
  //         <br key={1} />,
  //         'Каждый год привносит в ТРК новые уникальные события, красочные улучшения и запоминающиеся мероприятия, но одно остается неизменным — наше доверие к вам и желание становиться лучше с каждым пройденным месяцем🤍',
  //         'Мы бесконечно благодарны вам за эмоции и отдачу, которую мы видим каждый день, и надеемся, что в следующем, юбилейном году ТРК мы достигнем еще более новых высот вместе с вами — нашими Гостями 🎉',
  //       ],
  //     },
  //     {
  //       id: 2,
  //       t1: [
  //         'Именно сейчас самое время подумать об обновлении пляжного гардероба, когда новые коллекции купальников и аксессуаров поступили в магазины и еще есть все размеры!',
  //         <br key={1} />,
  //         'В «Эстель Адони» уже представлены самые горячие круизные коллекции от ваших любимых брендов: SHAN, Lise Charmel, Melissa Odabash, Gottex, Maryan Mehlhorn и другие марки с мировыми именами. Мини-бикини, совместные модели, бандо, купальники на одно плечо, парео, туники, сарафаны, платья, халаты, рубашки, топы, юбки, брюки, шорты и еще множество вещей, которые непременно украсят ваш пляжный сезон, уже ждут вас!',
  //       ],
  //     },
  //   ],
  // },
  // {
  //   id: 1,
  //   img: news3,
  //   imgm: news3,
  //   title: [
  //     'МАФИЯ! МАФИЯ! МАФИЯ!',
  //     <br key={1} />,
  //     'Ждем вас на детской МАФИИ (8+)',
  //   ],
  //   text: [
  //     {
  //       id: 1,
  //       t1: [
  //         '⭕ Чем полезна игра?',
  //         <br key={1} />,
  //         'Мафия познакомит юных участников с принципами логических рассуждений, научит прислушиваться к окружающим и анализировать их поступки, покажет, как правильно формулировать мысли. Кроме того, Мафия развивает фантазию: в процессе игры дети придумывают себе роли и вживаются в них.',
  //       ],
  //     },
  //     {
  //       id: 2,
  //       t1: [
  //         'Когда: 4.08 И 17.08',
  //         <br key={1} />,
  //         'Время: 18:30-20:30',
  //         <br key={2} />,
  //         'Место: ТРК СИТИ ЦЕНТР',
  //         <br key={3} />,
  //         '❗Стоимость участия: 1500 ₽',
  //         <br key={4} />,
  //         ' * Участники игры поужинают в одном из двух ресторанов ТРК" СИТИ ЦЕНТР"  @don_bazilio , @love_truffle_rest😉',
  //         <br key={5} />,
  //         'Получат подарки от @kenguru_krd 🙌',
  //         <br key={6} />,
  //         'И обязательно  будет фотоотчет📸',
  //         <br key={7} />,
  //         '❗❗КОЛИЧЕСТВО МЕСТ ОГРАНИЧЕНО.',
  //       ],
  //     },
  //   ],
  // },
  // {
  //   id: 5,
  //   img: news6,
  //   imgm: news6,
  //   title: ['Скидки до 40% на летней распродаже в «Эстель Адони»!'],
  //   text: [
  //     {
  //       id: 1,
  //       t1: [
  //         'Еще больше моделей знаменитых европейских брендов со скидками 30% и 40% ждут вас в салоне «Эстель Адони». Не упустите возможность купить модные купальники, изящное белье и стильную одежду для летнего отдыха по приятным ценам!',
  //         <br key={1} />,
  //         'Порадуйте себя соблазнительными комплектами из прозрачной сетки или воздушного кружева, подберите идеальные базовые модели под любимые летние наряды! Обратите внимание на пижамы, сорочки и халаты из натуральных материалов, которые так приятно носить в жару.',
  //       ],
  //     },
  //     {
  //       id: 2,
  //       t1: [
  //         'Для незабываемого морского отдыха мы подберем вам идеальный гардероб: оригинальные купальники и пляжную одежду, которые дополним элегантными аксессуарами.',
  //         <br key={1} />,
  //         'Приглашаем в «Эстель Адони» за отличным настроением и выгодными новинками для солнечных дней!',
  //       ],
  //     },
  //   ],
  // },
  // {
  //   id: 2,
  //   img: news2,
  //   imgm: news2,
  //   title: [''],
  //   text: [
  //     {
  //       id: 1,
  //       t1: [
  //         '🗓 24 августа в 18:00 мы встречаемся в @citycenter_krd @kinomonitor, где посмотрим очередной потрясающий фильм и обсудим его смыслы вместе с экспертами кино и не только:',
  //         <br key={1} />,
  //         '✅ Алексей Двоеглазов - журналист, кинокритик, автор проекта @kinopohod',
  //         <br key={2} />,
  //         '✅ Юрий Архангельский - Заведующий кафедрой режиссуры кино и телевидения КГИК',
  //         <br key={3} />,
  //         '✅ Алексей Русакевич @alexey.rusakevich - психолог, гипнолог.',
  //         <br key={4} />,
  //         'А спикерами будет каждый присутствующий зритель 😉',
  //       ],
  //     },
  //     {
  //       id: 2,
  //       t1: [
  //         'Партнеры проекта:',
  //         <br key={1} />,
  //         '@pani.bulochka',
  //         <br key={2} />,
  //         '@ipatov.brand',
  //         <br key={3} />,
  //         '@don_bazilio',
  //         <br key={4} />,
  //         '@luding.ru',
  //         <br key={5} />,
  //         '@geometria.krd',
  //         <br key={6} />,
  //         '@concept_store_krd_',
  //         <br key={7} />,
  //         '@giorgio_boutique',
  //         <br key={8} />,
  //         '@sergeyteyvanov',
  //       ],
  //     },
  //     {
  //       id: 3,
  //       t1: [
  //         'Билеты можно приобрести по ссылке в шапке профиля или написав нам в Директ ➡ @bolshie.volshebniki',
  //       ],
  //     },
  //   ],
  // },
  // {
  //   id: 3,
  //   img: news1,
  //   imgm: news1,
  //   title: ['Финал распродажи в Эстель Адони!'],
  //   text: [
  //     {
  //       id: 1,
  //       t1: 'Настало время для самого выгодного шопинга в «Эстель Адони»!',
  //     },
  //     {
  //       id: 2,
  //       t1: 'Только 5 дней, с 24 по 28 августа, в салонах нашей сети пройдет Финальная распродажа.',
  //     },
  //     {
  //       id: 3,
  //       t1: [
  //         'Не пропустите максимальные скидки на белье, купальники и одежду для отдыха от известных мировых брендов. Успейте поймать все самое лучшее!',
  //       ],
  //     },
  //   ],
  // },
  // {
  //   id: 4,
  //   img: news5,
  //   imgm: news5,
  //   title: [
  //     'Торопитесь на финальную распродажу в салонах мужского белья Х.О.!',
  //   ],
  //   text: [
  //     {
  //       id: 1,
  //       t1: 'Последний шанс успеть!',
  //     },
  //     {
  //       id: 2,
  //       t1: [
  //         'Всего 5 дней, с 24 по 28 августа, скидки до 60%! Грандиозный SALE на белье, пляжную и домашнюю одежду от ваших любимых Bikkembergs, Emporio Armani, Moschino, Hugo Boss, Dolce&Gabbana, Guess, Karl Lagerfeld и других модных брендов.',
  //       ],
  //     },
  //     {
  //       id: 3,
  //       t1: ['Позвольте себе самое лучшее качество по доступной цене!'],
  //     },
  //   ],
  // },
];

// __________________Галерея____________________
const galleryVesna = [
  {
    id: 1,
    src: '/gallery/vesna/1.jpg',
  },
  {
    id: 2,
    src: '/gallery/vesna/2.jpg',
  },
  {
    id: 3,
    src: '/gallery/vesna/3.jpg',
  },
  {
    id: 4,
    src: '/gallery/vesna/4.jpg',
  },
  {
    id: 5,
    src: '/gallery/vesna/5.jpg',
  },
];
const galleryBigCinema = [
  1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 19, 20, 21, 22, 23, 24,
  25, 26, 27, 29, 30, 31, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45,
  46, 47, 48, 49, 50, 51, 52, 54, 56, 57, 58, 59, 60, 61, 63, 64, 65, 66, 67,
  68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86,
  87, 88, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105,
  106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 134, 135, 136, 137, 138,
  139, 140, 141, 142, 143, 146, 147, 148, 149, 150, 151,
];
const champion = [
  1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22,
  23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41,
  42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60,
  61, 62, 63, 64, 65, 66, 67,
];

const june = [
  1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22,
  23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41,
  42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60,
  61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79,
  80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98,
  99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114,
  115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129,
  130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144,
  145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159,
  160, 161, 162, 163, 164, 165,
];

const mart = [
  1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22,
  23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41,
  42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60,
  61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79,
  80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98,
  99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114,
  115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129,
  130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144,
  145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159,
  160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174,
  175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189,
  190, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 204,
  205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219,
  220, 221, 222, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234,
  235, 236, 237, 238, 239, 240, 241, 242, 243, 244, 245, 246, 247, 248, 249,
];

const flamenko = [
  1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22,
  23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41,
  42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60,
  61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79,
  80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98,
  99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114,
  115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129,
  130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144,
  145, 146, 147, 148, 149, 150,
];

const birthday = [
  1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22,
  23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41,
  42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60,
  61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79,
  80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 92, 96, 97, 98, 99, 100, 101, 102,
  103, 106, 107, 108, 109, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123,
  124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138,
  139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153,
  154, 155, 156, 157, 159, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172,
  173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187,
  188, 189,
];

const dayYoungBrand = [
  1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22,
  23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41,
  42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60,
  61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79,
  80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98,
  99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114,
  115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127,
];

const starsInCity = [
  1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22,
  23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41,
  42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60,
  61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73,
];

import event1 from '@/public/event_city/Flamenko/1.jpg';
import event2 from '@/public/event_city/Vesna/1.jpg';
import event3 from '@/public/event_city/ONEDAYkids/1.jpg';
import event4 from '@/public/event_city/Pasxa/1.jpg';
import event5 from '@/public/event_city/1_june/1.jpg';
import event6 from '@/public/event_city/Birthday/1.jpg';
import event7 from '@/public/event_city/KUBAN_DESIGNSTORE_open/1.jpg';
import event8 from '@/public/event_city/ModniyBrend/1.jpg';
import event9 from '@/public/event_city/StarsInCity/1.jpg';
import event10 from '@/public/event_city/Papaya/1.jpg';
import event11 from '@/public/event_city/ConceptStore/1.jpg';
import event12 from '@/public/event_city/OtherCinema/1.jpg';
import event13 from '@/public/event_city/Giorgio/1.jpg';
import event14 from '@/public/event_city/CinemaVine/1.jpg';
import event15 from '@/public/event_city/ParfumeGiorgio/1.jpg';
import event16 from '@/public/event_city/Miller/1.jpg';
import event17 from '@/public/event_city/Audi/2.jpg';
import event18 from '@/public/event_city/Aromat/1.jpg';
import event19 from '@/public/event_city/MissKrasnodar/1.jpg';
import event20 from '@/public/event_city/Zabeg/1.jpg';

//              Мероприятия
const eventArray = [
  {
    id: id++,
    link: '/event_city/stars_in_city/',
    img: event9,
    text: 'Звезды в Сити',
    target: '',
  },
  {
    id: id++,
    link: '/event_city/day_young_brand/',
    img: event8,
    text: 'День Модного Бренда',
    target: '',
  },
  {
    id: id++,
    link: 'https://geometria.ru/reportage/786030-kuban-design-store-otkrytie/',
    img: event7,
    text: 'KUBAN DESIGNSTORE OPEN',
    target: '_blank',
  },
  {
    id: id++,
    link: 'https://geometria.ru/reportage/783594-odin-den-s-blogerami-i-detmi-siti-tsentr/',
    img: event3,
    text: 'ONE DAY kids',
    target: '_blank',
  },
  {
    id: id++,
    link: 'https://geometria.ru/reportage/782706-paskhalnye-master-klassy-v-trk-siti-tsentr/',
    img: event4,
    text: 'Пасхальный мастер класс',
    target: '_blank',
  },
  {
    id: id++,
    link: '/event_city/birthday',
    img: event6,
    text: 'День рождения сити центра',
    target: '',
  },
  {
    id: id++,
    link: 'https://geometria.ru/reportage/775785-otkrytie-flagmanskogo-magazina-rossiyskogo-brenda-zhenskoy-odezhdy-papaya-papaya/',
    img: event10,
    text: 'Открытие магазина PAPAYA',
    target: '_blank',
  },
  {
    id: id++,
    link: 'https://geometria.ru/reportage/774521-den-rozhdeniya-concept-store-1god/',
    img: event11,
    text: 'День Рождения Concept Store',
    target: '_blank',
  },
  {
    id: id++,
    link: '/event_city/1_june',
    img: event5,
    text: 'День защиты детей',
    target: '',
  },
  {
    id: id++,
    link: 'https://geometria.ru/reportage/727490-monitor-siti-de-luxe-drugoe-kino/',
    img: event12,
    text: 'МОНИТОР «Другое Кино»',
    target: '_blank',
  },
  {
    id: id++,
    link: '/event_city/vesna_v_citycenter/',
    img: event2,
    text: 'ВЕСНА В ТРК «СИТИ ЦЕНТР»',
    target: '',
  },
  {
    id: id++,
    link: 'https://geometria.ru/reportage/723868-sedmaya-vesna-v-giorgio-siti-tsentr/',
    img: event13,
    text: 'Седьмая весна в GIORGIO',
    target: '_blank',
  },
  {
    id: id++,
    link: '/event_city/flamenko/',
    img: event1,
    text: 'ФОТОВЫСТАВКА «ФЛАМЕНКО»',
    target: '',
  },
  {
    id: id++,
    link: 'https://geometria.ru/reportage/684923-zvyezdnaya-premera-filma-v-vinnom-otrazhenii-v-kinoteatre-monitor-siti-de-luxe/',
    img: event14,
    text: 'Фильм "В винном отражении"',
    target: '_blank',
  },
  {
    id: id++,
    link: 'https://geometria.ru/reportage/683920-parfyumernyi-butik-giorgio-seks-kotiki-i-rock-n-roll/',
    img: event15,
    text: 'Парфюмерный бутик Giorgio',
    target: '_blank',
  },
  {
    id: id++,
    link: 'https://geometria.ru/reportage/26696-pervaya-personalnaya-vystavka-khudozhnitsy-aleksandry-miller/',
    img: event16,
    text: 'Выставка Александры Миллер',
    target: '_blank',
  },
  {
    id: id++,
    link: 'https://geometria.ru/reportage/7082-siti-tsentr-zakrytyi-pokaz-filma-mstiteli-final-ot-audi-tsentra-kuban-i-audi-tsentra-krasnodar/',
    img: event17,
    text: 'Показ фильма от Ауди Центра',
    target: '_blank',
  },
  {
    id: id++,
    link: 'https://geometria.ru/reportage/434733-prezentatsiya-aromata-ot-maestro-laurent-mazzone-korolevskie-grezy-v-parfyumernom-butike-giorgio/',
    img: event18,
    text: 'Презентация аромата Giorgio',
    target: '_blank',
  },
  {
    id: id++,
    link: 'https://geometria.ru/reportage/149162-1-08-trk-siti-tsentr-miss-krasnodar-2008/',
    img: event19,
    text: 'МИСС КРАСНОДАР 2008',
    target: '_blank',
  },
  {
    id: id++,
    link: 'https://geometria.ru/reportage/139510-trk-siti-tsentr-zabeg-na-shpilkakh/',
    img: event20,
    text: 'Забег на шпильках',
    target: '_blank',
  },
];

export {
  menu,
  sliderTop,
  sliderCenter,
  news,
  galleryVesna,
  galleryBigCinema,
  champion,
  june,
  mart,
  flamenko,
  birthday,
  shopList,
  dayYoungBrand,
  starsInCity,
  eventArray,
};
