let id = 1;
import news140_1 from '@/public/news/140-1.jpg';
import news140 from '@/public/news/140.jpg';
import news141 from '@/public/news/141.jpg';
import news142 from '@/public/news/142.jpg';
import news143 from '@/public/news/143.jpg';
import news144 from '@/public/news/144.jpg';
import news145 from '@/public/news/145.jpg';
import news146 from '@/public/news/146.jpg';
import news147 from '@/public/news/147.jpg';
import news148 from '@/public/news/148.jpg';
import news149 from '@/public/news/149.jpg';
import news150_1 from '@/public/news/150-1.jpg';
import news150_2 from '@/public/news/150-2.jpg';
import news150_3 from '@/public/news/150-3.jpg';
import news150 from '@/public/news/150.jpg';
import news151 from '@/public/news/151.jpg';
import news152 from '@/public/news/152.jpg';
import news153 from '@/public/news/153.jpg';
import news154 from '@/public/news/154.jpg';
import news155 from '@/public/news/155.jpg';
import news156 from '@/public/news/156.jpg';
import news157 from '@/public/news/157.jpg';
// import news77 from '@/public/services/ChistoBlisto/logo.jpg';

const arrayNews = [
  {
    id: id++,
    img1: news157,
    text: [
      '🤩🤩🤩 Летнее предложение в Togas',
      'Весь август скидки до −40% на текстиль, товары для сна и декор для дома!',
      'Предложение не суммируется с другими акциями и предложениями. Бонусы по программе лояльности не начисляются и не списываются на товары, купленные со скидкой. Количество товаров, участвующих в акции, ограничено.',
      '📍2 этаж, ТРК «СИТИ ЦЕНТР»',
    ],
    link: '/news#new1',
  },
  {
    id: id++,
    img1: news156,
    text: [
      'Летний SALE -50% в бутике Weekend MaxMara 😍',
      'Самые стильные вещи сезона по невероятным ценам — отличная возможность обновить гардероб.',
      'Желаем приятных покупок и вдохновения!',
      '📍2 этаж, ТРК «СИТИ ЦЕНТР»',
    ],
    link: '/news#new2',
  },
  {
    id: id++,
    img1: news155,
    text: [
      '🤩🤩🤩 Fifty Four Jusbox в Giorgio',
      'Легендарный клуб Studio 54 жил всего 33 месяца, но оставил вечную память о вечеринках, безумстве и знаменитостях. Во флаконе Fifty Four Jusbox смешались эйфория, волнение, музыка и свет — пинаколада и табак в одном сумасшедшем миксе ❤️',
      'Успейте почувствовать атмосферу легенды — сейчас аромат Fifty Four Jusbox в Giorgio со скидкой 50%!',
    ],
    link: '/news#new3',
  },
  {
    id: id++,
    img1: news154,
    text: [
      'Weekend Max Mara — первое поступление коллекции Осень‑Зима 26/27 🍂',
      'Приглашаем за обновлением гардероба: безупречный итальянский стиль и вдохновение, которое можно носить уже сейчас. Образы, которые легко впишутся в ваш повседневный и деловой гардероб!',
      'Заходите примерить и подобрать свой новый образ 🤍',
      '📍2 этаж, ТРК «СИТИ ЦЕНТР»',
    ],
    link: '/news#new4',
  },
  {
    id: id++,
    img1: news153,
    text: [
      'Летняя коллекция одежды Togas 🌊',
      'Милос — там, где вечность встречается с эстетикой. В свой юбилейный год Togas представляет летнюю кампанию, в которой гармонично сочетаются бесценное природное искусство Греции и утонченные образы для идеального летнего отдыха.',
      'На протяжении века бренд остается верным своей философии эстетичного образа жизни, показывая, как изящно интегрировать комфорт в путешествия: натуральные материалы, продуманные силуэты и инновационные волокна. Контраст белых скал и чистой бирюзовой воды стал естественным продолжением цветовой палитры коллекций.',
      'Легкие ткани повторяют движения морского бриза, а природные оттенки передают атмосферу острова Милос, где каждая деталь пребывает в идеальном равновесии.',
      'Летняя коллекция Togas — это источник вдохновения, в котором сочетаются греческое наследие и элегантность, рожденная временем 🤍',
      '📍2 этаж, ТРК «СИТИ ЦЕНТР»',
    ],
  },
  {
    id: id++,
    img1: news152,
    text: [
      'Мастер‑класс в «СИТИ КАФЕ»',
      '8 августа в 14:00 приглашаем на творческий мастер‑класс по созданию цветочной композиции!',
      'Проведите тёплый и вдохновляющий час в уютной атмосфере — научитесь составлять красивые букеты и унесёте домой своё авторское творение 🌷',
      'Стоимость участия — 2000₽ + любой напиток в кофейне',
      'Запись по телефону: +7‑989‑003‑02‑01',
    ],
  },
  {
    id: id++,
    img1: news151,
    text: [
      'Волшебный вечер в ТРК «СИТИ ЦЕНТР» — балет Рудольфа Нуреева «Лебединое озеро» ❤️',
      '6 августа в 19:30 на большом экране — легендарная постановка Венской государственной оперы (Австрия).',
      'Композитор: Петр Ильич Чайковский. В главных партиях — Рудольф Нуреев и Марго Фонтейн — «лёд и пламень» мирового балета: страстный, стремительный Нуреев и тонкая, идеальная Фонтейн создают один из самых знаменитых дуэтов XX века.',
      'В 1966 году спектакль был снят на видео — и теперь вы сможете увидеть эту яркую, немного ретро‑запись в отличном качестве на большом экране.',
      'Проведите вечер искусства в ТРК «СИТИ ЦЕНТР» 🥂',
    ],
    url: 'https://kinomonitor.ru',
    urltext: '🎟 Билеты уже в продаже на kinomonitor.ru',
  },
  {
    id: id++,
    img1: news150,
    img2: news150_1,
    img3: news150_2,
    img4: news150_3,
    text: [
      'Летняя распродажа в Evergreen 🌷',
      'Распродажа действует на весь ассортимент — а спецпредложения такие: -50% на вазы, кашпо и деревья -70% на цветы и ветки.',
      'Дополните интерьер стильными элементами или обновите садовую зону по приятным ценам!',
      'Акция действует до 31 августа',
      '📍3 этаж, ТРК «СИТИ ЦЕНТР»',
    ],
  },
  {
    id: id++,
    img1: news149,
    text: [
      'Летняя распродажа в «Дикой Орхидее»',
      'В бутике вас ждут скидки до 50% на премиальное бельё, одежду для дома, купальники и стильные аксессуары.',
      'Откройте для себя коллекции, в которых сочетаются комфорт, изысканный дизайн и высокое качество исполнения!',
      'Самое время обновить гардероб и выбрать то, что подчеркнёт вашу индивидуальность 🤍',
      '📍 1 этаж, ТРК «СИТИ ЦЕНТР»',
    ],
  },
  {
    id: id++,
    img1: news148,
    text: [
      'Официальное открытие «СИТИ КАФЕ» ✨',
      '25 июля в 12:00 приглашаем вас на открытие нового пространства для встреч, приятных разговоров и незабываемых впечатлений!',
      ' ',
      'В этот день вас ждут:',
      '— живая музыка и изысканная атмосфера',
      '— работа профессионального шаржиста',
      '— беспроигрышный розыгрыш',
      '— приятные подарки для каждого гостя',
      ' ',
      'Будем рады разделить с вами этот особенный момент 🤍',
    ],
  },
  {
    id: id++,
    img1: news147,
    text: [
      'Волшебный вечер в ТРК «СИТИ ЦЕНТР» 🥂',
      '23 июля в 19:00 в кинотеатре «Монитор Сити» — показ спектакля «Ложные признания» (16+) по пьесе Пьера де Мариво.',
      'Постановка Московского драматического театра им. А. С. Пушкина.',
      'Режиссёр-постановщик: Евгений Писарев.',
      'В главных ролях: Виктория Исакова, Вера Алентова.',
      'Изысканная интрига, блестящие диалоги и большой экран — проведите вечер в атмосфере настоящего французского шарма 🎭',
    ],
    url: 'https://kinomonitor.ru',
    urltext: '🎟 Билеты уже в продаже на kinomonitor.ru',
  },
  {
    id: id++,
    img1: news146,
    text: [
      'Новая коллекция MARC CAIN',
      'Новая осень от немецкого премиум-бренда уже в бутике!',
      'Наполните гардероб элегантными новинками, которые сочетают безупречный крой, премиальные материалы и узнаваемый стиль бренда 🤍',
    ],
  },
  {
    id: id++,
    img1: news145,
    text: [
      'Специальный показ «Дневной красавицы» в ТРК «СИТИ ЦЕНТР» 🎬',
      '15 июля в 19:30 приглашаем на особый вечер в кинотеатр «МОНИТОР Сити» — скандальный шедевр Луиса Бунюэля «Дневная красавица» (18+) на большом экране в 4К-реставрации.',
      'Культовая роль Катрин Денёв — хрупкая внешне и вулкан внутри — стала легендой. Почему фильм называют одним из самых стильных в истории и как костюмы Ива Сен-Лорана формируют образ и смысл, разберём сразу после сеанса вместе с экспертами.',
      'Вас ждут:',
      '— Специальный показ «Дневной красавицы» (18+) в 4К',
      '— Обсуждение с экспертами киноклуба «Монитора»: кинокритиком Виктором Венгерским и стилистом, организатором встреч по истории моды Ириной Дурлештер',
      'Если вам близки великое кино и мода, этот вечер нельзя пропустить!',
    ],
    url: 'https://kinomonitor.ru',
    urltext: '🎟 Билеты уже в продаже на kinomonitor.ru',
  },
  {
    id: id++,
    img1: news144,
    text: [
      '🤩🤩🤩 Летнее предложение в Togas',
      'Июль — отличное время, чтобы добавить в дом ещё больше уюта и обновить любимый текстиль ❤️',
      'В бутике Togas действует специальное предложение: до −35% на избранный ассортимент текстиля, товаров для сна и предметов декора.',
      'Создайте пространство, в которое хочется возвращаться каждый день, с качественными коллекциями Togas, где каждая деталь продумана для вашего комфорта.',
      'Акция действует до 31 июля',
      '📍 2 этаж, ТРК «СИТИ ЦЕНТР»',
    ],
    link: '/news#new4',
  },
  {
    id: id++,
    img1: news143,
    text: [
      'Рады сообщить об открытии «Сити Кафе» ❤️',
      'Теперь у нас появилось новое уютное пространство, где можно сделать паузу в насыщенном дне, встретиться с друзьями, насладиться ароматным кофе, вкусными блюдами и приятной атмосферой.',
      '«Сити Кафе» — место, где каждый визит становится поводом немного замедлиться, отдохнуть и провести время с удовольствием.',
      'Приходите знакомиться с новым гастрономическим пространством и открывать для себя любимые вкусы ☕️',
      '📍 1 этаж, ТРК «СИТИ ЦЕНТР»',
    ],
  },
  {
    id: id++,
    img1: news142,
    text: [
      'UFC в ТРК «СИТИ ЦЕНТР» 🥊',
      'Только в ночь с 11 на 12 июля в 04:00 в кинотеатре «Монитор Сити» смотрите прямую трансляцию турнира UFC 329.',
      'На большом экране — главное событие года! Возвращение легендарного Конора Макгрегора! Харизматичный ирландец сразится с не менее именитым соперником — Максом Холлоуэйем. Уникальная возможность почувствовать себя частью зрелищного противостояния великих бойцов 🔥',
      'Заряжайся энергией UFC и смотри турнир на большом экране!',
    ],
    url: 'https://kinomonitor.ru',
    urltext: '🎟 Билеты уже в продаже на kinomonitor.ru',
  },
  {
    id: id++,
    img1: news141,
    text: [
      'Невероятное событие, которое нельзя пропустить!',
      '9 июля в 19:00 в кинотеатре «Монитор Сити» состоится премьера оперы Гаэтано Доницетти «Мария Стюарт» (16+), прямая трансляция с Зальцбургского фестиваля (Австрия) 🎥',
      'История двух королев — Чёрной и Белой — в захватывающей борьбе за трон.',
      'В главных ролях — две выдающиеся оперные дивы: Кейт Линдси и Лизетт Оропеса. Их «королевская битва» наполняет сюжет эмоциями, страстью и силой человеческой драмы.',
      '*Опера на итальянском языке с русскими субтитрами.',
      'Погрузитесь в атмосферу высокого искусства и проведите этот вечер в компании гениальной музыки 🤍',
    ],
    url: 'https://kinomonitor.ru',
    urltext: '🎟 Билеты уже в продаже на kinomonitor.ru',
  },
  {
    id: id++,
    img1: news140,
    img2: news140_1,
    text: [
      'Новинка в Giorgio: легендарная селективная марка Rouge Bunny Rouge уже в ТРК «СИТИ ЦЕНТР» 💄',
      'После масштабного перезапуска под руководством AKS Concept Studio итальянский бренд вернулся с обновленной визуальной идентичностью и переработанной коллекцией.',
      'В линейке — декоративная косметика на каждый день: тонкие текстуры, ухаживающие компоненты и палитра оттенков от деликатных нюдов до фирменного насыщенного бордового. Особое внимание — культовым помадам, сочетающим цвет, комфорт и уход.',
      'Приходите знакомиться с новинками, делать свотчи и находить свой идеальный оттенок в бутике Giorgio 🤍',
    ],
  },
  // {
  //   id: id++,
  //   img1: news139,
  //   text: [
  //     '🤩🤩🤩 особое предложение для тех, кто ценит эстетику в бутике Togas',
  //     '−35% на шопинг для дома и отдыха только до 30 июня',
  //     'Скидки не суммируются с другими предложениями. Количество товаров ограничено.',
  //     '📍 2 этаж, ТРК «СИТИ ЦЕНТР»',
  //     '📞 +7 861 204 01 49',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news138,
  //   text: [
  //     'Marc Cain весна‑лето 2026',
  //     'В бутике уже можно примерить новинки! Особое внимание стоит обратить на линию Summer Flash.',
  //     'Лёгкие ткани, расслабленные, но продуманные силуэты — вещи легко собрать и в городской образ, и в отпуск.',
  //     'Коллекция делает ставку на современную женственность, комфорт и внимание к деталям 🤍',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news137,
  //   text: [
  //     '🤩🤩🤩 в «Эстель Адони»',
  //     'До 30 июня действует специальное предложение: при покупке комплекта белья или двух бюстгальтеров французского бренда Simone Pérèle вы получаете скидку 20% ❤️',
  //     'Simone Pérèle — это воплощение французской элегантности, безупречной посадки и комфорта. Бельё, которое подчёркивает естественную красоту, дарит уверенность и ощущается на теле практически невесомо.',
  //     'Порадуйте себя новинками любимого бренда и добавьте в лето ещё больше красоты и комфорта',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news136,
  //   text: [
  //     'Волшебный вечер в ТРК «СИТИ ЦЕНТР» 🥂',
  //     'В основе постановки — знаменитая кантата Карла Орфа, вдохновлённая средневековыми текстами о судьбе, любви, надежде и вечном колесе фортуны, которое меняет человеческие жизни.',
  //     'Эдвард Клюг воплотил музыку в пластике, создав завораживающий балет, где каждое движение наполнено смыслом, а строгая геометрия танца соединяется с глубокими эмоциями и драматизмом.',
  //     'На экране зрителей ждёт масштабное произведение искусства, объединившее музыку, хор, симфонический оркестр и балет в единое впечатляющее действо ❤️',
  //     'Создайте пространство, где каждая деталь наполнена гармонией, красотой и ощущением спокойствия.',
  //   ],
  //   url: 'https://kinomonitor.ru',
  //   urltext: '🎟 Билеты уже в продаже на kinomonitor.ru',
  // },
  // {
  //   id: id++,
  //   img1: news135,
  //   text: [
  //     'Новая коллекция от Togas',
  //     'В год своего 100-летнего юбилея бренд представляет флагманскую коллекцию «Дельфия» — вдохновлённую величием древней Эллады и переосмысленную в современном прочтении.',
  //     'Главный мотив коллекции — изящные завитки аканта, выполненные в технике визуальной ретроспективы, создающей эффект лёгкой дымки времени и особую атмосферу утончённой роскоши 🤍',
  //     'Основой коллекции стало постельное бельё из инновационной ткани SENSOTEX®, сочетающей шелковистую мягкость и комфорт. Также в коллекцию вошли покрывала, фарфор, столовый текстиль, мраморные аксессуары и интерьерные ароматы.',
  //     'Создайте пространство, где каждая деталь наполнена гармонией, красотой и ощущением спокойствия.',
  //     '📍 2 этаж, ТРК «СИТИ ЦЕНТР»',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news134,
  //   text: [
  //     'Специальный показ фильма «Марк глазами Софии» 🎬',
  //     '24 июня в 19:30 приглашаем вас на особый вечер — показ фильма «Марк глазами Софии» (18+) режиссёра Софии Копполы.',
  //     'Это первая документальная работа Софии Копполы, созданная за пределами художественного кино. Фильм предлагает уникальный взгляд на легендарного модельера Марка Джейкобса и мир высокой моды через призму авторского видения режиссёра.',
  //     'После просмотра гостей ждёт обсуждение фильма с экспертами: ',
  //     '— кинокритиком Виктором Венгерским',
  //     '— стилистом и организатором авторских fashion-встреч Ириной Дурлештер',
  //     'Если вам интересны кино, мода и истории выдающихся личностей, этот вечер точно нельзя пропустить 🤍',
  //   ],
  //   url: 'https://kinomonitor.ru',
  //   urltext: '🎟 Билеты уже в продаже на kinomonitor.ru',
  // },
  // {
  //   id: id++,
  //   img1: news133,
  //   text: [
  //     'Сезон скидок в Concept Store',
  //     'В бутике стартовали горячие скидки на актуальные коллекции — до 50%',
  //     'Это отличная возможность обновить гардероб, найти стильные новинки и приобрести любимые вещи по особенно приятным ценам.',
  //     'Не откладывайте шопинг на потом — самые интересные модели находят своих владельцев быстрее всего',
  //     'Скидки действуют до 25 июня',
  //     '📍 2 этаж, ТРК «СИТИ ЦЕНТР»',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news132,
  //   text: [
  //     'С Днём России! 🇷🇺',
  //     'Россия — страна с удивительной историей, в которой переплетаются эпохи, культуры, традиции и судьбы многих поколений. Именно это наследие вдохновляет нас сохранять лучшее из прошлого и создавать будущее.',
  //     'В этот праздничный день желаем вам мира, благополучия, новых возможностей и поводов гордиться своей страной, своим городом и людьми, которые вас окружают.',
  //     'Пусть в вашем доме всегда будут тепло, гармония и счастье 🤍',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news131,
  //   text: [
  //     '🤩🤩🤩 Каждое украшение рассказывает свою историю',
  //     'Одно подчёркивает характер. Второе отражает настроение. Третье становится частью вашего уникального стиля.',
  //     'До 30 июня в Доме Ювелирной Моды ZOTTY действует специальное предложение:',
  //     '— 10% на первое украшение',
  //     '— 20% на второе',
  //     '— 30% на третье',
  //     'Создавайте собственные сочетания, экспериментируйте с образами и собирайте ювелирную коллекцию, которая будет рассказывать именно вашу историю ❤️',
  //     '📍 1 этаж, ТРК «СИТИ ЦЕНТР»',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news130,
  //   text: [
  //     '11 июня в 20:00 приглашаем вас на необычную встречу с художницей-керамистом и автором проекта «Валюша в стране керамики» ❤️',
  //     'Тема лекции — «Из адского пекла в райский сад. Как оживить осколок: керамика, которая помнит себя разбитой».',
  //     'Поговорим о том, как рождается авторская керамика, почему трещины и несовершенства могут стать частью искусства и какую историю способен рассказать каждый предмет, созданный руками мастера.',
  //     'Это возможность по-новому взглянуть на керамику, познакомиться с творческим процессом и узнать больше о философии проекта «Фактура Керамика» 🥂',
  //     '📍2 этаж, ТРК «СИТИ ЦЕНТР»',
  //     'Бронирование: +7 (918) 049-87-49',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news129,
  //   text: [
  //     '🤩🤩🤩 Время обновить гардероб в MAX&Co.',
  //     'В бутике стартовали скидки 30% на новую коллекцию весна–лето!',
  //     'Лёгкие ткани, актуальные силуэты, яркие акценты и безупречный итальянский стиль — всё, что нужно для нового сезона, уже ждёт вас.',
  //     'Не упустите возможность приобрести понравившиеся модели по привлекательным ценам и добавить в свой гардероб ещё больше летнего настроения ❤️',
  //     '📍2 этаж, ТРК «СИТИ ЦЕНТР»',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news128,
  //   text: [
  //     'Волшебный вечер в ТРК «СИТИ ЦЕНТР»',
  //     '11 июня в кинотеатре «Монитор Сити» состоится премьера спектакля «Я — Сергей Образцов» (16+) от Государственного академического центрального театра кукол им. С.В. Образцова.',
  //     'Это необычное кукольное путешествие через весь XX век, посвящённое жизни и творчеству легендарного Сергея Образцова — человека, который навсегда изменил мир театра кукол.',
  //     'Режиссёр-постановщик спектакля — Екатерина Образцова, внучка великого мастера. В главной роли — Евгений Цыганов.',
  //     'Погрузитесь в атмосферу театрального искусства и откройте для себя удивительную историю, рассказанную языком кукол, воспоминаний и творчества 🤍',
  //   ],
  //   url: 'https://kinomonitor.ru',
  //   urltext: '🎟 Билеты уже в продаже на kinomonitor.ru',
  // },
  // {
  //   id: id++,
  //   img1: news127,
  //   text: [
  //     'Забота о самых важных с Togas',
  //     'До 7 июня в бутике действует специальное летнее предложение — скидки до 30% на избранные коллекции детского текстиля и аксессуаров.',
  //     'Мягкие ткани, продуманные детали и безупречное качество помогут создать для ребёнка атмосферу уюта, комфорта и гармонии дома ',
  //     'Порадуйте маленьких членов семьи красивыми и практичными новинками от бренда с почти вековой историей! ',
  //     ' 2 этаж, ТРК «СИТИ ЦЕНТР»',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news126,
  //   img2: news126_1,
  //   img3: news126_2,
  //   img4: news126_3,
  //   text: [
  //     'SAFINA CONCEPT — это украшения со смыслом, где каждая коллекция рассказывает свою историю и отражает разные грани женской природы',
  //     ' ',
  //     'Здесь украшения становятся не просто аксессуарами, а настоящими эмоциональными артефактами — харизматичными, узнаваемыми и наполненными символами. Каждое изделие создаётся по авторским эскизам, отливается из латуни и покрывается золотом 24k.',
  //     'Особая ценность бренда — внимание к деталям, ручная работа и вдохновение, собранное со всего мира. Это украшения, которые остаются актуальными долгие годы и становятся частью личной истории своей обладательницы! ',
  //     'Сейчас у вас есть уникальная возможность познакомиться с брендом и приобрести изделия SAFINA CONCEPT в pop-up бутике «Кубань Дизайн» ',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news125,
  //   text: [
  //     'Комфорт, который не нужно скрывать 🛍️',
  //     'В салоне «Эстель Адони» действует специальное предложение — скидка 25% на новую и базовую коллекции бренда Like it!',
  //     'Like it! — это немецкое качество, лаконичный дизайн и бельё, которое идеально садится по фигуре, остаётся незаметным под одеждой и дарит комфорт на протяжении всего дня ❤️',
  //     'Порадуйте себя бельём, которое помогает чувствовать уверенность в каждом движении.',
  //     'Акция действует до 30 июня',
  //     '📍2 этаж, ТРК «СИТИ ЦЕНТР»',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news124,
  //   img2: news124_1,
  //   img3: news124_2,
  //   img4: news124_3,
  //   text: [
  //     'Лето начинается с Marc Cain 🌊',
  //     'В бутике Marc Cain представлена новая коллекция Salty Breeze — вдохновлённая морским бризом, путешествиями и атмосферой беззаботного отдыха!',
  //     'Натуральные ткани, благородные оттенки морской волны, лёгкие силуэты и безупречный крой создают образы, в которых комфорт идеально сочетается с элегантностью.',
  //     'Подарите своему гардеробу настроение лета и откройте для себя главные новинки сезона ❤️',
  //     '📍2 этаж, ТРК «СИТИ ЦЕНТР»',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news123,
  //   text: [
  //     'Запах вечности: великое путешествие парфюмерии 🥂',
  //     '4 июня в 20:00 приглашаем вас на увлекательную лекцию о мире ароматов в pop-up бутике «Кубань Дизайн».',
  //     'Вместе с Михаилом Золотарёвым — топ-стилистом и создателем собственного парфюмерного бренда — отправимся в путешествие сквозь эпохи и узнаем, как развивалось парфюмерное искусство. ',
  //     'Также в рамках встречи создатель бренда Dom De Maestro Игорь Сорокин расскажет о философии бренда, истории его создания и вдохновении, которое лежит в основе каждой коллекции.',
  //     'Это встреча для всех, кто интересуется стилем, историей и магией ароматов ❤️',
  //     '📞 Регистрация на мероприятие: +7 (989) 855-85-84',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news122,
  //   img2: news122_1,
  //   img3: news122_2,
  //   img4: news122_3,
  //   text: [
  //     'Дом начинается с деталей 🛍️',
  //     'Togas — бренд с почти вековой историей, который с 1926 года создаёт текстиль и предметы интерьера, объединяющие элегантность, комфорт и безупречное качество.',
  //     'Постельное бельё, текстиль для дома, мебель, аксессуары и одежда — каждая коллекция создаётся с особым вниманием к деталям и вдохновлена философией красивой жизни ❤️',
  //     'Если вы цените уют, эстетику и высокий стиль, обязательно загляните в бутик Togas в ТРК «СИТИ ЦЕНТР».',
  //     '🤍 Для новых клиентов действует эксклюзивное предложение. Подробности уточняйте у консультантов бутика.',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news121,
  //   text: [
  //     'С Днём защиты детей 🤍',
  //     'Пусть детство будет наполнено добром, вдохновением, яркими впечатлениями и возможностью каждый день открывать для себя что-то новое!',
  //     'Желаем детям улыбок и исполнения самых заветных желаний, а взрослым — беречь это особенное время и создавать моменты, которые останутся в памяти на долгие годы!',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news120,
  //   text: [
  //     'Танцы, музыка и атмосфера настоящего праздника 💃🏼',
  //     '31 мая в 16:00 приглашаем вас в на яркую концертную программу с участием коллектива армянского танца «Арин-Берд» ',
  //     'Гостей ждут национальные танцы, живое музыкальное сопровождение, выступления творческих коллективов ❤️',
  //     'Погрузитесь в атмосферу традиций, ритма и ярких эмоций вместе с нами! ',
  //     '📍 ТРК «СИТИ ЦЕНТР»',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news119,
  //   text: [
  //     'Парфюмерные тонкости ✨',
  //     '30 мая в 14:00 приглашаем вас на атмосферную лекцию о мире ароматов в ТРК «СИТИ ЦЕНТР»',
  //     'Поговорим о том, как устроена парфюмерия, почему один аромат раскрывается на всех по-разному и какие нюансы помогают найти «тот самый» парфюм 🤍',
  //     'Спикер встречи — Оксана Бганцева, аромадизайнер и парфюмер.',
  //     'Участие бесплатное',
  //     'Количество мест ограничено!',
  //     '📍 2 этаж, ТРК «СИТИ ЦЕНТР»',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news118,
  //   text: [
  //     'Особое предложение для тех, кто ценит уют и эстетику в бутике Togas',
  //     'До 31 мая выбирайте изысканный текстиль, посуду, аксессуары для дома и ароматы со скидками до 40% на избранный ассортимент.',
  //     'Это идеальный повод создать пространство тишины и гармонии — с мягкими тканями, утончёнными оттенками и настроением весны в каждой детали 🤍',
  //     'Скидки не суммируются с другими предложениями. Количество товаров ограничено.',
  //     '📍 2 этаж, ТРК «СИТИ ЦЕНТР»',
  //     '📞 +7 861 204 01 49',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news117,
  //   text: [
  //     'Яркая весна в Marc Cain',
  //     'В бутике действует скидка -50% на выделенный ассортимент весенней коллекции ✨',
  //     'Сочные оттенки, смелые принты, премиальные ткани и безупречный крой — всё для стильных образов этого сезона.',
  //     'Добавьте красок в свой гардероб и найдите новые любимые сочетания 🤍',
  //     'Количество товара ограничено — ждём вас на примерку!',
  //     '📍 2 этаж, ТРК «СИТИ ЦЕНТР»',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news116,
  //   img2: news116_1,
  //   img3: news116_2,
  //   img4: news116_3,
  //   text: [
  //     'В ТРК «СИТИ ЦЕНТР» открылся «Кубань Дизайн Кооператив» — pop-up бутик краснодарских дизайнеров, художников, ремесленников и керамистов.',
  //     'В одном пространстве собраны уникальные одежда, украшения, аксессуары, предметы интерьера и авторская керамика — многие изделия представлены в единственном экземпляре 🤍',
  //     'Проект создала Анна Сергунова-Козырева — дизайнер и участник международных fashion-проектов. А витрины бутика оформлены работами художника Игоря Михайленко ✨',
  //     'Pop-up пространство будет работать до 30 июня.',
  //     '📍 2 этаж, ТРК «СИТИ ЦЕНТР»',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news115,
  //   text: [
  //     'Волшебный вечер в ТРК «СИТИ ЦЕНТР» 😍',
  //     '28 мая в кинотеатре «Монитор Сити» — специальный показ оперы Джузеппе Верди «Травиата» (16+) на итальянском языке с русскими субтитрами.',
  //     'На большом экране — масштабная постановка Оперного фестиваля в Санкт-Маргаретен (Австрия).',
  //     'Режиссёр-постановщик Роберт Херцль создал впечатляющий спектакль о любви, чувствах и трагической красоте, а главные партии исполняют Кристиане Кайзер и Жан-Франсуа Боррас 🤍',
  //     'Погрузитесь в атмосферу высокого искусства вместе с ТРК «СИТИ ЦЕНТР».',
  //     ' ',
  //   ],
  //   url: 'https://kinomonitor.ru',
  //   urltext: '🎟 Билеты уже в продаже на kinomonitor.ru',
  // },
  // {
  //   id: id++,
  //   img1: news114,
  //   text: [
  //     'Идеальная бельевая капсула к лету.',
  //     'Французский бренд Chantelle знает, каким должно быть бельё для тёплого сезона: лёгким, комфортным и абсолютно незаметным под одеждой!',
  //     'До 31 мая при покупке комплекта или двух бюстгальтеров брендов Chantelle, Chantelle X или линии Chantelle SoftStretch Power вы получите 5 000 бонусов в подарок.',
  //     'Лаконичные базовые модели, гладкое кружево и комфортные трансформеры — всё для стильного и комфортного лета.',
  //     'Порадуйте себя красивым бельём на особых условиях в Эстель Адони.',
  //     '📍 2 этаж, ТРК «СИТИ ЦЕНТР»',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news113,
  //   text: [
  //     'Новые коллекции HUGO и BOSS уже в Concept Store 🛍️',
  //     'В бутике представлены новые коллекции мужской одежды из натурального льна: рубашки, брюки и модели для расслабленных городских и отпускных образов.',
  //     'Спокойные оттенки, актуальные силуэты и вещи, которые хочется носить каждый день.',
  //     'Лаконично. Комфортно. По-летнему элегантно 😍',
  //     '📍 2 этаж, ТРК «СИТИ ЦЕНТР»',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news112,
  //   text: [
  //     'С Днём Великой Победы!',
  //     'Этот день напоминает о силе человеческого духа, мужестве и ценности мира.',
  //     '9 Мая — важная дата, которая объединяет поколения памятью, уважением и благодарностью.',
  //     'Пусть в каждом доме сегодня звучат тёплые слова, истории семей и искренние воспоминания 🤍',
  //     'С любовью, ТРК «СИТИ ЦЕНТР»',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news111,
  //   text: [
  //     'Искусство, воплощённое в украшениях ✨',
  //     'В бутике Renaissance представлена коллекция Annamaria Cammilli — изысканная, выразительная и по-настоящему завораживающая.',
  //     'Плавные линии, уникальные формы и фирменные оттенки золота создают украшения, от которых невозможно оторвать взгляд.',
  //     '📍1 этаж, ТРК «СИТИ ЦЕНТР»',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news110,
  //   text: [
  //     'Волшебный вечер ✨',
  //     '14 мая в 19:00 в кинотеатре «Монитор Сити» — особое событие для ценителей искусства!',
  //     'На большом экране — спектакль «Женитьба» (16+) от Государственный академический театр имени Моссовета.',
  //     'Стильная постановка гоголевского трагифарса в прочтении режиссёра Евгений Марчелли — это тонкий юмор, выразительная сценография и актуальное звучание классики. История о поиске любви, ожиданиях и выборе, которая остаётся современной вне времени.',
  //     'Погрузитесь в атмосферу театра в ТРК «СИТИ ЦЕНТР» 🤍',
  //     ' ',
  //   ],
  //   url: 'https://kinomonitor.ru',
  //   urltext: '🎟 Билеты уже в продаже на kinomonitor.ru',
  // },
  // {
  //   id: id++,
  //   img1: news109,
  //   text: [
  //     'Выпускной — момент, который остаётся с вами навсегда ✨',
  //     'И костюм для этого вечера должен быть безупречным.',
  //     'В Richard MTM создают костюмы на заказ — с учётом вашей фигуры, характера и повода. Это не просто одежда, а точная посадка и индивидуальный стиль.',
  //     'Премиальные ткани от Loro Piana, Scabal и Dormeuil, ручная работа и внимание к деталям — всё, что делает образ по-настоящему особенным.',
  //     'Для выпускников и их пап — идеальный повод прийти вместе и уйти с иголочки 🤍',
  //     'Успейте записаться заранее — сезон уже начался',
  //     '📍2 этаж, ТРК «СИТИ ЦЕНТР»',
  //     '📞 +7 (938) 41-069-51',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news108_1,
  //   img2: news108_2,
  //   img3: news108_3,
  //   img4: news108_4,
  //   text: [
  //     'KINEXT CITY',
  //     '— это пространство, где функциональный и силовой тренинг на премиальном оборудовании сочетаются с уникальными студийными форматами нового поколения.',
  //     'Pilates, TRX, REAXING, иммерсивная ICG-студия — вы выбираете формат под своё настроение и цель, пользуясь приватностью и комфортом в любое время дня.',
  //     'Ваше пространство для силы, восстановления и баланса.',
  //     'KINEXT CITY — когда фитнес становится образом жизни.',
  //     'Предпродажи открыты. Специальная стоимость доступна только на старте продаж 🤍',
  //     '📍2 этаж, ТРК «СИТИ ЦЕНТР»',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news107,
  //   text: [
  //     'С Праздником Весны и Труда!',
  //     'Пусть этот день станет добрым напоминанием о важности баланса — между делом и отдыхом, движением и вдохновением.',
  //     'Желаем вам лёгкости на душе, внутренней гармонии и искреннего удовольствия от каждого дня 🤍',
  //     'С наилучшими пожеланиями, ТРК «СИТИ ЦЕНТР»',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news106,
  //   text: [
  //     'Время обновить пространство и наполнить дом атмосферой весны ✨',
  //     'В бутике Togas в ТРК «СИТИ ЦЕНТР» — особое предложение для тех, кто ценит уют, эстетику и детали.',
  //     'До 15 мая выбирайте изысканный текстиль, посуду, аксессуары для дома и ароматы со скидками до 40% на избранный ассортимент.',
  //     'Это идеальный повод создать пространство тишины и гармонии — с мягкими тканями, утончёнными оттенками и настроением весны в каждой детали 🤍',
  //     'Скидки не суммируются с другими предложениями. Количество товаров ограничено.',
  //     '📍 2 этаж, ТРК «СИТИ ЦЕНТР»',
  //     '📞 +7 861 204 01 49',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news105,
  //   text: [
  //     'Готовимся к лету с комфортом и выгодой ☀️',
  //     'В Эстель Адони — идеальное предложение для обновления базового гардероба: третьи трусики Chantelle SoftStretch в подарок!',
  //     'До 10 мая покупайте двое трусиков из акционного ассортимента и получайте третьи бесплатно 💫',
  //     'Почему миллионы женщин выбирают SoftStretch',
  //     'Это настоящее «белье-невидимка» — оно не выделяется даже под самой тонкой и облегающей одеждой. Идеально для летних образов и тренда на лёгкие ткани.',
  //     'Не упустите шанс приобрести любимое бельё выгодно 🤍',
  //     '📍 2 этаж, ТРК «СИТИ ЦЕНТР»',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news104,
  //   text: [
  //     'Уже 25 апреля в 18:00 состоится весенний форум, где объединятся право, психология и стиль.',
  //     '🕊 Тема: брак, имущество и дети — важные вопросы, о которых стоит говорить открыто и профессионально.',
  //     ' ',
  //     'В программе:',
  //     '— выступления практикующих адвокатов Гоар Галстян и Марины Вейнер',
  //     '— разборы от психологов Альбины Абдул и Марины Шастовой',
  //     '— модный показ и тренды сезона от Галины Дебровой',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news103,
  //   text: [
  //     'История сумок ✨',
  //     '26 апреля в 13:00 приглашаем вас на атмосферную лекцию-погружение в мир моды и культовых аксессуаров в ТРК «СИТИ ЦЕНТР»',
  //     'Поговорим о том, как сумки стали отражением эпохи, статуса и стиля, какие модели вошли в историю и почему они остаются актуальными вне времени.',
  //     'Спикер вечера — Нинэль, стилист, историк моды и фотограф, которая умеет рассказывать о моде так, что она оживает.',
  //     'Участие бесплатное 🤍',
  //     'Количество мест ограничено!',
  //   ],
  //   url: 'https://forms.yandex.ru/u/69a314d24936393cba7ff53c',
  //   urltext: 'Регистрация на мероприятие',
  // },
  // {
  //   id: id++,
  //   img1: news102,
  //   text: [
  //     '🎭 ТРК «СИТИ ЦЕНТР» — место, где встречаются мода, искусство и культура',
  //     'Продолжаем серию культурных вечеров и приглашаем вас 16 апреля в кинотеатр «Монитор Сити» на показ театральной постановки «Таланты и покойники».',
  //     'Вас ждёт яркий и ироничный спектакль по пьесе Марка Твена: история о молодом художнике, который вместе с друзьями решается на дерзкую авантюру.',
  //     'Это вечер для тех, кто ценит искусство, тонкий юмор и нестандартные театральные решения!',
  //     '✨ Приятный бонус для гостей: предъявителю билета на «Волшебный вечер» в ресторане Oysters действует специальное предложение — 3 по цене 2. Подробности у сотрудников ресторана.',
  //   ],
  //   url: 'https://kinomonitor.ru/release/22479?date=2026-04-16',
  //   urltext: 'Купить билеты',
  // },
  // {
  //   id: id++,
  //   img1: news101,
  //   text: [
  //     'С Днём космонавтики! 🚀',
  //     '12 апреля — день, когда человечество сделало шаг за пределы привычного мира, открыв новую эру возможностей.',
  //     'Пусть этот день вдохновляет вас на смелые решения, веру в свои силы и стремление к новым горизонтам 🤍',
  //   ],
  // },
];

export { arrayNews };

//   // {
//   //   id: 4,
//   //   img: news5,
//   //   imgm: news5,
//   //   title: [
//   //     'Торопитесь на финальную распродажу в салонах мужского белья Х.О.!',
//   //   ],
//   //   text: [
//   //     {
//   //       id: 1,
//   //       t1: 'Последний шанс успеть!',
//   //     },
//   //     {
//   //       id: 2,
//   //       t1: [
//   //         'Всего 5 дней, с 24 по 28 августа, скидки до 60%! Грандиозный SALE на белье, пляжную и домашнюю одежду от ваших любимых Bikkembergs, Emporio Armani, Moschino, Hugo Boss, Dolce&Gabbana, Guess, Karl Lagerfeld и других модных брендов.',
//   //       ],
//   //     },
//   //     {
//   //       id: 3,
//   //       t1: ['Позвольте себе самое лучшее качество по доступной цене!'],
//   //     },
//   //   ],
//   // },
// ];
