let id = 1;
import news80 from '@/public/news/80.jpg';
import news81 from '@/public/news/81.jpg';
import news82 from '@/public/news/82.jpg';
import news83 from '@/public/news/83.jpg';
import news84 from '@/public/news/84.jpg';
import news85 from '@/public/news/85.jpg';
import news86 from '@/public/news/86.jpg';
import news87 from '@/public/news/87.jpg';
import news88 from '@/public/news/88.jpg';
import news89 from '@/public/news/89.jpg';
import news90 from '@/public/news/90.jpg';
import news91 from '@/public/news/91.jpg';
import news92 from '@/public/news/92.jpg';
import news93 from '@/public/news/93.jpg';
import news94 from '@/public/news/94.jpg';
import news95 from '@/public/news/95.jpg';
import news96 from '@/public/news/96.jpg';
import news97 from '@/public/news/97.jpg';
import news98 from '@/public/news/98.jpg';
import news99 from '@/public/news/99.jpg';
import news99_1 from '@/public/news/99-1.jpg';
import news99_2 from '@/public/news/99-2.jpg';
import news99_3 from '@/public/news/99-3.jpg';
import news99_4 from '@/public/news/99-4.jpg';
import news100 from '@/public/news/100.jpg';
import news100_1 from '@/public/news/100-1.jpg';
import news100_2 from '@/public/news/100-2.jpg';
import news100_3 from '@/public/news/100-3.jpg';
import news101 from '@/public/news/101.jpg';
import news102 from '@/public/news/102.jpg';
import news103 from '@/public/news/103.jpg';
import news104 from '@/public/news/104.jpg';
import news105 from '@/public/news/105.jpg';
// import news77 from '@/public/services/ChistoBlisto/logo.jpg';

const arrayNews = [
  {
    id: id++,
    img1: news105,
    text: [
      'Готовимся к лету с комфортом и выгодой ☀️',
      'В Эстель Адони — идеальное предложение для обновления базового гардероба: третьи трусики Chantelle SoftStretch в подарок!',
      'До 10 мая покупайте двое трусиков из акционного ассортимента и получайте третьи бесплатно 💫',
      'Почему миллионы женщин выбирают SoftStretch',
      'Это настоящее «белье-невидимка» — оно не выделяется даже под самой тонкой и облегающей одеждой. Идеально для летних образов и тренда на лёгкие ткани.',
      'Не упустите шанс приобрести любимое бельё выгодно 🤍',
      '📍 2 этаж, ТРК «СИТИ ЦЕНТР»',
    ],
    link: '/news#new1',
    url: 'https://forms.yandex.ru/u/69a314d24936393cba7ff53c',
    urltext: 'Регистрация на мероприятие',
  },
  {
    id: id++,
    img1: news104,
    text: [
      'Уже 25 апреля в 18:00 состоится весенний форум, где объединятся право, психология и стиль.',
      '🕊 Тема: брак, имущество и дети — важные вопросы, о которых стоит говорить открыто и профессионально.',
      ' ',
      'В программе:',
      '— выступления практикующих адвокатов Гоар Галстян и Марины Вейнер',
      '— разборы от психологов Альбины Абдул и Марины Шастовой',
      '— модный показ и тренды сезона от Галины Дебровой',
    ],
    link: '/news#new2',
    url: 'https://forms.yandex.ru/u/69a314d24936393cba7ff53c',
    urltext: 'Регистрация на мероприятие',
  },
  {
    id: id++,
    img1: news103,
    text: [
      'История сумок ✨',
      '26 апреля в 13:00 приглашаем вас на атмосферную лекцию-погружение в мир моды и культовых аксессуаров в ТРК «СИТИ ЦЕНТР»',
      'Поговорим о том, как сумки стали отражением эпохи, статуса и стиля, какие модели вошли в историю и почему они остаются актуальными вне времени.',
      'Спикер вечера — Нинэль, стилист, историк моды и фотограф, которая умеет рассказывать о моде так, что она оживает.',
      'Участие бесплатное 🤍',
      'Количество мест ограничено!',
    ],
    link: '/news#new3',
    url: 'https://forms.yandex.ru/u/69a314d24936393cba7ff53c',
    urltext: 'Регистрация на мероприятие',
  },
  {
    id: id++,
    img1: news102,
    text: [
      '🎭 ТРК «СИТИ ЦЕНТР» — место, где встречаются мода, искусство и культура',
      'Продолжаем серию культурных вечеров и приглашаем вас 16 апреля в кинотеатр «Монитор Сити» на показ театральной постановки «Таланты и покойники».',
      'Вас ждёт яркий и ироничный спектакль по пьесе Марка Твена: история о молодом художнике, который вместе с друзьями решается на дерзкую авантюру.',
      'Это вечер для тех, кто ценит искусство, тонкий юмор и нестандартные театральные решения!',
      '✨ Приятный бонус для гостей: предъявителю билета на «Волшебный вечер» в ресторане Oysters действует специальное предложение — 3 по цене 2. Подробности у сотрудников ресторана.',
    ],
    link: '/news#new4',
    url: 'https://kinomonitor.ru/release/22479?date=2026-04-16',
    urltext: 'Купить билеты',
  },
  {
    id: id++,
    img1: news101,
    text: [
      'С Днём космонавтики! 🚀',
      '12 апреля — день, когда человечество сделало шаг за пределы привычного мира, открыв новую эру возможностей.',
      'Пусть этот день вдохновляет вас на смелые решения, веру в свои силы и стремление к новым горизонтам 🤍',
    ],
  },
  {
    id: id++,
    img1: news100,
    img2: news100_1,
    img3: news100_2,
    img4: news100_3,
    text: [
      'Самое время обновить гардероб в ТРК «СИТИ ЦЕНТР»🤍',
      'В мультибрендовом бутике Concept Store — долгожданное поступление коллекций от премиальных европейских брендов Riani и JOOP!',
      'Свежие силуэты, безупречный крой и утончённая палитра оттенков воплощают современную элегантность и стиль вне времени.',
      'Откройте для себя гармонию комфорта и роскоши — этой весной ваш образ станет по-настоящему вдохновляющим ✨',
    ],
  },
  {
    id: id++,
    img1: news99,
    img2: news99_1,
    img3: news99_2,
    img4: news99_3,
    img5: news99_4,
    text: [
      'Поздравляем с приближением Светлой Пасхи 👼🏼',
      'Don Bazilio открывает предзаказ на угощения к празднику:',
      ' ',
      '— Панеттоне с вяленной вишней и кремом пломбир;',
      '— Панеттоне с вяленной вишней и нутеллой;',
      '— Творожный кулич с изюмом и цукатами;',
      '— Шоколадные яйца в глазури;',
      '— Карамельные петушки.',
      ' ',
      'Уточнить стоимость и оформить заказ возможно по телефону: +7 (918) 120-00-13',
    ],
  },
  {
    id: id++,
    img1: news98,
    text: [
      'Новые вкусы уже ждут вас🤍',
      'В ресторане Oysters в ТРК «СИТИ ЦЕНТР» обновили меню — ещё больше изысканных сочетаний, свежих ингредиентов и гастрономического удовольствия.',
      'Попробуйте новинки, откройте для себя новые вкусы и проведите время в атмосфере уюта и эстетики ✨',
    ],
  },
  {
    id: id++,
    img1: news97,
    text: [
      'Форум «Закон и мода на перекрёстке судеб» 🤍',
      '25 апреля в 18:00 в кинотеатре «Монитор Сити» состоится весенний форум, где объединятся право, психология и стиль.',
      '🕊 Тема: брак, имущество и дети — важные вопросы, о которых стоит говорить открыто и профессионально.',
      'Дресс-код: розовый, золотой, белый',
      ' ',
      'В программе:',
      '— выступления практикующих адвокатов Гоар Галстян и Марины Вейнер',
      '— разборы от психологов Альбины Абдул и Марины Шастовой',
      '— модный показ и тренды сезона от Галины Дебровой',
      ' ',
      'Это пространство для тех, кто стремится к юридической безопасности, внутреннему балансу и уверенности в себе.',
      'Билеты уже в продаже — в кассе кинотеатра и на сайте kinomonitor.ru',
    ],
  },
  {
    id: id++,
    img1: news96,
    text: [
      'В ТРК «СИТИ ЦЕНТР» открылся промо-подиум ESTETICA VISION 🤍',
      'Премиальный бренд мебели и матрасов с собственным производством более 40 000 м² и 20-летним опытом представляет коллекции, в которых сочетаются технологии, дизайн и безупречное качество.',
      'В ассортименте — диваны, кровати, кресла, матрасы и столы, созданные из ценных пород древесины и итальянских тканей. А благодаря собственному цеху ювелирного литья бренд реализует даже самые нестандартные дизайнерские решения.',
      'Оцените уровень комфорта и эстетики в ESTETICA VISION ✨',
      '📍1 этаж, ТРК «СИТИ ЦЕНТР»',
    ],
  },
  {
    id: id++,
    img1: news95,
    text: [
      'Именинники марта, у нас для вас особенное предложение 🤍',
      'В пространстве Популярные в Сити действуют скидки на банкет до 10 000 ₽ — праздновать день рождения в будние дни теперь ещё выгоднее.',
      'Специальные условия:',
      '— стоимость посещения для гостей — 1 500 ₽',
      '— имениннику вход бесплатный',
      'Акция действует при праздновании дня рождения в марте в будние дни.',
      'Промокод: ХОЧУ В ПОПУЛЯРНЫЕ',
      'Количество дат ограничено — рекомендуем бронировать заранее.',
      'Подробности и бронирование:',
      '+7 918 333-17-77',
    ],
  },
  {
    id: id++,
    img1: news94,
    text: [
      'Дорогие женщины!',
      'Пусть эта весна подарит вам легкость, свежие мечты и замечательные перемены.',
      'Желаем, чтобы каждый ваш день начинался с улыбки, интересных событий и приятных сюрпризов!',
      'ТРК «Сити Центр» всегда ждет вас за хорошими впечатлениями и стильным настроением. Поздравляем с 8 Марта!',
    ],
  },
  {
    id: id++,
    img1: news93,
    text: [
      'Упакуем ваши подарки 🎁',
      'Совершайте покупки в ТРК «СИТИ ЦЕНТР» и получите бесплатную упаковку подарков для ваших близких ✨',
      ' ',
      'Как это работает?',
      '— совершите покупку в любом бутике ТРК «СИТИ ЦЕНТР»;',
      '— подойдите в наше «Ателье упаковки подарков» с чеком;',
      '— выберите понравившуюся упаковку, а мы красиво оформим ваш подарок.',
      ' ',
      'Акция действует с 6 по 8 марта',
      'Сделайте момент вручения подарка ещё более особенным 🤍',
    ],
  },
  {
    id: id++,
    img1: news92,
    text: [
      'Иногда один цветок говорит больше, чем тысячи слов…',
      '8 марта молодой человек будет встречать гостей ТРК «СИТИ ЦЕНТР» и дарить розы.',
      'Позвольте себе этот красивый жест и окунитесь в атмосферу праздника!',
      'Ждём вас в ТРК «СИТИ ЦЕНТР» 🤍',
    ],
  },
  {
    id: id++,
    img1: news91,
    text: [
      'Высший свет Екатеринодара ✨',
      '6 марта в 19:00 приглашаем вас на атмосферную лекцию-погружение в мир светской жизни Екатеринодара.',
      'Поговорим о моде и манерах, блистательных балах и самых громких событиях прошлого — о времени, когда каждый выход в свет был искусством.',
      'Спикер вечера — Андрей Ступаченко, краевед и экскурсовод, который умеет рассказывать так, что история буквально оживает.',
      'Участие бесплатное 🤍 Количество мест ограничено! Обязательна предварительная регистрация.',
    ],
  },
  {
    id: id++,
    img1: news90,
    text: [
      'Аромат, к которому хочется возвращаться 💫',
      'Musk Therapy — это композиция, которая звучит как мягкая пауза посреди насыщенного дня.',
      'Пудровый белый мускус, сливочный сандал и едва уловимая кислинка чёрной смородины создают ощущение внутреннего баланса и спокойствия.',
      'Для более глубокого звучания эксперты Giorgio рекомендуют наслаивать аромат: крем для тела из коллекции, затем парфюм и ароматную дымку для волос. Так композиция становится ещё мягче и устойчивее.',
      'Идеальный подарок к 8 марта — тонкий, продуманный, запоминающийся 🤍',
    ],
  },
  {
    id: id++,
    img1: news89,
    text: [
      'ТРК «СИТИ ЦЕНТР» поздравляет с Днем Защитника Отечества!',
      'Спасибо всем, кто бережет мир и безопасность, кто готов действовать решительно и честно — на службе, в работе и в семье.',
      'Пусть ваш труд и усилия всегда будут замечены и оценены.',
      'Желаем благополучия, стабильности и уверенного движения к целям. Пусть дома ждут тепло и поддержка, а впереди будет больше возможностей, побед и радостных событий.',
    ],
  },
  {
    id: id++,
    img1: news88,
    text: [
      'БОЛЬШОЙ СЕМЕЙНЫЙ ВЫХОДНОЙ в «Популярные в Сити» 🤍',
      '22 февраля приглашаем провести день, который запомнится всей семье ✨',
      'Вас ждёт насыщенная праздничная программа, любимые герои, свободная игра для детей и по-настоящему тёплая атмосфера, где каждый найдёт радость и вдохновение.',
      ' ',
      'Стоимость билета — 3 000₽',
      'Формат: безлимит на весь день',
      'Подарите себе и детям выходной, который захочется повторять снова и снова 💫',
      ' ',
      'Обратите внимание: вход до 15:00 оплачивается по почасовому тарифу.',
      '📍3 этаж, ТРК «СИТИ ЦЕНТР»',
    ],
  },
  {
    id: id++,
    img1: news87,
    text: [
      'А вы уже выбрали подарок своему мужчине? 🎁',
      'Советуем обратить внимание на стильные аксессуары Boss в бутике Concept Store — ',
      'элегантные портмоне, несессеры и другие детали, которые подчеркнут статус и вкус.',
      'А чтобы подарок выглядел безупречно, дополните его бесплатной упаковкой в нашем ателье подарков ✨',
    ],
  },
  {
    id: id++,
    img1: news86,
    text: [
      'Упакуем ваши подарки 🎁',
      'Совершайте покупки в ТРК «СИТИ ЦЕНТР» и получите бесплатную упаковку подарков для ваших близких✨',
      ' ',
      'Как это работает?',
      '— совершите покупку в любом бутике ТРК «СИТИ ЦЕНТР»; ',
      '— подойдите в наше «Ателье упаковки подарков» с чеком; ',
      '— выберите понравившуюся упаковку, а мы красиво оформим ваш подарок.',
      'Сделайте момент вручения подарка ещё более особенным 🤍',
    ],
  },
  {
    id: id++,
    img1: news85,
    text: [
      'Мир высокой моды — на большом экране 🍿',
      '25 февраля в 19:30 в кинотеатре МОНИТОР Сити состоится специальный показ фильма Кутюр (18+) — за день до всероссийской премьеры.',
      'Главные роли исполнили Анджелина Джоли и Луи Гаррель.',
      'Это история о закулисье Парижской недели высокой моды, где карьера, чувства и судьбы переплетаются в атмосфере красоты и вдохновения.',
      '📌В программе вечера:',
      '— welcome drink',
      '— специальный показ',
      '— обсуждение фильма с приглашёнными экспертами:',
      'Галина Деброва — имиджмейкер, стилист и основатель комьюнити «Стильный Юг»;',
      'Гоар Галстян — адвокат и основатель женского сообщества «Женщина и право».',
      'Идеальный вечер для всех, кто вдохновляется модой и большим кино 🤍',
      ' ',
      '🎟 Билеты уже в продаже на kinomonitor.ru',
    ],
  },
  {
    id: id++,
    img1: news84,
    text: [
      'Откройте для себя пространство, где рождается эстетика уюта и безупречного стиля — бутик Togas в ТРК «СИТИ ЦЕНТР».',
      ' ',
      'Основанный в Греции в 1926 году, бренд на протяжении почти века создаёт текстиль и предметы интерьера, которые становятся частью красивой и гармоничной жизни.',
      'Изысканное постельное бельё, элегантный текстиль, мебель, коллекции для детей и аксессуары — каждая деталь отражает философию Togas: баланс комфорта, качества и утончённого вкуса.',
      'Позвольте вашему дому звучать по-новому — мягко, стильно и по-настоящему роскошно.',
      '📍 2 этаж, ТРК «СИТИ ЦЕНТР»',
    ],
  },
  {
    id: id++,
    img1: news83,
    text: [
      'Настоящая романтика начинается с красивых жестов и безупречных деталей 🤍',
      'Бутик Togas подготовил особое предложение — –25% на каждый второй товар в чеке.',
      'Идеальный повод выбрать изысканные подарки для любимых и наполнить дом атмосферой красоты, уюта и тонкого вкуса ✨',
      'Акция действует до 15 февраля.',
      'Подробности уточняйте у консультантов бутика или по телефону: +7 800 555 37 71',
      '📍 2 этаж, ТРК «СИТИ ЦЕНТР»',
    ],
  },
  {
    id: id++,
    img1: news82,
    text: [
      'Стильная зима с Paul&Shark ✨',
      'В бутике Paul&Shark в ТРК «СИТИ ЦЕНТР» действуют скидки до −40% на выделенный ассортимент зимней коллекции.',
      'Безупречное качество, функциональность и узнаваемый итальянский стиль — идеальный выбор для холодного сезона и выгодный повод обновить гардероб.',
      'Успейте воспользоваться предложением и выбрать своё идеальное зимнее настроение в Paul&Shark 🤍',
    ],
  },
  {
    id: id++,
    img1: news81,
    text: [
      'Специальные предложения в BOGNER✨',
      'В бутике действуют выгодные условия на актуальные коллекции:',
      '— 30% на коллекцию Man / Woman FW’25',
      '— 30% на коллекцию FIRE+ICE FW’25',
      'Функциональность, премиальные материалы и безупречный стиль — идеальный момент обновить гардероб!',
      'Ждём вас в BOGNER в ТРК «СИТИ ЦЕНТР» 🤍',
    ],
  },
  {
    id: id++,
    img1: news80,
    text: [
      'Время исключительных возможностей ✨',
      'В бутике TwinSet Milano действуют скидки до −90% на все коллекции.',
      'Итальянская элегантность, женственные силуэты и утончённые детали теперь доступны на особых условиях. Идеальный момент, чтобы обновить гардероб и позволить себе больше любимого стиля TwinSet.',
      'Не упустите шанс — ждём вас в ТРК «СИТИ ЦЕНТР» 🤍',
    ],
  },
  // {
  //   id: id++,
  //   img1: news79,
  //   text: [
  //     'Зима — лучшее время для особенных покупок ✨',
  //     'В бутике KIARA действует скидка −50% на шубы из австралийского мериноса — выбор для тех, кто ценит комфорт, стиль и качество.',
  //     'Шерсть мериноса невероятно мягкая и приятная к телу, не колется и дарит ощущение уюта с первого прикосновения. Она отлично сохраняет тепло, при этом позволяет коже дышать, обеспечивая идеальную терморегуляцию. Лёгкие, долговечные и элегантные — такие шубы станут безупречной инвестицией в ваш зимний гардероб.',
  //     'Откройте для себя тепло в премиальном исполнении в ТРК «СИТИ ЦЕНТР» 🤍',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news78,
  //   text: [
  //     'MAGIC WINTER SALE ✨',
  //     'До 30 января бутик FREYWILLE продолжает исполнять ваши мечты и дарит скидки до 50% на избранные коллекции.',
  //     'Это редкая возможность пополнить свою ювелирную коллекцию настоящими произведениями искусства — украшениями, вдохновлёнными шедеврами великих художников, мировой культурой и утончённой эстетикой бренда.',
  //     'Позвольте себе больше красоты этой зимой 🤍',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news77,
  //   text: [
  //     'Компания Chisto Blisto специализируется на профессиональной реставрации и ремонте кожаных изделий.',
  //     'Мы используем качественные материалы, современные технологии и аккуратный ручной труд.',
  //     'Наши мастера бережно восстанавливают обувь, сумки и аксессуары, возвращая им внешний вид и продлевая срок службы.',
  //     'Мы ценим доверие клиентов и стремимся к результату, который действительно радует.',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news76,
  //   text: [
  //     '26 декабря в 19:00 приглашаем вас на торжественное открытие Oysters 🦪',
  //     'Вас ожидают живая музыка, дегустация морских деликатесов, свежие устрицы, утончённая подача и безупречный вкус — всё, чтобы превратить вечер в настоящее гастрономическое событие.',
  //     'Откройте для себя новый уровень вкуса и эстетики 🤍',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news75,
  //   text: [
  //     'В преддверии новогодних праздников хотим обратить ваше внимание на график работы ТРК «СИТИ ЦЕНТР» 🤍',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news74,
  //   text: [
  //     'Художественная выставки «Снежная палитра» ❄️',
  //     '20 декабря в 18:00 приглашаем Вас на открытие выставки в кинотеатре «МОНИТОР Сити»!',
  //     'Зима — время особого волшебства, уюта и ожидания праздника. Искрящийся снег, морозный воздух и тихая красота зимних пейзажей испокон веков вдохновляли художников. Именно этому состоянию посвящена новая выставка.',
  //     'Картины предоставлены из частных коллекций Льва Давыдовича Песок и Андрея Александровича Гладченко.',
  //     'Арт-куратор проекта — Ольга Трапицына.',
  //     'Проведите зимний вечер в окружении искусства и вдохновения — ждём вас в ТРК «СИТИ ЦЕНТР» 🤍',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news73,
  //   text: [
  //     'Создайте праздничную атмосферу вместе с «Эстель Адони»',
  //     'До 31 декабря получите в подарок 5000 бонусов на покупку комплекта или 2 бюстгальтеров французского модного дома Simone Perele из новых или базовых линий!',
  //     'Гламурное, смелое и утонченное белье Simone Perele призвано подчеркнуть женскую красоту в  волшебные зимние праздники. Выразите свои чувства через волнующий образ!',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news72,
  //   text: [
  //     'Новый уровень гастрономии в ТРК «СИТИ ЦЕНТР» 🦪',
  //     'Рады сообщить, что сегодня состоялось открытие устричного ресторана Oysters! ',
  //     'Теперь атмосфера безупречного шопинга дополняется изысканными морскими деликатесами и эстетикой настоящего luxury-формата 🥂',
  //     'Свежие устрицы, утончённая подача, безупречный вкус и особое настроение — всё, чтобы превратить обычный визит в ТРК «СИТИ ЦЕНТР» в настоящее гастрономическое удовольствие.',
  //     'Приглашаем открыть для себя новый уровень гастрономии и позволить себе чуть больше роскоши в Oysters 🤍',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news71,
  //   text: [
  //     'Открытие нового бутика в ТРК «Сити Центр» 🤍',
  //     'Мы рады сообщить, что совсем скоро состоится открытие Re:premium — сети салонов электроники нового формата, где премиум не означает дорого.',
  //     'Apple, Samsung, Dyson, Sony, Xiaomi и многие другие бренды в наличии и под заказ.',
  //     'А также:',
  //     '— гарантия до 3 лет,',
  //     '— рассрочка 0-0-36,',
  //     '— trade-in.',
  //     'Покупайте премиум-технику без переплат в Re:premium ✨',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news70,
  //   img2: news70_1,
  //   img3: news70_2,
  //   text: [
  //     'Если вы искали идеальный повод заглянуть в MIU CITY — он уже здесь!',
  //     'Команда обновила меню и подготовила для вас сезонные новинки, которые невозможно пропустить 😍',
  //     'Рекомендуем попробовать:',
  //     '– Сэндвич с индейкой — сытно, свежо и очень вкусно.',
  //     '– Десерт «Красный бархат» с клубникой или',
  //     '– «Сникерс» — идеальное завершение любого дня.',
  //     '– И, конечно же, какао с пряной малиной — согревающий хит этой зимы.',
  //     'Приходите наслаждаться любимым и открывать новое — MIU CITY ждёт вас в ТРК «СИТИ ЦЕНТР» 🤍',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news69,
  //   text: [
  //     'Клиентский день MIRIAM QUEVEDO в бутике GIORGIO ✨',
  //     '9 декабря бутик GIORGIO приглашает вас на особое бьюти-событие — клиентский день Miriam Quevedo.',
  //     'Вас ждёт:',
  //     '• Профессиональная компьютерная диагностика кожи головы и волос',
  //     '• Индивидуальная консультация трихолога бренда',
  //     '• Личные рекомендации по уходу',
  //     '• Подарки при покупке продукции',
  //     '• И просто отличный повод заглянуть к нам в гости и посвятить время себе 🤍',
  //     ' ',
  //     'Будем рады видеть вас!',
  //     '📞 Запись: +7 928 845-89-64',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news68,
  //   img2: news68_2,
  //   img3: news68_3,
  //   text: [
  //     'Вы долго этого ждали — и мы рады сообщить! 🥳',
  //     'В ТРК «СИТИ ЦЕНТР» открылся офис продаж KINEXT.',
  //     'KINEXT CITY станет ультрасовременным пространством, включая в себя 15 фитнес-зон, разработанных с учетом последних мировых трендов, термальный комплекс и SPA-зону. ',
  //     'Заходите в офис продаж и станьте ближе к новой версии себя вместе с KINEXT CITY 🤍',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news67,
  //   text: [
  //     'НОВЫЙ ГОД — НОВЫЙ ТЫ: психологический интенсив 💫',
  //     '12 декабря в кинотеатре «МОНИТОР Сити» пройдёт уникальный психологический интенсив — практическая встреча для тех, кто хочет по-настоящему перезагрузиться и войти в 2026 год с ясностью, силой и рабочими инструментами для перемен.',
  //     'Спикеры форума:',
  //     'Марина Шастова — психолог-сексолог, арт-терапевт, эксперт «Первого канала».',
  //     'Елена Морозова — международно-сертифицированный медиатор, тренер, эксперт Минпросвещения России.',
  //     'Наталья Шевченко (Лебедева) — художница, чьи работы представлены в музеях и частных коллекциях по всему миру; основатель бренда «Натан».',
  //     ' ',
  //     'Это не лекция — это живой практикум, после которого вы получите:',
  //     '✓ понимание своих внутренних блоков',
  //     '✓ эмоциональную лёгкость',
  //     '✓ проект главной цели на 2026 год',
  //     '✓ инструменты самопомощи, которые работают ежедневно',
  //     ' ',
  //     '🎟 Билеты уже в продаже в кассе кинотеатра и на сайте kinomonitor.ru',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news66,
  //   text: [
  //     'Тик-так, тик-так…',
  //     'Осталось всего три дня до завершения грандиозной распродажи FREYWILLE в ТРК «СИТИ ЦЕНТР» ✨',
  //     'Момент, когда можно порадовать себя и близких утончёнными ювелирными произведениями искусства по действительно привлекательным ценам!',
  //     'До Нового года совсем немного времени, и сейчас идеальный шанс выбрать особенный подарок: украшения FREYWILLE со скидкой до 50% 🤍',
  //     'Не упустите возможность стать обладателем настоящих шедевров!',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news65,
  //   text: [
  //     'В MAX&Co начался сезон изысканных покупок ✨',
  //     'Только до 2 декабря в бутике действуют скидки до 30% — идеальный повод пополнить гардероб актуальными моделями и создать стильные образы.',
  //     'Премиальные материалы, безупречные силуэты и итальянская эстетика ждут вас в ТРК «СИТИ ЦЕНТР» 🤍',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news64,
  //   text: [
  //     "КУРАТОРИУМ: Открытый диалог для художников 🎨",
  //     "22 ноября в 16:00 в арт-пространстве кинотеатра «Монитор Сити de Luxe»состоится событие, созданное для тех, кто живёт искусством, работает в креативной сфере и стремится к развитию в профессиональном сообществе.",
  //     " ",
  //     "В программе встречи:",
  //     "• Открытый разговор об актуальных темах современного арт-рынка",
  //     "• Профессиональный нетворкинг и знакомство с коллегами",
  //     "• Неформальное общение в кругу единомышленников",
  //     " ",
  //     "Спикеры:",
  //     "• Ольга Трапицына — художник, член Союза художников России, арт-директор галереи «Особнякъ»",
  //     "• Диана Эгина — арт-менеджер, куратор выставок, владелица салона «Салон Княже», юрист",
  //     "• Анастасия Семенова — арт-директор галереи «Арт Небо»",
  //     " ",
  //     "Эксперты арт-среды создадут продуктивную атмосферу и поделятся профессиональными инсайтами.",
  //     "📞 Участие по предварительной записи: +7 911 918 12 91",
  //     "Не упустите шанс стать частью творческого комьюнити и вдохновиться новыми идеями в ТРК «СИТИ ЦЕНТР» 🤍",
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news63,
  //   text: [
  //     "GIORGIO x FAKOSHIMA — закрытая вечеринка",
  //     "Бутик GIORGIO приглашает вас 27 ноября в 18:00 на эксклюзивное событие, созданное для тех, кто ценит эстетку, стиль и атмосферу закрытых комьюнити-ивентов.",
  //     "Вас ждёт:",
  //     "• Коллекция оптики FAKOSHIMA x БЕСПРИНЦИПНЫЕ",
  //     "• Презентация нового аромата Secret Venue FAKOSHIMA",
  //     "• DJ CET — музыкальный сет вечера",
  //     "• Авторские special cocktails",
  //     " ",
  //     "Специальные гости — Константин Шиляев и Ярослав Симонов",
  //     "Просим соблюдать dress code, чтобы вечер получился таким же эстетичным, как и его идея 🤍",
  //     "Чтобы попасть в закрытый список гостей, заполните короткую анкету.",
  //     <a
  //       href="https://inv-you.ru/giorgio-city"
  //       target="_blank"
  //       rel="noreferrer"
  //       key={"1"}
  //       className="underline-news"
  //     >
  //       Анкета для посещения мероприятия
  //     </a>,
  //     "Количество мест ограничено 🥂",
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news62,
  //   text: [
  //     "15 ноября в прямом эфире состоялся финальный розыгрыш подарков от ТРК «СИТИ ЦЕНТР»",
  //     "Благодарим каждого участника за эмоции, внимание и невероятную вовлечённость ✨",
  //     "С радостью объявляем победителей:",
  //     "Купоны №514, 466, 460 — сертификаты на 10 000₽ от РОЛЬФ",
  //     "Купон №125 — сертификат на 20 000₽ от Cosmo Store",
  //     "Купон №53 — сертификат на 20 000₽ от D’EXTERIOR",
  //     "Купоны №530, 144 — сертификаты на 20 000₽ от FREY WILLE",
  //     "Купон №25 — VIP-карта от GMT",
  //     "Купон №325 — сертификат на 20 000₽ от Paul&Shark",
  //     "Купоны №371, 437 — сертификаты на 20 000₽ от Renaissance",
  //     "Купоны №433, 318, 518 — сертификаты на 20 000₽ от Richard MTM Man",
  //     "Купоны №230, 35 — сертификаты на 20 000₽ от Van Laack",
  //     "Купон №507 — сертификат на 20 000₽ от Zotty",
  //     "Купон №164 — сертификат на 20 000₽ от X.O",
  //     " ",
  //     "Главный приз — отдых в Pullman Sochi Centre",
  //     "Победители: купон №388 и №363",
  //     "Поздравляем всех счастливчиков и благодарим каждого участника за то, что были с нами!",
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news61,
  //   text: [
  //     "Всемирный день шопинга ✨",
  //     "Приглашаем стать частью этого праздника стиля в ТРК «СИТИ ЦЕНТР» 🤍",
  //     "Вас ждут уникальные предложения, лимитированные коллекции и атмосфера, в которой покупки превращаются в удовольствие.",
  //     "Это ваш день — день, когда стоит выбрать лучшее и позволить себе немного роскоши!",
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news60,
  //   text: [
  //     "ТРК «СИТИ ЦЕНТР» — 21 год 🥂",
  //     "Приглашаем вас на день рождения главного fashion-пространства города 😍",
  //     "15 ноября с 12:00 наш атриум наполнится живой музыкой, ароматом шампанского и улыбками гостей!",
  //     "Для вас — праздничный фуршет, фотозона, фотограф и угощения за любые покупки в ТРК «СИТИ ЦЕНТР».",
  //     "Уже 21 год мы вдохновляем, удивляем и создаём атмосферу, где шопинг становится искусством 🤍",
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news59,
  //   text: [
  //     "Изысканное предложение для ценителей стиля!",
  //     "В бутике GUESS действуют скидки до 30% на новую коллекцию.",
  //     "Создайте свой неповторимый образ в ТРК «СИТИ ЦЕНТР» 🤍 ",
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news58,
  //   text: [
  //     "ЯРКИЕ КРАСКИ С FREYWILLE 🍂",
  //     "Пусть эта осень будет наполнена сиянием! Только с 15 по 31 октября FREYWILLE дарит вам уникальную возможность приобрести желанные украшения со скидкой до 50% 🤍",
  //     "Успейте пополнить свою коллекцию настоящими ювелирными шедеврами, вдохновлёнными работами известных художников, искусством и культурой мира, с приятными скидками!",
  //     "📍2 этаж, ТРК «СИТИ ЦЕНТР»",
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news57,
  //   text: [
  //     "18 октября в прямом эфире состоялся первый розыгрыш призов от ТРК «СИТИ ЦЕНТР»",
  //     "Благодарим всех участников и с радостью объявляем победителей:",
  //     "Купон №182 — VIP-карта от GMT",
  //     "Купон №232 — полотенце и кепка от CONCEPT STORE",
  //     "Купон №6 — сумка от CONCEPT STORE W",
  //     "Купон №19 — сертификат на 20 000₽ FREY WILLE",
  //     "Купон №188 — шарф и шапка от MarcCain",
  //     "Купон №115, 179, 248 — сертификаты на 20 000₽ от Renaissance",
  //     "Купон 135, 323, 183 — сертификаты  на 20 000₽ от Richard MTM Man",
  //     "Купон №123 — сертификат на 20 000₽ от Van Laack",
  //     "Купон №213 — сертификат на 20 000₽ от Zotty",
  //     "Купон №105 — очки Balenciaga от ОПТрИКА",
  //     "Купон №197 — сертификат на 20 000₽ от Estelle Adony",
  //     "Купон №83 и 212 — отдых в Pullman Sochi Centre",
  //     "Следующий розыгрыш состоится 15 ноября — у вас ещё есть шанс принять участие и выиграть суперприз 🤍",
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news56,
  //   text: [
  //     "Вечера высокого искусства продолжаются ✨",
  //     "23 октября приглашаем Вас на новую премьеру арт-проекта «Волшебные вечера» — оперу «Кармен» (16+).",
  //     "🎭 Показ приурочен к 100-летию со дня рождения Франко Дзеффирелли, легендарного режиссёра фильмов «Ромео и Джульетта» и «Травиата». Зрителей ждёт постановка, созданная с участием звёзд мировой оперной сцены и танцоров фламенко из Испании — страсть, ритм и сила испанской души в одном произведении. Опера звучит на французском языке с русскими субтитрами.",
  //     "Позвольте себе вечер, наполненный музыкой, эмоциями и атмосферой подлинного искусства.",
  //     "🎟 Билеты доступны на сайте kinomonitor.ru",
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news55,
  //   text: [
  //     "Комфортный сон — залог здоровья и отличного настроения.",
  //     "Представляем уникальную новинку из Швейцарии – инновационные пижамы CALIDA DEEPSLEEPWEAR, на покупку которых с 9 по 26 октября в выделенных салонах нашей сети вы получаете 5000 бонусов в подарок.",
  //     "С такой пижамой не страшны ни холода, ни жаркое отопление, ни зябкое межсезонье. В ассортименте три линии: согревающая – из микромодала и шерсти, балансирующая – из уникальной смеси природных волокон, и охлаждающая – из 100% волокон TENCEL™.",
  //     "Не пропустите выгодное предложение, подарите себе и близким здоровый и качественный сон!",
  //     "Акция также действует на сайте estelle.ru, где при заказе товаров из линии DEEPSLEEPWEAR на сумму свыше 25000 рублей вы получите скидку в размере 5000 рублей.",
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news52,
  //   text: [
  //     "VIPAVENUE – Ваш модный проводник в мир премиальных брендов и высококлассного сервиса. ",
  //     "Интернет-бутик является частью фэшн-ритейлера AVENUEVIP, в котором представлены более 750 ведущих мировых и российских брендов. ",
  //     "Уже более четырех лет мы работаем, как маркетплейс с самыми проверенными и надежными партнерами на российском рынке, для того, чтобы радовать Вас новым ассортиментом.",
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news51,
  //   img2: news53,
  //   img3: news54,
  //   text: [
  //     "Свой праздник мы делим с вами 🥂",
  //     "Ко Дню рождения ТРК «СИТИ ЦЕНТР» мы запускаем розыгрыш, который сделает вашу осень особенной.",
  //     "Главный приз — 4 билета на проживание в отеле Pullman Sochi Centre — уже ждёт своих обладателей.",
  //     "Как участвовать:",
  //     "— Совершайте покупки в ТРК «СИТИ ЦЕНТР» от 50 000 рублей;",
  //     "— Регистрируйте чеки;",
  //     "— Получайте номер участника;",
  //     "— Следите за онлайн-розыгрышами 18.10 и 15.11.",
  //     "Победителей пригласим на торжественное вручение подарков. Отмечайте с нами — и пусть именно вам улыбнётся удача",
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news49,
  //   text: [
  //     "Приглашаем вас погрузиться в мир искусства и вдохновения 🤍",
  //     "14 сентября в 15:00 пройдет открытие персональной выставки Ахсара Есенова — Заслуженного художника Северной Осетии-Алании.",
  //     "Экспозиция «Простые сюжеты» - это 30 живописных полотен, где в деталях раскрыта поэзия повседневности.",
  //     "Вас ждёт:",
  //     "- лёгкий фуршет 🥂",
  //     "- живое звучание саксофона 🎷",
  //     "- непринужденное общение с художником",
  //   ],
  // },
];

export { arrayNews };

//   // {
//   //   id: 4,
//   //   img: news5,
//   //   imgm: news5,
//   //   title: [
//   //     'Торопитесь на финальную распродажу в салонах мужского белья Х.О.!',
//   //   ],
//   //   text: [
//   //     {
//   //       id: 1,
//   //       t1: 'Последний шанс успеть!',
//   //     },
//   //     {
//   //       id: 2,
//   //       t1: [
//   //         'Всего 5 дней, с 24 по 28 августа, скидки до 60%! Грандиозный SALE на белье, пляжную и домашнюю одежду от ваших любимых Bikkembergs, Emporio Armani, Moschino, Hugo Boss, Dolce&Gabbana, Guess, Karl Lagerfeld и других модных брендов.',
//   //       ],
//   //     },
//   //     {
//   //       id: 3,
//   //       t1: ['Позвольте себе самое лучшее качество по доступной цене!'],
//   //     },
//   //   ],
//   // },
// ];
