let id = 1;
import news65 from '@/public/news/65.jpg';
import news66 from '@/public/news/66.jpg';
import news67 from '@/public/news/67.jpg';
import news68 from '@/public/news/68.jpg';
import news68_2 from '@/public/news/68_2.jpg';
import news68_3 from '@/public/news/68_3.jpg';
import news69 from '@/public/news/69.jpg';
import news70_1 from '@/public/news/70-1.jpg';
import news70_2 from '@/public/news/70-2.jpg';
import news70 from '@/public/news/70.jpg';
import news71 from '@/public/news/71.jpg';
import news72 from '@/public/news/72.jpg';
import news73 from '@/public/news/73.jpg';
import news74 from '@/public/news/74.jpg';
import news75 from '@/public/news/75.jpg';
import news76 from '@/public/news/76.jpg';
import news77 from '@/public/services/ChistoBlisto/logo.jpg';
import news78 from '@/public/news/78.jpg';
import news79 from '@/public/news/79.jpg';
import news80 from '@/public/news/80.jpg';
import news81 from '@/public/news/81.jpg';
import news82 from '@/public/news/82.jpg';

const arrayNews = [
  {
    id: id++,
    img1: news82,
    text: [
      'Стильная зима с Paul&Shark ✨',
      'В бутике Paul&Shark в ТРК «СИТИ ЦЕНТР» действуют скидки до −40% на выделенный ассортимент зимней коллекции.',
      'Безупречное качество, функциональность и узнаваемый итальянский стиль — идеальный выбор для холодного сезона и выгодный повод обновить гардероб.',
      'Успейте воспользоваться предложением и выбрать своё идеальное зимнее настроение в Paul&Shark 🤍',
    ],
    link: '/news#new1',
  },
  {
    id: id++,
    img1: news81,
    text: [
      'Специальные предложения в BOGNER✨',
      'В бутике действуют выгодные условия на актуальные коллекции:',
      '— 30% на коллекцию Man / Woman FW’25',
      '— 30% на коллекцию FIRE+ICE FW’25',
      'Функциональность, премиальные материалы и безупречный стиль — идеальный момент обновить гардероб!',
      'Ждём вас в BOGNER в ТРК «СИТИ ЦЕНТР» 🤍',
    ],
    link: '/news#new2',
  },
  {
    id: id++,
    img1: news80,
    text: [
      'Время исключительных возможностей ✨',
      'В бутике TwinSet Milano действуют скидки до −90% на все коллекции.',
      'Итальянская элегантность, женственные силуэты и утончённые детали теперь доступны на особых условиях. Идеальный момент, чтобы обновить гардероб и позволить себе больше любимого стиля TwinSet.',
      'Не упустите шанс — ждём вас в ТРК «СИТИ ЦЕНТР» 🤍',
    ],
    link: '/news#new3',
  },
  {
    id: id++,
    img1: news79,
    text: [
      'Зима — лучшее время для особенных покупок ✨',
      'В бутике KIARA действует скидка −50% на шубы из австралийского мериноса — выбор для тех, кто ценит комфорт, стиль и качество.',
      'Шерсть мериноса невероятно мягкая и приятная к телу, не колется и дарит ощущение уюта с первого прикосновения. Она отлично сохраняет тепло, при этом позволяет коже дышать, обеспечивая идеальную терморегуляцию. Лёгкие, долговечные и элегантные — такие шубы станут безупречной инвестицией в ваш зимний гардероб.',
      'Откройте для себя тепло в премиальном исполнении в ТРК «СИТИ ЦЕНТР» 🤍',
    ],
    link: '/news#new4',
  },
  {
    id: id++,
    img1: news78,
    text: [
      'MAGIC WINTER SALE ✨',
      'До 30 января бутик FREYWILLE продолжает исполнять ваши мечты и дарит скидки до 50% на избранные коллекции.',
      'Это редкая возможность пополнить свою ювелирную коллекцию настоящими произведениями искусства — украшениями, вдохновлёнными шедеврами великих художников, мировой культурой и утончённой эстетикой бренда.',
      'Позвольте себе больше красоты этой зимой 🤍',
    ],
  },
  {
    id: id++,
    img1: news77,
    text: [
      'Компания Chisto Blisto специализируется на профессиональной реставрации и ремонте кожаных изделий.',
      'Мы используем качественные материалы, современные технологии и аккуратный ручной труд.',
      'Наши мастера бережно восстанавливают обувь, сумки и аксессуары, возвращая им внешний вид и продлевая срок службы.',
      'Мы ценим доверие клиентов и стремимся к результату, который действительно радует.',
    ],
  },
  {
    id: id++,
    img1: news76,
    text: [
      '26 декабря в 19:00 приглашаем вас на торжественное открытие Oysters 🦪',
      'Вас ожидают живая музыка, дегустация морских деликатесов, свежие устрицы, утончённая подача и безупречный вкус — всё, чтобы превратить вечер в настоящее гастрономическое событие.',
      'Откройте для себя новый уровень вкуса и эстетики 🤍',
    ],
  },
  {
    id: id++,
    img1: news75,
    text: [
      'В преддверии новогодних праздников хотим обратить ваше внимание на график работы ТРК «СИТИ ЦЕНТР» 🤍',
    ],
  },
  {
    id: id++,
    img1: news74,
    text: [
      'Художественная выставки «Снежная палитра» ❄️',
      '20 декабря в 18:00 приглашаем Вас на открытие выставки в кинотеатре «МОНИТОР Сити»!',
      'Зима — время особого волшебства, уюта и ожидания праздника. Искрящийся снег, морозный воздух и тихая красота зимних пейзажей испокон веков вдохновляли художников. Именно этому состоянию посвящена новая выставка.',
      'Картины предоставлены из частных коллекций Льва Давыдовича Песок и Андрея Александровича Гладченко.',
      'Арт-куратор проекта — Ольга Трапицына.',
      'Проведите зимний вечер в окружении искусства и вдохновения — ждём вас в ТРК «СИТИ ЦЕНТР» 🤍',
    ],
  },
  {
    id: id++,
    img1: news73,
    text: [
      'Создайте праздничную атмосферу вместе с «Эстель Адони»',
      'До 31 декабря получите в подарок 5000 бонусов на покупку комплекта или 2 бюстгальтеров французского модного дома Simone Perele из новых или базовых линий!',
      'Гламурное, смелое и утонченное белье Simone Perele призвано подчеркнуть женскую красоту в  волшебные зимние праздники. Выразите свои чувства через волнующий образ!',
    ],
  },
  {
    id: id++,
    img1: news72,
    text: [
      'Новый уровень гастрономии в ТРК «СИТИ ЦЕНТР» 🦪',
      'Рады сообщить, что сегодня состоялось открытие устричного ресторана Oysters! ',
      'Теперь атмосфера безупречного шопинга дополняется изысканными морскими деликатесами и эстетикой настоящего luxury-формата 🥂',
      'Свежие устрицы, утончённая подача, безупречный вкус и особое настроение — всё, чтобы превратить обычный визит в ТРК «СИТИ ЦЕНТР» в настоящее гастрономическое удовольствие.',
      'Приглашаем открыть для себя новый уровень гастрономии и позволить себе чуть больше роскоши в Oysters 🤍',
    ],
  },
  {
    id: id++,
    img1: news71,
    text: [
      'Открытие нового бутика в ТРК «Сити Центр» 🤍',
      'Мы рады сообщить, что совсем скоро состоится открытие Re:premium — сети салонов электроники нового формата, где премиум не означает дорого.',
      'Apple, Samsung, Dyson, Sony, Xiaomi и многие другие бренды в наличии и под заказ.',
      'А также:',
      '— гарантия до 3 лет,',
      '— рассрочка 0-0-36,',
      '— trade-in.',
      'Покупайте премиум-технику без переплат в Re:premium ✨',
    ],
  },
  {
    id: id++,
    img1: news70,
    img2: news70_1,
    img3: news70_2,
    text: [
      'Если вы искали идеальный повод заглянуть в MIU CITY — он уже здесь!',
      'Команда обновила меню и подготовила для вас сезонные новинки, которые невозможно пропустить 😍',
      'Рекомендуем попробовать:',
      '– Сэндвич с индейкой — сытно, свежо и очень вкусно.',
      '– Десерт «Красный бархат» с клубникой или',
      '– «Сникерс» — идеальное завершение любого дня.',
      '– И, конечно же, какао с пряной малиной — согревающий хит этой зимы.',
      'Приходите наслаждаться любимым и открывать новое — MIU CITY ждёт вас в ТРК «СИТИ ЦЕНТР» 🤍',
    ],
  },
  {
    id: id++,
    img1: news69,
    text: [
      'Клиентский день MIRIAM QUEVEDO в бутике GIORGIO ✨',
      '9 декабря бутик GIORGIO приглашает вас на особое бьюти-событие — клиентский день Miriam Quevedo.',
      'Вас ждёт:',
      '• Профессиональная компьютерная диагностика кожи головы и волос',
      '• Индивидуальная консультация трихолога бренда',
      '• Личные рекомендации по уходу',
      '• Подарки при покупке продукции',
      '• И просто отличный повод заглянуть к нам в гости и посвятить время себе 🤍',
      ' ',
      'Будем рады видеть вас!',
      '📞 Запись: +7 928 845-89-64',
    ],
  },
  {
    id: id++,
    img1: news68,
    img2: news68_2,
    img3: news68_3,
    text: [
      'Вы долго этого ждали — и мы рады сообщить! 🥳',
      'В ТРК «СИТИ ЦЕНТР» открылся офис продаж KINEXT.',
      'KINEXT CITY станет ультрасовременным пространством, включая в себя 15 фитнес-зон, разработанных с учетом последних мировых трендов, термальный комплекс и SPA-зону. ',
      'Заходите в офис продаж и станьте ближе к новой версии себя вместе с KINEXT CITY 🤍',
    ],
  },
  {
    id: id++,
    img1: news67,
    text: [
      'НОВЫЙ ГОД — НОВЫЙ ТЫ: психологический интенсив 💫',
      '12 декабря в кинотеатре «МОНИТОР Сити» пройдёт уникальный психологический интенсив — практическая встреча для тех, кто хочет по-настоящему перезагрузиться и войти в 2026 год с ясностью, силой и рабочими инструментами для перемен.',
      'Спикеры форума:',
      'Марина Шастова — психолог-сексолог, арт-терапевт, эксперт «Первого канала».',
      'Елена Морозова — международно-сертифицированный медиатор, тренер, эксперт Минпросвещения России.',
      'Наталья Шевченко (Лебедева) — художница, чьи работы представлены в музеях и частных коллекциях по всему миру; основатель бренда «Натан».',
      ' ',
      'Это не лекция — это живой практикум, после которого вы получите:',
      '✓ понимание своих внутренних блоков',
      '✓ эмоциональную лёгкость',
      '✓ проект главной цели на 2026 год',
      '✓ инструменты самопомощи, которые работают ежедневно',
      ' ',
      '🎟 Билеты уже в продаже в кассе кинотеатра и на сайте kinomonitor.ru',
    ],
  },
  {
    id: id++,
    img1: news66,
    text: [
      'Тик-так, тик-так…',
      'Осталось всего три дня до завершения грандиозной распродажи FREYWILLE в ТРК «СИТИ ЦЕНТР» ✨',
      'Момент, когда можно порадовать себя и близких утончёнными ювелирными произведениями искусства по действительно привлекательным ценам!',
      'До Нового года совсем немного времени, и сейчас идеальный шанс выбрать особенный подарок: украшения FREYWILLE со скидкой до 50% 🤍',
      'Не упустите возможность стать обладателем настоящих шедевров!',
    ],
  },
  {
    id: id++,
    img1: news65,
    text: [
      'В MAX&Co начался сезон изысканных покупок ✨',
      'Только до 2 декабря в бутике действуют скидки до 30% — идеальный повод пополнить гардероб актуальными моделями и создать стильные образы.',
      'Премиальные материалы, безупречные силуэты и итальянская эстетика ждут вас в ТРК «СИТИ ЦЕНТР» 🤍',
    ],
  },
  // {
  //   id: id++,
  //   img1: news64,
  //   text: [
  //     "КУРАТОРИУМ: Открытый диалог для художников 🎨",
  //     "22 ноября в 16:00 в арт-пространстве кинотеатра «Монитор Сити de Luxe»состоится событие, созданное для тех, кто живёт искусством, работает в креативной сфере и стремится к развитию в профессиональном сообществе.",
  //     " ",
  //     "В программе встречи:",
  //     "• Открытый разговор об актуальных темах современного арт-рынка",
  //     "• Профессиональный нетворкинг и знакомство с коллегами",
  //     "• Неформальное общение в кругу единомышленников",
  //     " ",
  //     "Спикеры:",
  //     "• Ольга Трапицына — художник, член Союза художников России, арт-директор галереи «Особнякъ»",
  //     "• Диана Эгина — арт-менеджер, куратор выставок, владелица салона «Салон Княже», юрист",
  //     "• Анастасия Семенова — арт-директор галереи «Арт Небо»",
  //     " ",
  //     "Эксперты арт-среды создадут продуктивную атмосферу и поделятся профессиональными инсайтами.",
  //     "📞 Участие по предварительной записи: +7 911 918 12 91",
  //     "Не упустите шанс стать частью творческого комьюнити и вдохновиться новыми идеями в ТРК «СИТИ ЦЕНТР» 🤍",
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news63,
  //   text: [
  //     "GIORGIO x FAKOSHIMA — закрытая вечеринка",
  //     "Бутик GIORGIO приглашает вас 27 ноября в 18:00 на эксклюзивное событие, созданное для тех, кто ценит эстетку, стиль и атмосферу закрытых комьюнити-ивентов.",
  //     "Вас ждёт:",
  //     "• Коллекция оптики FAKOSHIMA x БЕСПРИНЦИПНЫЕ",
  //     "• Презентация нового аромата Secret Venue FAKOSHIMA",
  //     "• DJ CET — музыкальный сет вечера",
  //     "• Авторские special cocktails",
  //     " ",
  //     "Специальные гости — Константин Шиляев и Ярослав Симонов",
  //     "Просим соблюдать dress code, чтобы вечер получился таким же эстетичным, как и его идея 🤍",
  //     "Чтобы попасть в закрытый список гостей, заполните короткую анкету.",
  //     <a
  //       href="https://inv-you.ru/giorgio-city"
  //       target="_blank"
  //       rel="noreferrer"
  //       key={"1"}
  //       className="underline-news"
  //     >
  //       Анкета для посещения мероприятия
  //     </a>,
  //     "Количество мест ограничено 🥂",
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news62,
  //   text: [
  //     "15 ноября в прямом эфире состоялся финальный розыгрыш подарков от ТРК «СИТИ ЦЕНТР»",
  //     "Благодарим каждого участника за эмоции, внимание и невероятную вовлечённость ✨",
  //     "С радостью объявляем победителей:",
  //     "Купоны №514, 466, 460 — сертификаты на 10 000₽ от РОЛЬФ",
  //     "Купон №125 — сертификат на 20 000₽ от Cosmo Store",
  //     "Купон №53 — сертификат на 20 000₽ от D’EXTERIOR",
  //     "Купоны №530, 144 — сертификаты на 20 000₽ от FREY WILLE",
  //     "Купон №25 — VIP-карта от GMT",
  //     "Купон №325 — сертификат на 20 000₽ от Paul&Shark",
  //     "Купоны №371, 437 — сертификаты на 20 000₽ от Renaissance",
  //     "Купоны №433, 318, 518 — сертификаты на 20 000₽ от Richard MTM Man",
  //     "Купоны №230, 35 — сертификаты на 20 000₽ от Van Laack",
  //     "Купон №507 — сертификат на 20 000₽ от Zotty",
  //     "Купон №164 — сертификат на 20 000₽ от X.O",
  //     " ",
  //     "Главный приз — отдых в Pullman Sochi Centre",
  //     "Победители: купон №388 и №363",
  //     "Поздравляем всех счастливчиков и благодарим каждого участника за то, что были с нами!",
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news61,
  //   text: [
  //     "Всемирный день шопинга ✨",
  //     "Приглашаем стать частью этого праздника стиля в ТРК «СИТИ ЦЕНТР» 🤍",
  //     "Вас ждут уникальные предложения, лимитированные коллекции и атмосфера, в которой покупки превращаются в удовольствие.",
  //     "Это ваш день — день, когда стоит выбрать лучшее и позволить себе немного роскоши!",
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news60,
  //   text: [
  //     "ТРК «СИТИ ЦЕНТР» — 21 год 🥂",
  //     "Приглашаем вас на день рождения главного fashion-пространства города 😍",
  //     "15 ноября с 12:00 наш атриум наполнится живой музыкой, ароматом шампанского и улыбками гостей!",
  //     "Для вас — праздничный фуршет, фотозона, фотограф и угощения за любые покупки в ТРК «СИТИ ЦЕНТР».",
  //     "Уже 21 год мы вдохновляем, удивляем и создаём атмосферу, где шопинг становится искусством 🤍",
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news59,
  //   text: [
  //     "Изысканное предложение для ценителей стиля!",
  //     "В бутике GUESS действуют скидки до 30% на новую коллекцию.",
  //     "Создайте свой неповторимый образ в ТРК «СИТИ ЦЕНТР» 🤍 ",
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news58,
  //   text: [
  //     "ЯРКИЕ КРАСКИ С FREYWILLE 🍂",
  //     "Пусть эта осень будет наполнена сиянием! Только с 15 по 31 октября FREYWILLE дарит вам уникальную возможность приобрести желанные украшения со скидкой до 50% 🤍",
  //     "Успейте пополнить свою коллекцию настоящими ювелирными шедеврами, вдохновлёнными работами известных художников, искусством и культурой мира, с приятными скидками!",
  //     "📍2 этаж, ТРК «СИТИ ЦЕНТР»",
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news57,
  //   text: [
  //     "18 октября в прямом эфире состоялся первый розыгрыш призов от ТРК «СИТИ ЦЕНТР»",
  //     "Благодарим всех участников и с радостью объявляем победителей:",
  //     "Купон №182 — VIP-карта от GMT",
  //     "Купон №232 — полотенце и кепка от CONCEPT STORE",
  //     "Купон №6 — сумка от CONCEPT STORE W",
  //     "Купон №19 — сертификат на 20 000₽ FREY WILLE",
  //     "Купон №188 — шарф и шапка от MarcCain",
  //     "Купон №115, 179, 248 — сертификаты на 20 000₽ от Renaissance",
  //     "Купон 135, 323, 183 — сертификаты  на 20 000₽ от Richard MTM Man",
  //     "Купон №123 — сертификат на 20 000₽ от Van Laack",
  //     "Купон №213 — сертификат на 20 000₽ от Zotty",
  //     "Купон №105 — очки Balenciaga от ОПТрИКА",
  //     "Купон №197 — сертификат на 20 000₽ от Estelle Adony",
  //     "Купон №83 и 212 — отдых в Pullman Sochi Centre",
  //     "Следующий розыгрыш состоится 15 ноября — у вас ещё есть шанс принять участие и выиграть суперприз 🤍",
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news56,
  //   text: [
  //     "Вечера высокого искусства продолжаются ✨",
  //     "23 октября приглашаем Вас на новую премьеру арт-проекта «Волшебные вечера» — оперу «Кармен» (16+).",
  //     "🎭 Показ приурочен к 100-летию со дня рождения Франко Дзеффирелли, легендарного режиссёра фильмов «Ромео и Джульетта» и «Травиата». Зрителей ждёт постановка, созданная с участием звёзд мировой оперной сцены и танцоров фламенко из Испании — страсть, ритм и сила испанской души в одном произведении. Опера звучит на французском языке с русскими субтитрами.",
  //     "Позвольте себе вечер, наполненный музыкой, эмоциями и атмосферой подлинного искусства.",
  //     "🎟 Билеты доступны на сайте kinomonitor.ru",
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news55,
  //   text: [
  //     "Комфортный сон — залог здоровья и отличного настроения.",
  //     "Представляем уникальную новинку из Швейцарии – инновационные пижамы CALIDA DEEPSLEEPWEAR, на покупку которых с 9 по 26 октября в выделенных салонах нашей сети вы получаете 5000 бонусов в подарок.",
  //     "С такой пижамой не страшны ни холода, ни жаркое отопление, ни зябкое межсезонье. В ассортименте три линии: согревающая – из микромодала и шерсти, балансирующая – из уникальной смеси природных волокон, и охлаждающая – из 100% волокон TENCEL™.",
  //     "Не пропустите выгодное предложение, подарите себе и близким здоровый и качественный сон!",
  //     "Акция также действует на сайте estelle.ru, где при заказе товаров из линии DEEPSLEEPWEAR на сумму свыше 25000 рублей вы получите скидку в размере 5000 рублей.",
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news52,
  //   text: [
  //     "VIPAVENUE – Ваш модный проводник в мир премиальных брендов и высококлассного сервиса. ",
  //     "Интернет-бутик является частью фэшн-ритейлера AVENUEVIP, в котором представлены более 750 ведущих мировых и российских брендов. ",
  //     "Уже более четырех лет мы работаем, как маркетплейс с самыми проверенными и надежными партнерами на российском рынке, для того, чтобы радовать Вас новым ассортиментом.",
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news51,
  //   img2: news53,
  //   img3: news54,
  //   text: [
  //     "Свой праздник мы делим с вами 🥂",
  //     "Ко Дню рождения ТРК «СИТИ ЦЕНТР» мы запускаем розыгрыш, который сделает вашу осень особенной.",
  //     "Главный приз — 4 билета на проживание в отеле Pullman Sochi Centre — уже ждёт своих обладателей.",
  //     "Как участвовать:",
  //     "— Совершайте покупки в ТРК «СИТИ ЦЕНТР» от 50 000 рублей;",
  //     "— Регистрируйте чеки;",
  //     "— Получайте номер участника;",
  //     "— Следите за онлайн-розыгрышами 18.10 и 15.11.",
  //     "Победителей пригласим на торжественное вручение подарков. Отмечайте с нами — и пусть именно вам улыбнётся удача",
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news49,
  //   text: [
  //     "Приглашаем вас погрузиться в мир искусства и вдохновения 🤍",
  //     "14 сентября в 15:00 пройдет открытие персональной выставки Ахсара Есенова — Заслуженного художника Северной Осетии-Алании.",
  //     "Экспозиция «Простые сюжеты» - это 30 живописных полотен, где в деталях раскрыта поэзия повседневности.",
  //     "Вас ждёт:",
  //     "- лёгкий фуршет 🥂",
  //     "- живое звучание саксофона 🎷",
  //     "- непринужденное общение с художником",
  //   ],
  // },
];

export { arrayNews };

//   // {
//   //   id: 4,
//   //   img: news5,
//   //   imgm: news5,
//   //   title: [
//   //     'Торопитесь на финальную распродажу в салонах мужского белья Х.О.!',
//   //   ],
//   //   text: [
//   //     {
//   //       id: 1,
//   //       t1: 'Последний шанс успеть!',
//   //     },
//   //     {
//   //       id: 2,
//   //       t1: [
//   //         'Всего 5 дней, с 24 по 28 августа, скидки до 60%! Грандиозный SALE на белье, пляжную и домашнюю одежду от ваших любимых Bikkembergs, Emporio Armani, Moschino, Hugo Boss, Dolce&Gabbana, Guess, Karl Lagerfeld и других модных брендов.',
//   //       ],
//   //     },
//   //     {
//   //       id: 3,
//   //       t1: ['Позвольте себе самое лучшее качество по доступной цене!'],
//   //     },
//   //   ],
//   // },
// ];
