let id = 1;
import news27 from '@/public/news/27.jpg';
import news28 from '@/public/news/28.jpg';
import news29 from '@/public/news/29.jpg';
import news30 from '@/public/news/30.jpg';
import news31 from '@/public/news/31.jpg';
import news32 from '@/public/news/32.jpg';
import news33 from '@/public/news/33.jpg';
import news34 from '@/public/news/34.jpg';
import news35 from '@/public/news/35.jpg';
import news36 from '@/public/news/36.jpg';

const arrayNews = [
  {
    id: id++,
    img1: news36,
    text: [
      'Самая летняя АКЦИЯ от ELENA MIRÒ!',
      'До 8 июня при покупке двух и более изделий, одно из которых платье - СКИДКА 30% на платье!',
      'Идеальная возможность обновить гардероб, ведь в актуальной коллекции ELENA MIRÒ представлено множество различных моделей платьев на любой вкус: яркие и спокойных расцветок, изо льна, из хлопка, из вискозы.',
      'Будьте неотразимы с ELENA MIRÒ 💛',
    ],
  },
  {
    id: id++,
    img1: news35,
    text: [
      'НОВАЯ КОЛЛЕКЦИЯ ВЕСНА/ЛЕТО В БУТИКЕ «KIARA»',
      'Итальянские ткани.',
      'Авторские принты.',
      'Лимитированные коллекции.',
      'Открываем для Вас новую услугу: доставка с примеркой на дом.',
      'Подбираем образы с учётом ваших пожеланий (фото, видеообзор), а наш консультант привезёт выбранные вещи прямо к вам: вы примеряете образы в спокойном режиме, сочетаете их с одеждой из своего гардероба и выбираете то, что действительно нравится.',
      'Мы ценим ваше время и комфорт, поэтому делаем всё, чтобы шопинг с бутиком «KIARA» был удобным и приятным!',
      'Заявки осуществляются по номеру: +7 (918) 085-35-63',
      'Также ждём вас в гости в ТРК «Сити Центр», 2 этаж',
    ],
  },
  {
    id: id++,
    img1: news34,
    text: [
      'Приближаем лето вместе с FREYWILLE!',
      'Коллекции «Подсолнухи» Ван Гога и «Таити» Поля Гогена — два ювелирных шедевра, наполненных солнцем, теплом и эмоциями — теперь в статусе SUNSET со скидкой -30%.',
      'Погрузитесь в мир живописи, воплощённой в эмали и золоте, и сделайте этот сезон по-настоящему ярким.',
    ],
  },
  {
    id: id++,
    img1: news33,
    text: [
      'На территории ТРК «СИТИ ЦЕНТР» запущена новая система оплаты парковки по QR-кодам. Теперь посетители могут быстро и удобно оплатить парковочное время с помощью смартфона, просто отсканировав специальный QR-код на парковке. Это позволит значительно сократить время на оплату и избежать необходимости искать наличные или использовать банковские карты.',
      '«СИТИ ЦЕНТР» - место комфортного шопинга',
    ],
  },
  {
    id: id++,
    img1: news32,
    text: [
      'Дорогие друзья,',
      'В честь яркого начала мая мы приготовили для вас особый знак внимания — возможность получить 100% кэшбек на карту лояльности.',
      'С 1 по 11 мая за каждую покупку мы вернём полную сумму в виде бонусов. Эти средства вы сможете использовать до 1 августа — для вас откроются новые возможности для выгодных приобретений.',
      'Это не просто акция, а наша благодарность за ваше доверие и безупречный вкус. Пусть май радует вас приятными сюрпризами!',
      'С искренним уважением, ELENA MIRÒ',
    ],
  },
  {
    id: id++,
    img1: news31,
    text: [
      'СКОРО',
      'Открытие премиального фитнес-клуба KINEXT',
      '- Персональные тренировки',
      '- SPA',
      '- ТОП-тренеры',
      '- Технологичные залы ',
      '- Recovery-зона с массажем и сауной',
      '- Nutrition-сопровождение',
      'Забронируйте доступ → kinext.ru ',
    ],
  },
  {
    id: id++,
    img1: news30,
    text: [
      'ИМПРЕССИЯ 5.0 — ВОЗРОЖДЕНИЕ И РАСЦВЕТ',
      'Вы ждали этого… Гастрономическое иммерсионное шоу возвращается, чтобы разорвать границы реальности! Четыре уровня восприятия, где ужин становится путешествием: стены чувствуют ваши прикосновения, свет и музыка дышат в ритме ваших эмоций, а каждое блюдо — живой перформанс, где вкус сливается с театром в движение танцевального па.',
      'NEW программа-погружение:',
      '⚪ Welcome-drink и таинственный цифровой церемониймейстер',
      '⚪ Ужин с закрытыми глазами',
      '⚪ Танцевальные перформансы среди световых волн',
      '⚪ Цветущие десерты и flower - интерактив',
      '⚪ Театральные постановки',
      '⚪ Световое и музыкальное шоу',
      '⚪ Подарок каждому участнику шоу',
      'Вы не зритель — вы часть истории, где ароматы, звуки и жесты творят новую реальность.',
      '📍 ТРК “СИТИ ЦЕНТР”, ул. Индустриальная 2',
      '🎟 Билеты в ваш новый чувственный опыт: impression-show.ru',
      '18+',
      'P.S. Готовы оставить след в памяти?',
    ],
  },
  {
    id: id++,
    img1: news28,
    text: [
      'Важная новость для владельцев электромобилей!',
      'На территории ТРК «СИТИ ЦЕНТР» открылась новая зарядная станция для электромобилей PUNKTE 😍',
      'Теперь вы можете удобно и быстро зарядить свой электромобиль во время шопинга или встреч с друзьями! Станция оснащена современным оборудованием и доступна для всех электромобилей. Это отличный шаг к более чистой и экологичной городской среде!',
    ],
  },
  {
    id: id++,
    img1: news29,
    text: [
      '23 марта в арт-пространстве «Сити-холл» в Краснодаре состоится открытие выставки современного искусства «ARTмосфера». Посетители увидят картины шести кубанских художников - Георгия Мотовилова, Ольги Трапицыной, Анны Володько, Евгения Хромова, Екатерины Дубровиной, Василия Карпенко. Вход свободный.',
      'Ограничение по возрасту: 0+',
      'Ждём вас на космическом вернисаже 23 марта в 19.00',
      'В программе: открытие выставки, атмосфера вселенной искусства, встреча с художниками и приглашёнными гостями, погружение в COSMOS, welcome drink, фотограф',
      'КОСМОС… Задавались ли вы вопросом, что же такое космос? Небо, усыпанное бесконечным количеством звёзд, галактик, созвездий... Как же приятно вглядываться в него глубокой ночью, когда наша маленькая голубая планета отворачивается от солнца, совершая свой ежедневный танец вокруг своей оси... Если смотреть глубже, то можно обнаружить как меняется небо и даже почувствовать его настроение, осознав, что в этот момент ты разговариваешь со Вселенной. Шесть художников - Георгий Мотовилов, Ольга Трапицына, Анна Володько, Евгений Хромов, Екатерина Дубровина, Василий Карпенко объединились, чтобы высказаться на эту космическую тему...',
      'Выставка будет работать до 23 мая в арт-пространстве «Сити-холл» (территория кинотеатра «МОНИТОР Сити de Luxe») по адресу: Краснодар, ул. Индустриальная, 2, ТРК «СИТИ ЦЕНТР», 3 этаж. Вход свободный.',
    ],
  },
  {
    id: id++,
    img1: news27,
    text: [
      'Weekend MaxMara в ТРК «СИТИ ЦЕНТР»',
      'Мы рады сообщить вам об открытии первого и единственного бутика Weekend MaxMara в Краснодаре!',
      'Концепция бренда основана на сочетании понятий «шик» и «свободный стиль», который сочетает стремление к женственности и современности с необходимостью комфорта и практичности.',
      'Все модели Weekend MaxMara отличаются оригинальным кроем и превосходными материалами.',
      'Приглашаем вас посетить наш бутик и насладиться атмосферой стиля!',
    ],
  },
];

export { arrayNews };

// const news = [
// {
//   id: id++,
//   img1: news6,
//   text: [
//     'Новая коллекция Bikkembergs SS24 в салонах Х.О.',
//     'Дирк Биккембергс — бельгийский дизайнер, который сумел объединить высокую моду и спорт, создав уникальное направление — спортивный шик. Его работы стали символом брутального сексуального тела и постоянного движения вперёд. Коллекции последних лет только подтверждают это.',
//   ],
// },
// {
//   id: id++,
//   img1: news7,
//   text: [
//     'Модные, локальные, премиальные бренды в одном пространстве в ТРК «СИТИ ЦЕНТР»!',
//     '20 июля открытие POP UP STORE - пространства с уникальными локальными дизайнерами. Следите за подробностями в наших социальных сетях.',
//   ],
// },
// {
//   id: id++,
//   img1: news8,
//   text: [
//     '27 июля в ТРК «СИТИ ЦЕНТР» состоится модный показ.',
//     'Вас ждет незабываемое погружение в мир высокой моды. Стилист-имиджмейкер расскажет все о трендах 2024, проведёт стильный мастер-класс. Также вы сможете собрать красивый букет и получить уникальные призы от наших партнеров.',
//     'Не упустите возможность стать частью этого события и окунуться в атмосферу роскоши, элегантности и стиля.',
//   ],
// },
// {
//   id: id++,
//   img1: news3,
//   img2: news4,
//   img3: news5,
//   text: [
//     'В салоне Эстель Адони появились пляжные новинки от Lise Charmel, Gottex, Maryan Mehlhorn и других модных брендов, самое время выбрать новый купальник и запланировать поездку на море или визит в SPA!!',
//     'В этом сезоне в трендах изысканная сексуальность и акцентные украшения: кольца, пряжки, пояса, декоративные цепочки, шнуровки, а также глубокие вырезы. Среди принтов актуальны графичные, цветочные, анималистические и этнические рисунки.',
//     'У нас вы можете собрать полноценный пляжный гардероб, включая туники, парео, пляжные платья и шорты, а также аксессуары, среди которых стильные шляпы, сумки и пляжная обувь. Ждем на вдохновляющий летний шопинг!',
//   ],
// },
// {
//   id: id++,
//   img1: news1,
//   img2: news1_1,
//   text: [
//     'Летняя распродажа в салонах Х.О.: скидки до 40%!',
//     'Ищете идеальный подарок для мужчины? Или, может быть, хотите обновить свой гардероб стильной одеждой и аксессуарами? Тогда вам точно стоит заглянуть в салоны Х.О., где проходит грандиозная распродажа!',
//     'Вас ждут мужские коллекции от ведущих мировых брендов: Aubade, KARL LAGERFELD, Zegna, Bikkembergs, DIESEL, Moschino, Derek Rose, Hanro, Calida, Emporio Armani, Bluemint, Hugo, Iceberg, Dolce&Gabbana, Olaf Benz, Zimmerli и многих других. Не упустите возможность приобрести качественные вещи по приятным летним ценам!',
//     'Скидки до 40% действуют на всё: мужское бельё, домашнюю и верхнюю одежду, спортивные костюмы, брюки, рубашки, футболки, пляжную коллекцию и аксессуары.',
//     'Также в этот период в салонах Х.О. за каждые купленные 3 единицы товара вы получите 1000 бонусов в подарок! Воспользоваться этими бонусами можно будет в сентябре (50% от стоимости новой коллекции).',
//     'Ждём вас в салонах Х.О.!',
//   ],
// },
// {
//   id: id++,
//   img1: news9,
//   text: [
//     'Fashion-day в ТРК «СИТИ ЦЕНТР»',
//     'Уже в эту субботу модный показ с эксклюзивными коллекциями! Вас ждет незабываемое погружение в мир высокой моды и стиля, живая музыка и фуршет с изысканными закусками.',
//     'Ждем вас 17 августа в 17:00 🤍',
//     'Dress code: black&white',
//     '📍ТРК «Сити-центр» Индустриальная 2',
//   ],
// },
// {
//   id: id++,
//   img1: news10,
//   text: [
//     'Бренд Kiara Onda был основан в 2017 году и представляет собой премиальную линию одежды для женщин. Основная идея бренда заключается в создании уникальных и стильных образов, которые подчеркивают индивидуальность каждой женщины.',
//     'Одежда от Kiara Onda отличается высоким качеством материалов и кропотливой работой над каждым элементом дизайна. В коллекциях бренда можно найти как повседневную одежду, так и вечерние платья, а также аксессуары, которые дополнят любой образ.',
//     'Коллекции Kiara Onda представлены в интернет-магазине и розничных магазинах, расположенных в крупных городах России. Также бренд активно участвует в различных модных мероприятиях и показах, что позволяет ему оставаться в центре внимания fashion-индустрии.',
//     'Особое внимание уделяется комфорту и удобству при ношении одежды, поэтому каждая модель проходит тщательное тестирование перед тем, как попасть в продажу. Кроме того, компания предлагает услуги индивидуального пошива, что делает каждую вещь еще более эксклюзивной и уникальной.',
//     'Kiara Onda – это не просто бренд одежды, это философия стиля и элегантности, которая помогает женщинам выглядеть безупречно в любой ситуации.',
//   ],
// },
// {
//   id: id++,
//   img1: news11,
//   text: [''],
// },
// {
//   id: id++,
//   img1: news12,
//   text: [
//     'Vilebrequin расширяет присутствие в России: новый магазин в Краснодаре СИТИ',
//     '15 октября 2024 года французский бренд пляжной моды Vilebrequin открыл новый магазин в ТРК Сити Центр Краснодар (2 этаж). Это событие стало важным шагом в расширении розничной сети бренда и укреплении его позиций на российском рынке.',
//     'Посетители магазина смогут ознакомиться с полным ассортиментом Vilebrequin, включая эксклюзивную капсульную коллекцию Rayures. Эта коллекция, воплощающая элегантность морского стиля, включает в себя:',
//     'Приходите сами и приглашайте друзей — вместе мы создадим неповторимый день 🤍',
//     'Мужскую линию: Популярные шорты MOOREA в белую полоску — идеальное сочетание комфорта и стиля для пляжного отдыха',
//     'Женскую линию: Стильный черно-белый слитный купальник Rayures с асимметричным декольте. Раздельный купальник в стиле 1950-х с кроп-топом и бикини',
//     'Особого внимания заслуживает материал, используемый в коллекции — мягкий полиамид с добавлением эластана. Он быстро сохнет и сохраняет форму даже после длительного пребывания в воде, что делает его идеальным для активного пляжного отдыха.',
//     'Открытие магазина Vilebrequin в ТРК Сити Центр Краснодар дает жителям и гостям города уникальную возможность приобщиться к элегантному французскому пляжному стилю, воплощенному в коллекции 2024 года.',
//   ],
// },
// {
//   id: id++,
//   img1: news13,
//   text: [
//     'Театральные сезоны в ТРК «СИТИ ЦЕНТР» 🎭',
//     'Мы рады сообщить, что 9 ноября в 13:00 состоится уникальное событие, которое объединит магию музыки и балета.',
//     'Приготовьтесь погрузиться в мир искусства, где мелодии оживут через каждое движение танцоров!',
//     'Приходите сами и приглашайте друзей — вместе мы создадим неповторимый день 🤍',
//   ],
// },
// {
//   id: id++,
//   img1: news14,
//   text: [
//     'Выставка работ Елены Славных - художника в жанре трэш-арта 🤍',
//     'В работах Елены сказка встречается с реальностью, образы оживают через неожиданные материалы и отходы, которые невозможно переработать.',
//     'Погрузитесь в атмосферу искусства вместе с нами!',
//   ],
// },
// {
//   id: id++,
//   img1: news15,
//   text: [
//     'Приглашаем вас на День Рождения ТРК «СИТИ ЦЕНТР» 🎪',
//     '23 ноября в 18:00 мы отмечаем свое двадцатилетие 🤍 Вас ждёт незабываемое шоу, полное ярких эмоций, смеха и волшебства!',
//     'Сбор гостей в 16:00.',
//     'Присоединяйтесь к нам, чтобы отметить этот особенный день с семьёй и друзьями!',
//   ],
// },
// {
//   id: id++,
//   img1: news17,
//   text: [''],
// },
// {
//   id: id++,
//   img1: news16,
//   text: [
//     'Приглашаем вас и ваших маленьких волшебников на новогодние мастер-классы в ТРК «СИТИ ЦЕНТР» 🎁',
//     'В этом году мы подготовили увлекательные и творческие занятия, где каждый сможет создать свой новогодний подарок или декор. А в конце у каждого малыша будет уникальная возможность - участие в финальном празднике, представив свои творения 😍',
//     'Мастер-классы будут проходить с 23 по 31 декабря. Погрузитесь в атмосферу праздника вместе с нами 🎄',
//     'Расписание мастер классов:',
//     'С 23.12 по 31.12 (включительно)',
//     'С 14:00 до 18:00',
//     '23.12 - Роспись на мини холстах',
//     '24.12 - Новогодняя гирлянда',
//     '25.12 - Объемная новогодняя открытка',
//     '26.12 - Подставки под кружки',
//     '27.12 - Кормушки для птиц',
//     '28.12 - Новогодняя игрушка на елку',
//     '29.12 - Новогодняя рамка для фото',
//     '30.12 - Дед Мороз из фетра',
//     '31.12 - Алмазная мозаика Пряничный человечек',
//   ],
// },
// {
//   id: id++,
//   img1: news18,
//   text: [''],
// },
// {
//   id: id++,
//   img1: news19,
//   text: [
//     'Новогодний спектакль «Щелкунчик» для всей семьи в ТРК «СИТИ ЦЕНТР»',
//     '28 декабря в 15:00 атриум Сити станет волшебной сказкой, где оживают мечты и фантазии.',
//     'Это уникальное представление подарит вам и вашим близким незабываемые эмоции, яркие впечатления и атмосферу настоящего праздника 🎁',
//     'Не упустите возможность стать частью этого чудесного события!',
//   ],
// },
// {
//   id: id++,
//   img1: news20,
//   text: [
//     'Начните новый год с покупки красивого белья в «Эстель Адони»!',
//     'С 29 декабря в салонах нашей сети и на сайте estelle.ru вас ждут рождественские скидки до 30%!',
//     'Изысканный комплект белья от любимого бренда, роскошная сорочка из драгоценного шелка, нежнейшее белье из натурального хлопка - у нас вы найдете то, что согреет вашу душу, разбудит чувства и подарит волшебное новогоднее настроение!',
//     'Ждем вас на праздничный шопинг в «Эстель Адони»!',
//   ],
// },
// {
//   id: id++,
//   img1: news21,
//   text: [
//     'В «Эстель Адони» стартовала зимняя распродажа!',
//     'С 14 января во всех салонах сети вас ждут скидки до 50% на женское белье, одежду для дома, сна и отдыха. Идеальное гладкое белье под любую одежду, чувственные кружевные модели, комфортные топы, элегантные халаты, сорочки, костюмы и пижамы – все для вашей красоты и удовольствия!',
//     'Спешите поймать самые выгодные предложения от любимых брендов на зимней распродаже в «Эстель Адони»!',
//   ],
// },
// {
//   id: id++,
//   img1: news22,
//   text: [
//     'Новая коллекция Guess в ТРК «СИТИ ЦЕНТР»',
//     'В этом сезоне представлены стильные силуэты и оригинальные принты. Коллекция включает как повседневную одежду, так и более нарядные модели, идеально подходящие для особых случаев. Подчеркнуть свою индивидуальность с Guess!',
//   ],
// },
// {
//   id: id++,
//   img1: news23,
//   img2: news24,
//   text: [
//     'Финал распродажи в «Эстель Адони»!',
//     'Только 5 дней, с 13 по 17 февраля, в салоне «Эстель Адони»',
//     'Вас ждут любимые бренды, в коллекциях которых вы найдете модели белья на любой случай и под любой наряд, а также роскошные линии одежды для сна и отдыха по самым выгодным ценам.',
//     'Воспользуйтесь прекрасной возможностью выгодно обновить свой бельевой гардероб к наступающей весне!',
//     'Подарите себе моменты радости в «Эстель Адони»!',
//   ],
// },
// {
//   id: id++,
//   img1: news25,
//   text: [
//     'Встречаем весну ярко!',
//     'В салонах «Эстель Адони» появились разноцветные, бесшовные и практически невесомые трусики Chantelle PULPIES. Эти яркие новинки станут идеальным подарком к празднику, тем более что, покупая две любые модели линии с 20 февраля по 9 марта, третьи трусики вы получаете бесплатно!',
//     'Chantelle PULPIES – это легчайшая ткань, яркие цвета, разнообразие моделей, универсальные размеры и оригинальная упаковка, похожая на коробочку с губной помадой. Их удобно положить в сумку, взять с собой в путешествие, очень комфортно носить и приятно дарить!',
//     'Не пропустите акцию Chantelle PULPIES в «Эстель Адони»!',
//   ],
// },
// {
//   id: id++,
//   img1: news26,
//   text: [
//     '28 февраля старт масштабного проекта Гастро Код Юга при поддержке Кейтеринг бюро @caterburo в Сити Центре @citycenter_krd',
//     'В честь великой Масленицы мы подготовили для Вас незабываемый Кулинарный МК «Тещины посиделки»',
//     'Гастро Код Юга - это сообщество, которое формирует общественное мнение с точки зрения гастрономии и сервиса Юга России.',
//     'Фотоотчет от GeoPro',
//     '28 февраля 17:00 - ТЦ СИТИ ЦЕНТР',
//     'ВХОД ПО ПРИГЛАШЕНИЯМ',
//   ],
// },
//   // {
//   //   id: 1,
//   //   title: '',
//   //   link: '/news',
//   //   url: 'bg-[url("../public/news/7.jpg")]',
//   //   img: news7,
//   //   text: [
//   //     {
//   //       id: 1,
//   //       t1: [
//   //         'Модные, локальные, премиальные бренды в одном пространстве в ТРК «СИТИ ЦЕНТР»!',
//   //         '20 июля открытие POP UP STORE - пространства с уникальными локальными дизайнерами. Следите за подробностями в наших социальных сетях.',
//   //       ],
//   //     },
//   //   ],
//   // },
//   // {
//   //   id: 2,
//   //   title: '',
//   //   link: '/news',
//   //   url: 'bg-[url("../public/news/1.jpg")]',
//   // },
//   // {
//   //   id: 3,
//   //   title: '',
//   //   link: '/news',
//   //   url: 'bg-[url("../public/news/1-1.jpg")]',
//   // },
//   // {
//   //   id: 4,
//   //   title: '',
//   //   link: '/news',
//   //   url: 'bg-[url("../public/news/3.jpg")]',
//   // },
//   // {
//   //   id: 1,
//   //   img: news4,
//   //   imgm: news4,
//   //   title: ['Уважаемые Гости!'],
//   //   text: [
//   //     {
//   //       id: 1,
//   //       t1: [
//   //         'Сегодня — День Рождения ТРК «СИТИ ЦЕНТР» 🎉',
//   //         <br key={1} />,
//   //         'Каждый год привносит в ТРК новые уникальные события, красочные улучшения и запоминающиеся мероприятия, но одно остается неизменным — наше доверие к вам и желание становиться лучше с каждым пройденным месяцем🤍',
//   //         'Мы бесконечно благодарны вам за эмоции и отдачу, которую мы видим каждый день, и надеемся, что в следующем, юбилейном году ТРК мы достигнем еще более новых высот вместе с вами — нашими Гостями 🎉',
//   //       ],
//   //     },
//   //     {
//   //       id: 2,
//   //       t1: [
//   //         'Именно сейчас самое время подумать об обновлении пляжного гардероба, когда новые коллекции купальников и аксессуаров поступили в магазины и еще есть все размеры!',
//   //         <br key={1} />,
//   //         'В «Эстель Адони» уже представлены самые горячие круизные коллекции от ваших любимых брендов: SHAN, Lise Charmel, Melissa Odabash, Gottex, Maryan Mehlhorn и другие марки с мировыми именами. Мини-бикини, совместные модели, бандо, купальники на одно плечо, парео, туники, сарафаны, платья, халаты, рубашки, топы, юбки, брюки, шорты и еще множество вещей, которые непременно украсят ваш пляжный сезон, уже ждут вас!',
//   //       ],
//   //     },
//   //   ],
//   // },
//   // {
//   //   id: 1,
//   //   img: news3,
//   //   imgm: news3,
//   //   title: [
//   //     'МАФИЯ! МАФИЯ! МАФИЯ!',
//   //     <br key={1} />,
//   //     'Ждем вас на детской МАФИИ (8+)',
//   //   ],
//   //   text: [
//   //     {
//   //       id: 1,
//   //       t1: [
//   //         '⭕ Чем полезна игра?',
//   //         <br key={1} />,
//   //         'Мафия познакомит юных участников с принципами логических рассуждений, научит прислушиваться к окружающим и анализировать их поступки, покажет, как правильно формулировать мысли. Кроме того, Мафия развивает фантазию: в процессе игры дети придумывают себе роли и вживаются в них.',
//   //       ],
//   //     },
//   //     {
//   //       id: 2,
//   //       t1: [
//   //         'Когда: 4.08 И 17.08',
//   //         <br key={1} />,
//   //         'Время: 18:30-20:30',
//   //         <br key={2} />,
//   //         'Место: ТРК СИТИ ЦЕНТР',
//   //         <br key={3} />,
//   //         '❗Стоимость участия: 1500 ₽',
//   //         <br key={4} />,
//   //         ' * Участники игры поужинают в одном из двух ресторанов ТРК" СИТИ ЦЕНТР"  @don_bazilio , @love_truffle_rest😉',
//   //         <br key={5} />,
//   //         'Получат подарки от @kenguru_krd 🙌',
//   //         <br key={6} />,
//   //         'И обязательно  будет фотоотчет📸',
//   //         <br key={7} />,
//   //         '❗❗КОЛИЧЕСТВО МЕСТ ОГРАНИЧЕНО.',
//   //       ],
//   //     },
//   //   ],
//   // },
//   // {
//   //   id: 5,
//   //   img: news6,
//   //   imgm: news6,
//   //   title: ['Скидки до 40% на летней распродаже в «Эстель Адони»!'],
//   //   text: [
//   //     {
//   //       id: 1,
//   //       t1: [
//   //         'Еще больше моделей знаменитых европейских брендов со скидками 30% и 40% ждут вас в салоне «Эстель Адони». Не упустите возможность купить модные купальники, изящное белье и стильную одежду для летнего отдыха по приятным ценам!',
//   //         <br key={1} />,
//   //         'Порадуйте себя соблазнительными комплектами из прозрачной сетки или воздушного кружева, подберите идеальные базовые модели под любимые летние наряды! Обратите внимание на пижамы, сорочки и халаты из натуральных материалов, которые так приятно носить в жару.',
//   //       ],
//   //     },
//   //     {
//   //       id: 2,
//   //       t1: [
//   //         'Для незабываемого морского отдыха мы подберем вам идеальный гардероб: оригинальные купальники и пляжную одежду, которые дополним элегантными аксессуарами.',
//   //         <br key={1} />,
//   //         'Приглашаем в «Эстель Адони» за отличным настроением и выгодными новинками для солнечных дней!',
//   //       ],
//   //     },
//   //   ],
//   // },
//   // {
//   //   id: 2,
//   //   img: news2,
//   //   imgm: news2,
//   //   title: [''],
//   //   text: [
//   //     {
//   //       id: 1,
//   //       t1: [
//   //         '🗓 24 августа в 18:00 мы встречаемся в @citycenter_krd @kinomonitor, где посмотрим очередной потрясающий фильм и обсудим его смыслы вместе с экспертами кино и не только:',
//   //         <br key={1} />,
//   //         '✅ Алексей Двоеглазов - журналист, кинокритик, автор проекта @kinopohod',
//   //         <br key={2} />,
//   //         '✅ Юрий Архангельский - Заведующий кафедрой режиссуры кино и телевидения КГИК',
//   //         <br key={3} />,
//   //         '✅ Алексей Русакевич @alexey.rusakevich - психолог, гипнолог.',
//   //         <br key={4} />,
//   //         'А спикерами будет каждый присутствующий зритель 😉',
//   //       ],
//   //     },
//   //     {
//   //       id: 2,
//   //       t1: [
//   //         'Партнеры проекта:',
//   //         <br key={1} />,
//   //         '@pani.bulochka',
//   //         <br key={2} />,
//   //         '@ipatov.brand',
//   //         <br key={3} />,
//   //         '@don_bazilio',
//   //         <br key={4} />,
//   //         '@luding.ru',
//   //         <br key={5} />,
//   //         '@geometria.krd',
//   //         <br key={6} />,
//   //         '@concept_store_krd_',
//   //         <br key={7} />,
//   //         '@giorgio_boutique',
//   //         <br key={8} />,
//   //         '@sergeyteyvanov',
//   //       ],
//   //     },
//   //     {
//   //       id: 3,
//   //       t1: [
//   //         'Билеты можно приобрести по ссылке в шапке профиля или написав нам в Директ ➡ @bolshie.volshebniki',
//   //       ],
//   //     },
//   //   ],
//   // },
//   // {
//   //   id: 3,
//   //   img: news1,
//   //   imgm: news1,
//   //   title: ['Финал распродажи в Эстель Адони!'],
//   //   text: [
//   //     {
//   //       id: 1,
//   //       t1: 'Настало время для самого выгодного шопинга в «Эстель Адони»!',
//   //     },
//   //     {
//   //       id: 2,
//   //       t1: 'Только 5 дней, с 24 по 28 августа, в салонах нашей сети пройдет Финальная распродажа.',
//   //     },
//   //     {
//   //       id: 3,
//   //       t1: [
//   //         'Не пропустите максимальные скидки на белье, купальники и одежду для отдыха от известных мировых брендов. Успейте поймать все самое лучшее!',
//   //       ],
//   //     },
//   //   ],
//   // },
//   // {
//   //   id: 4,
//   //   img: news5,
//   //   imgm: news5,
//   //   title: [
//   //     'Торопитесь на финальную распродажу в салонах мужского белья Х.О.!',
//   //   ],
//   //   text: [
//   //     {
//   //       id: 1,
//   //       t1: 'Последний шанс успеть!',
//   //     },
//   //     {
//   //       id: 2,
//   //       t1: [
//   //         'Всего 5 дней, с 24 по 28 августа, скидки до 60%! Грандиозный SALE на белье, пляжную и домашнюю одежду от ваших любимых Bikkembergs, Emporio Armani, Moschino, Hugo Boss, Dolce&Gabbana, Guess, Karl Lagerfeld и других модных брендов.',
//   //       ],
//   //     },
//   //     {
//   //       id: 3,
//   //       t1: ['Позвольте себе самое лучшее качество по доступной цене!'],
//   //     },
//   //   ],
//   // },
// ];
