let id = 1;
import news101 from '@/public/news/101.jpg';
import news102 from '@/public/news/102.jpg';
import news103 from '@/public/news/103.jpg';
import news104 from '@/public/news/104.jpg';
import news105 from '@/public/news/105.jpg';
import news106 from '@/public/news/106.jpg';
import news107 from '@/public/news/107.jpg';
import news108_1 from '@/public/news/108-1.jpg';
import news108_2 from '@/public/news/108-2.jpg';
import news108_3 from '@/public/news/108-3.jpg';
import news108_4 from '@/public/news/108-4.jpg';
import news109 from '@/public/news/109.jpg';
import news110 from '@/public/news/110.jpg';
import news111 from '@/public/news/111.jpg';
import news112 from '@/public/news/112.jpg';
import news113 from '@/public/news/113.jpg';
import news114 from '@/public/news/114.jpg';
import news115 from '@/public/news/115.jpg';
import news116_1 from '@/public/news/116-1.jpg';
import news116_2 from '@/public/news/116-2.jpg';
import news116_3 from '@/public/news/116-3.jpg';
import news116 from '@/public/news/116.jpg';
import news117 from '@/public/news/117.jpg';
import news118 from '@/public/news/118.jpg';
import news119 from '@/public/news/119.jpg';
import news120 from '@/public/news/120.jpg';
import news121 from '@/public/news/121.jpg';
import news122_1 from '@/public/news/122-1.jpg';
import news122_2 from '@/public/news/122-2.jpg';
import news122_3 from '@/public/news/122-3.jpg';
import news122 from '@/public/news/122.jpg';
import news123 from '@/public/news/123.jpg';
import news124_1 from '@/public/news/124-1.jpg';
import news124_2 from '@/public/news/124-2.jpg';
import news124_3 from '@/public/news/124-3.jpg';
import news124 from '@/public/news/124.jpg';
import news125 from '@/public/news/125.jpg';
import news126_1 from '@/public/news/126-1.jpg';
import news126_2 from '@/public/news/126-2.jpg';
import news126_3 from '@/public/news/126-3.jpg';
import news126 from '@/public/news/126.jpg';
import news127 from '@/public/news/127.jpg';
import news128 from '@/public/news/128.jpg';
import news129 from '@/public/news/129.jpg';
import news130 from '@/public/news/130.jpg';
import news131 from '@/public/news/131.jpg';
import news132 from '@/public/news/132.jpg';
import news133 from '@/public/news/133.jpg';
import news134 from '@/public/news/134.jpg';
import news135 from '@/public/news/135.jpg';
import news136 from '@/public/news/136.jpg';
import news137 from '@/public/news/137.jpg';
import news138 from '@/public/news/138.jpg';
import news139 from '@/public/news/139.jpg';
import news140 from '@/public/news/140.jpg';
import news140_1 from '@/public/news/140-1.jpg';
// import news77 from '@/public/services/ChistoBlisto/logo.jpg';

const arrayNews = [
  {
    id: id++,
    img1: news140,
    img2: news140_1,
    text: [
      'Новинка в Giorgio: легендарная селективная марка Rouge Bunny Rouge уже в ТРК «СИТИ ЦЕНТР» 💄',
      'После масштабного перезапуска под руководством AKS Concept Studio итальянский бренд вернулся с обновленной визуальной идентичностью и переработанной коллекцией.',
      'В линейке — декоративная косметика на каждый день: тонкие текстуры, ухаживающие компоненты и палитра оттенков от деликатных нюдов до фирменного насыщенного бордового. Особое внимание — культовым помадам, сочетающим цвет, комфорт и уход.',
      'Приходите знакомиться с новинками, делать свотчи и находить свой идеальный оттенок в бутике Giorgio 🤍',
    ],
    link: '/news#new1',
  },
  {
    id: id++,
    img1: news139,
    text: [
      '🤩🤩🤩 особое предложение для тех, кто ценит эстетику в бутике Togas',
      '−35% на шопинг для дома и отдыха только до 30 июня',
      'Скидки не суммируются с другими предложениями. Количество товаров ограничено.',
      '📍 2 этаж, ТРК «СИТИ ЦЕНТР»',
      '📞 +7 861 204 01 49',
    ],
    link: '/news#new2',
  },
  {
    id: id++,
    img1: news138,
    text: [
      'Marc Cain весна‑лето 2026',
      'В бутике уже можно примерить новинки! Особое внимание стоит обратить на линию Summer Flash.',
      'Лёгкие ткани, расслабленные, но продуманные силуэты — вещи легко собрать и в городской образ, и в отпуск.',
      'Коллекция делает ставку на современную женственность, комфорт и внимание к деталям 🤍',
    ],
    link: '/news#new3',
  },
  {
    id: id++,
    img1: news137,
    text: [
      '🤩🤩🤩 в «Эстель Адони»',
      'До 30 июня действует специальное предложение: при покупке комплекта белья или двух бюстгальтеров французского бренда Simone Pérèle вы получаете скидку 20% ❤️',
      'Simone Pérèle — это воплощение французской элегантности, безупречной посадки и комфорта. Бельё, которое подчёркивает естественную красоту, дарит уверенность и ощущается на теле практически невесомо.',
      'Порадуйте себя новинками любимого бренда и добавьте в лето ещё больше красоты и комфорта ☀️',
    ],
    link: '/news#new4',
  },
  {
    id: id++,
    img1: news136,
    text: [
      'Волшебный вечер в ТРК «СИТИ ЦЕНТР» 🥂',
      'В основе постановки — знаменитая кантата Карла Орфа, вдохновлённая средневековыми текстами о судьбе, любви, надежде и вечном колесе фортуны, которое меняет человеческие жизни.',
      'Эдвард Клюг воплотил музыку в пластике, создав завораживающий балет, где каждое движение наполнено смыслом, а строгая геометрия танца соединяется с глубокими эмоциями и драматизмом.',
      'На экране зрителей ждёт масштабное произведение искусства, объединившее музыку, хор, симфонический оркестр и балет в единое впечатляющее действо ❤️',
      'Создайте пространство, где каждая деталь наполнена гармонией, красотой и ощущением спокойствия.',
    ],
    url: 'https://kinomonitor.ru',
    urltext: '🎟 Билеты уже в продаже на kinomonitor.ru',
  },
  {
    id: id++,
    img1: news135,
    text: [
      'Новая коллекция от Togas',
      'В год своего 100-летнего юбилея бренд представляет флагманскую коллекцию «Дельфия» — вдохновлённую величием древней Эллады и переосмысленную в современном прочтении.',
      'Главный мотив коллекции — изящные завитки аканта, выполненные в технике визуальной ретроспективы, создающей эффект лёгкой дымки времени и особую атмосферу утончённой роскоши 🤍',
      'Основой коллекции стало постельное бельё из инновационной ткани SENSOTEX®, сочетающей шелковистую мягкость и комфорт. Также в коллекцию вошли покрывала, фарфор, столовый текстиль, мраморные аксессуары и интерьерные ароматы.',
      'Создайте пространство, где каждая деталь наполнена гармонией, красотой и ощущением спокойствия.',
      '📍 2 этаж, ТРК «СИТИ ЦЕНТР»',
    ],
  },
  {
    id: id++,
    img1: news134,
    text: [
      'Специальный показ фильма «Марк глазами Софии» 🎬',
      '24 июня в 19:30 приглашаем вас на особый вечер — показ фильма «Марк глазами Софии» (18+) режиссёра Софии Копполы.',
      'Это первая документальная работа Софии Копполы, созданная за пределами художественного кино. Фильм предлагает уникальный взгляд на легендарного модельера Марка Джейкобса и мир высокой моды через призму авторского видения режиссёра.',
      'После просмотра гостей ждёт обсуждение фильма с экспертами: ',
      '— кинокритиком Виктором Венгерским',
      '— стилистом и организатором авторских fashion-встреч Ириной Дурлештер',
      'Если вам интересны кино, мода и истории выдающихся личностей, этот вечер точно нельзя пропустить 🤍',
    ],
    url: 'https://kinomonitor.ru',
    urltext: '🎟 Билеты уже в продаже на kinomonitor.ru',
  },
  {
    id: id++,
    img1: news133,
    text: [
      'Сезон скидок в Concept Store',
      'В бутике стартовали горячие скидки на актуальные коллекции — до 50%',
      'Это отличная возможность обновить гардероб, найти стильные новинки и приобрести любимые вещи по особенно приятным ценам.',
      'Не откладывайте шопинг на потом — самые интересные модели находят своих владельцев быстрее всего',
      'Скидки действуют до 25 июня',
      '📍 2 этаж, ТРК «СИТИ ЦЕНТР»',
    ],
  },
  {
    id: id++,
    img1: news132,
    text: [
      'С Днём России! 🇷🇺',
      'Россия — страна с удивительной историей, в которой переплетаются эпохи, культуры, традиции и судьбы многих поколений. Именно это наследие вдохновляет нас сохранять лучшее из прошлого и создавать будущее.',
      'В этот праздничный день желаем вам мира, благополучия, новых возможностей и поводов гордиться своей страной, своим городом и людьми, которые вас окружают.',
      'Пусть в вашем доме всегда будут тепло, гармония и счастье 🤍',
    ],
  },
  {
    id: id++,
    img1: news131,
    text: [
      '🤩🤩🤩 Каждое украшение рассказывает свою историю',
      'Одно подчёркивает характер. Второе отражает настроение. Третье становится частью вашего уникального стиля.',
      'До 30 июня в Доме Ювелирной Моды ZOTTY действует специальное предложение:',
      '— 10% на первое украшение',
      '— 20% на второе',
      '— 30% на третье',
      'Создавайте собственные сочетания, экспериментируйте с образами и собирайте ювелирную коллекцию, которая будет рассказывать именно вашу историю ❤️',
      '📍 1 этаж, ТРК «СИТИ ЦЕНТР»',
    ],
  },
  {
    id: id++,
    img1: news130,
    text: [
      '11 июня в 20:00 приглашаем вас на необычную встречу с художницей-керамистом и автором проекта «Валюша в стране керамики» ❤️',
      'Тема лекции — «Из адского пекла в райский сад. Как оживить осколок: керамика, которая помнит себя разбитой».',
      'Поговорим о том, как рождается авторская керамика, почему трещины и несовершенства могут стать частью искусства и какую историю способен рассказать каждый предмет, созданный руками мастера.',
      'Это возможность по-новому взглянуть на керамику, познакомиться с творческим процессом и узнать больше о философии проекта «Фактура Керамика» 🥂',
      '📍2 этаж, ТРК «СИТИ ЦЕНТР»',
      'Бронирование: +7 (918) 049-87-49',
    ],
  },
  {
    id: id++,
    img1: news129,
    text: [
      '🤩🤩🤩 Время обновить гардероб в MAX&Co.',
      'В бутике стартовали скидки 30% на новую коллекцию весна–лето!',
      'Лёгкие ткани, актуальные силуэты, яркие акценты и безупречный итальянский стиль — всё, что нужно для нового сезона, уже ждёт вас.',
      'Не упустите возможность приобрести понравившиеся модели по привлекательным ценам и добавить в свой гардероб ещё больше летнего настроения ❤️',
      '📍2 этаж, ТРК «СИТИ ЦЕНТР»',
    ],
  },
  {
    id: id++,
    img1: news128,
    text: [
      'Волшебный вечер в ТРК «СИТИ ЦЕНТР»',
      '11 июня в кинотеатре «Монитор Сити» состоится премьера спектакля «Я — Сергей Образцов» (16+) от Государственного академического центрального театра кукол им. С.В. Образцова.',
      'Это необычное кукольное путешествие через весь XX век, посвящённое жизни и творчеству легендарного Сергея Образцова — человека, который навсегда изменил мир театра кукол.',
      'Режиссёр-постановщик спектакля — Екатерина Образцова, внучка великого мастера. В главной роли — Евгений Цыганов.',
      'Погрузитесь в атмосферу театрального искусства и откройте для себя удивительную историю, рассказанную языком кукол, воспоминаний и творчества 🤍',
    ],
    url: 'https://kinomonitor.ru',
    urltext: '🎟 Билеты уже в продаже на kinomonitor.ru',
  },
  {
    id: id++,
    img1: news127,
    text: [
      'Забота о самых важных с Togas',
      'До 7 июня в бутике действует специальное летнее предложение — скидки до 30% на избранные коллекции детского текстиля и аксессуаров.',
      'Мягкие ткани, продуманные детали и безупречное качество помогут создать для ребёнка атмосферу уюта, комфорта и гармонии дома ',
      'Порадуйте маленьких членов семьи красивыми и практичными новинками от бренда с почти вековой историей! ',
      ' 2 этаж, ТРК «СИТИ ЦЕНТР»',
    ],
  },
  {
    id: id++,
    img1: news126,
    img2: news126_1,
    img3: news126_2,
    img4: news126_3,
    text: [
      'SAFINA CONCEPT — это украшения со смыслом, где каждая коллекция рассказывает свою историю и отражает разные грани женской природы',
      ' ',
      'Здесь украшения становятся не просто аксессуарами, а настоящими эмоциональными артефактами — харизматичными, узнаваемыми и наполненными символами. Каждое изделие создаётся по авторским эскизам, отливается из латуни и покрывается золотом 24k.',
      'Особая ценность бренда — внимание к деталям, ручная работа и вдохновение, собранное со всего мира. Это украшения, которые остаются актуальными долгие годы и становятся частью личной истории своей обладательницы! ',
      'Сейчас у вас есть уникальная возможность познакомиться с брендом и приобрести изделия SAFINA CONCEPT в pop-up бутике «Кубань Дизайн» ',
    ],
  },
  {
    id: id++,
    img1: news125,
    text: [
      'Комфорт, который не нужно скрывать 🛍️',
      'В салоне «Эстель Адони» действует специальное предложение — скидка 25% на новую и базовую коллекции бренда Like it!',
      'Like it! — это немецкое качество, лаконичный дизайн и бельё, которое идеально садится по фигуре, остаётся незаметным под одеждой и дарит комфорт на протяжении всего дня ❤️',
      'Порадуйте себя бельём, которое помогает чувствовать уверенность в каждом движении.',
      'Акция действует до 30 июня',
      '📍2 этаж, ТРК «СИТИ ЦЕНТР»',
    ],
  },
  {
    id: id++,
    img1: news124,
    img2: news124_1,
    img3: news124_2,
    img4: news124_3,
    text: [
      'Лето начинается с Marc Cain 🌊',
      'В бутике Marc Cain представлена новая коллекция Salty Breeze — вдохновлённая морским бризом, путешествиями и атмосферой беззаботного отдыха!',
      'Натуральные ткани, благородные оттенки морской волны, лёгкие силуэты и безупречный крой создают образы, в которых комфорт идеально сочетается с элегантностью.',
      'Подарите своему гардеробу настроение лета и откройте для себя главные новинки сезона ❤️',
      '📍2 этаж, ТРК «СИТИ ЦЕНТР»',
    ],
  },
  {
    id: id++,
    img1: news123,
    text: [
      'Запах вечности: великое путешествие парфюмерии 🥂',
      '4 июня в 20:00 приглашаем вас на увлекательную лекцию о мире ароматов в pop-up бутике «Кубань Дизайн».',
      'Вместе с Михаилом Золотарёвым — топ-стилистом и создателем собственного парфюмерного бренда — отправимся в путешествие сквозь эпохи и узнаем, как развивалось парфюмерное искусство. ',
      'Также в рамках встречи создатель бренда Dom De Maestro Игорь Сорокин расскажет о философии бренда, истории его создания и вдохновении, которое лежит в основе каждой коллекции.',
      'Это встреча для всех, кто интересуется стилем, историей и магией ароматов ❤️',
      '📞 Регистрация на мероприятие: +7 (989) 855-85-84',
    ],
  },
  {
    id: id++,
    img1: news122,
    img2: news122_1,
    img3: news122_2,
    img4: news122_3,
    text: [
      'Дом начинается с деталей 🛍️',
      'Togas — бренд с почти вековой историей, который с 1926 года создаёт текстиль и предметы интерьера, объединяющие элегантность, комфорт и безупречное качество.',
      'Постельное бельё, текстиль для дома, мебель, аксессуары и одежда — каждая коллекция создаётся с особым вниманием к деталям и вдохновлена философией красивой жизни ❤️',
      'Если вы цените уют, эстетику и высокий стиль, обязательно загляните в бутик Togas в ТРК «СИТИ ЦЕНТР».',
      '🤍 Для новых клиентов действует эксклюзивное предложение. Подробности уточняйте у консультантов бутика.',
    ],
  },
  {
    id: id++,
    img1: news121,
    text: [
      'С Днём защиты детей 🤍',
      'Пусть детство будет наполнено добром, вдохновением, яркими впечатлениями и возможностью каждый день открывать для себя что-то новое!',
      'Желаем детям улыбок и исполнения самых заветных желаний, а взрослым — беречь это особенное время и создавать моменты, которые останутся в памяти на долгие годы!',
    ],
  },
  {
    id: id++,
    img1: news120,
    text: [
      'Танцы, музыка и атмосфера настоящего праздника 💃🏼',
      '31 мая в 16:00 приглашаем вас в на яркую концертную программу с участием коллектива армянского танца «Арин-Берд» ',
      'Гостей ждут национальные танцы, живое музыкальное сопровождение, выступления творческих коллективов ❤️',
      'Погрузитесь в атмосферу традиций, ритма и ярких эмоций вместе с нами! ',
      '📍 ТРК «СИТИ ЦЕНТР»',
    ],
  },
  {
    id: id++,
    img1: news119,
    text: [
      'Парфюмерные тонкости ✨',
      '30 мая в 14:00 приглашаем вас на атмосферную лекцию о мире ароматов в ТРК «СИТИ ЦЕНТР»',
      'Поговорим о том, как устроена парфюмерия, почему один аромат раскрывается на всех по-разному и какие нюансы помогают найти «тот самый» парфюм 🤍',
      'Спикер встречи — Оксана Бганцева, аромадизайнер и парфюмер.',
      'Участие бесплатное',
      'Количество мест ограничено!',
      '📍 2 этаж, ТРК «СИТИ ЦЕНТР»',
    ],
  },
  {
    id: id++,
    img1: news118,
    text: [
      'Особое предложение для тех, кто ценит уют и эстетику в бутике Togas',
      'До 31 мая выбирайте изысканный текстиль, посуду, аксессуары для дома и ароматы со скидками до 40% на избранный ассортимент.',
      'Это идеальный повод создать пространство тишины и гармонии — с мягкими тканями, утончёнными оттенками и настроением весны в каждой детали 🤍',
      'Скидки не суммируются с другими предложениями. Количество товаров ограничено.',
      '📍 2 этаж, ТРК «СИТИ ЦЕНТР»',
      '📞 +7 861 204 01 49',
    ],
  },
  {
    id: id++,
    img1: news117,
    text: [
      'Яркая весна в Marc Cain',
      'В бутике действует скидка -50% на выделенный ассортимент весенней коллекции ✨',
      'Сочные оттенки, смелые принты, премиальные ткани и безупречный крой — всё для стильных образов этого сезона.',
      'Добавьте красок в свой гардероб и найдите новые любимые сочетания 🤍',
      'Количество товара ограничено — ждём вас на примерку!',
      '📍 2 этаж, ТРК «СИТИ ЦЕНТР»',
    ],
  },
  {
    id: id++,
    img1: news116,
    img2: news116_1,
    img3: news116_2,
    img4: news116_3,
    text: [
      'В ТРК «СИТИ ЦЕНТР» открылся «Кубань Дизайн Кооператив» — pop-up бутик краснодарских дизайнеров, художников, ремесленников и керамистов.',
      'В одном пространстве собраны уникальные одежда, украшения, аксессуары, предметы интерьера и авторская керамика — многие изделия представлены в единственном экземпляре 🤍',
      'Проект создала Анна Сергунова-Козырева — дизайнер и участник международных fashion-проектов. А витрины бутика оформлены работами художника Игоря Михайленко ✨',
      'Pop-up пространство будет работать до 30 июня.',
      '📍 2 этаж, ТРК «СИТИ ЦЕНТР»',
    ],
  },
  {
    id: id++,
    img1: news115,
    text: [
      'Волшебный вечер в ТРК «СИТИ ЦЕНТР» 😍',
      '28 мая в кинотеатре «Монитор Сити» — специальный показ оперы Джузеппе Верди «Травиата» (16+) на итальянском языке с русскими субтитрами.',
      'На большом экране — масштабная постановка Оперного фестиваля в Санкт-Маргаретен (Австрия).',
      'Режиссёр-постановщик Роберт Херцль создал впечатляющий спектакль о любви, чувствах и трагической красоте, а главные партии исполняют Кристиане Кайзер и Жан-Франсуа Боррас 🤍',
      'Погрузитесь в атмосферу высокого искусства вместе с ТРК «СИТИ ЦЕНТР».',
      ' ',
    ],
    url: 'https://kinomonitor.ru',
    urltext: '🎟 Билеты уже в продаже на kinomonitor.ru',
  },
  {
    id: id++,
    img1: news114,
    text: [
      'Идеальная бельевая капсула к лету.',
      'Французский бренд Chantelle знает, каким должно быть бельё для тёплого сезона: лёгким, комфортным и абсолютно незаметным под одеждой!',
      'До 31 мая при покупке комплекта или двух бюстгальтеров брендов Chantelle, Chantelle X или линии Chantelle SoftStretch Power вы получите 5 000 бонусов в подарок.',
      'Лаконичные базовые модели, гладкое кружево и комфортные трансформеры — всё для стильного и комфортного лета.',
      'Порадуйте себя красивым бельём на особых условиях в Эстель Адони.',
      '📍 2 этаж, ТРК «СИТИ ЦЕНТР»',
    ],
  },
  {
    id: id++,
    img1: news113,
    text: [
      'Новые коллекции HUGO и BOSS уже в Concept Store 🛍️',
      'В бутике представлены новые коллекции мужской одежды из натурального льна: рубашки, брюки и модели для расслабленных городских и отпускных образов.',
      'Спокойные оттенки, актуальные силуэты и вещи, которые хочется носить каждый день.',
      'Лаконично. Комфортно. По-летнему элегантно 😍',
      '📍 2 этаж, ТРК «СИТИ ЦЕНТР»',
    ],
  },
  {
    id: id++,
    img1: news112,
    text: [
      'С Днём Великой Победы!',
      'Этот день напоминает о силе человеческого духа, мужестве и ценности мира.',
      '9 Мая — важная дата, которая объединяет поколения памятью, уважением и благодарностью.',
      'Пусть в каждом доме сегодня звучат тёплые слова, истории семей и искренние воспоминания 🤍',
      'С любовью, ТРК «СИТИ ЦЕНТР»',
    ],
  },
  {
    id: id++,
    img1: news111,
    text: [
      'Искусство, воплощённое в украшениях ✨',
      'В бутике Renaissance представлена коллекция Annamaria Cammilli — изысканная, выразительная и по-настоящему завораживающая.',
      'Плавные линии, уникальные формы и фирменные оттенки золота создают украшения, от которых невозможно оторвать взгляд.',
      '📍1 этаж, ТРК «СИТИ ЦЕНТР»',
    ],
  },
  {
    id: id++,
    img1: news110,
    text: [
      'Волшебный вечер ✨',
      '14 мая в 19:00 в кинотеатре «Монитор Сити» — особое событие для ценителей искусства!',
      'На большом экране — спектакль «Женитьба» (16+) от Государственный академический театр имени Моссовета.',
      'Стильная постановка гоголевского трагифарса в прочтении режиссёра Евгений Марчелли — это тонкий юмор, выразительная сценография и актуальное звучание классики. История о поиске любви, ожиданиях и выборе, которая остаётся современной вне времени.',
      'Погрузитесь в атмосферу театра в ТРК «СИТИ ЦЕНТР» 🤍',
      ' ',
    ],
    url: 'https://kinomonitor.ru',
    urltext: '🎟 Билеты уже в продаже на kinomonitor.ru',
  },
  {
    id: id++,
    img1: news109,
    text: [
      'Выпускной — момент, который остаётся с вами навсегда ✨',
      'И костюм для этого вечера должен быть безупречным.',
      'В Richard MTM создают костюмы на заказ — с учётом вашей фигуры, характера и повода. Это не просто одежда, а точная посадка и индивидуальный стиль.',
      'Премиальные ткани от Loro Piana, Scabal и Dormeuil, ручная работа и внимание к деталям — всё, что делает образ по-настоящему особенным.',
      'Для выпускников и их пап — идеальный повод прийти вместе и уйти с иголочки 🤍',
      'Успейте записаться заранее — сезон уже начался',
      '📍2 этаж, ТРК «СИТИ ЦЕНТР»',
      '📞 +7 (938) 41-069-51',
    ],
  },
  {
    id: id++,
    img1: news108_1,
    img2: news108_2,
    img3: news108_3,
    img4: news108_4,
    text: [
      'KINEXT CITY',
      '— это пространство, где функциональный и силовой тренинг на премиальном оборудовании сочетаются с уникальными студийными форматами нового поколения.',
      'Pilates, TRX, REAXING, иммерсивная ICG-студия — вы выбираете формат под своё настроение и цель, пользуясь приватностью и комфортом в любое время дня.',
      'Ваше пространство для силы, восстановления и баланса.',
      'KINEXT CITY — когда фитнес становится образом жизни.',
      'Предпродажи открыты. Специальная стоимость доступна только на старте продаж 🤍',
      '📍2 этаж, ТРК «СИТИ ЦЕНТР»',
    ],
  },
  {
    id: id++,
    img1: news107,
    text: [
      'С Праздником Весны и Труда!',
      'Пусть этот день станет добрым напоминанием о важности баланса — между делом и отдыхом, движением и вдохновением.',
      'Желаем вам лёгкости на душе, внутренней гармонии и искреннего удовольствия от каждого дня 🤍',
      'С наилучшими пожеланиями, ТРК «СИТИ ЦЕНТР»',
    ],
  },
  {
    id: id++,
    img1: news106,
    text: [
      'Время обновить пространство и наполнить дом атмосферой весны ✨',
      'В бутике Togas в ТРК «СИТИ ЦЕНТР» — особое предложение для тех, кто ценит уют, эстетику и детали.',
      'До 15 мая выбирайте изысканный текстиль, посуду, аксессуары для дома и ароматы со скидками до 40% на избранный ассортимент.',
      'Это идеальный повод создать пространство тишины и гармонии — с мягкими тканями, утончёнными оттенками и настроением весны в каждой детали 🤍',
      'Скидки не суммируются с другими предложениями. Количество товаров ограничено.',
      '📍 2 этаж, ТРК «СИТИ ЦЕНТР»',
      '📞 +7 861 204 01 49',
    ],
  },
  {
    id: id++,
    img1: news105,
    text: [
      'Готовимся к лету с комфортом и выгодой ☀️',
      'В Эстель Адони — идеальное предложение для обновления базового гардероба: третьи трусики Chantelle SoftStretch в подарок!',
      'До 10 мая покупайте двое трусиков из акционного ассортимента и получайте третьи бесплатно 💫',
      'Почему миллионы женщин выбирают SoftStretch',
      'Это настоящее «белье-невидимка» — оно не выделяется даже под самой тонкой и облегающей одеждой. Идеально для летних образов и тренда на лёгкие ткани.',
      'Не упустите шанс приобрести любимое бельё выгодно 🤍',
      '📍 2 этаж, ТРК «СИТИ ЦЕНТР»',
    ],
  },
  {
    id: id++,
    img1: news104,
    text: [
      'Уже 25 апреля в 18:00 состоится весенний форум, где объединятся право, психология и стиль.',
      '🕊 Тема: брак, имущество и дети — важные вопросы, о которых стоит говорить открыто и профессионально.',
      ' ',
      'В программе:',
      '— выступления практикующих адвокатов Гоар Галстян и Марины Вейнер',
      '— разборы от психологов Альбины Абдул и Марины Шастовой',
      '— модный показ и тренды сезона от Галины Дебровой',
    ],
  },
  {
    id: id++,
    img1: news103,
    text: [
      'История сумок ✨',
      '26 апреля в 13:00 приглашаем вас на атмосферную лекцию-погружение в мир моды и культовых аксессуаров в ТРК «СИТИ ЦЕНТР»',
      'Поговорим о том, как сумки стали отражением эпохи, статуса и стиля, какие модели вошли в историю и почему они остаются актуальными вне времени.',
      'Спикер вечера — Нинэль, стилист, историк моды и фотограф, которая умеет рассказывать о моде так, что она оживает.',
      'Участие бесплатное 🤍',
      'Количество мест ограничено!',
    ],
    url: 'https://forms.yandex.ru/u/69a314d24936393cba7ff53c',
    urltext: 'Регистрация на мероприятие',
  },
  {
    id: id++,
    img1: news102,
    text: [
      '🎭 ТРК «СИТИ ЦЕНТР» — место, где встречаются мода, искусство и культура',
      'Продолжаем серию культурных вечеров и приглашаем вас 16 апреля в кинотеатр «Монитор Сити» на показ театральной постановки «Таланты и покойники».',
      'Вас ждёт яркий и ироничный спектакль по пьесе Марка Твена: история о молодом художнике, который вместе с друзьями решается на дерзкую авантюру.',
      'Это вечер для тех, кто ценит искусство, тонкий юмор и нестандартные театральные решения!',
      '✨ Приятный бонус для гостей: предъявителю билета на «Волшебный вечер» в ресторане Oysters действует специальное предложение — 3 по цене 2. Подробности у сотрудников ресторана.',
    ],
    url: 'https://kinomonitor.ru/release/22479?date=2026-04-16',
    urltext: 'Купить билеты',
  },
  {
    id: id++,
    img1: news101,
    text: [
      'С Днём космонавтики! 🚀',
      '12 апреля — день, когда человечество сделало шаг за пределы привычного мира, открыв новую эру возможностей.',
      'Пусть этот день вдохновляет вас на смелые решения, веру в свои силы и стремление к новым горизонтам 🤍',
    ],
  },
  // {
  //   id: id++,
  //   img1: news100,
  //   img2: news100_1,
  //   img3: news100_2,
  //   img4: news100_3,
  //   text: [
  //     'Самое время обновить гардероб в ТРК «СИТИ ЦЕНТР»🤍',
  //     'В мультибрендовом бутике Concept Store — долгожданное поступление коллекций от премиальных европейских брендов Riani и JOOP!',
  //     'Свежие силуэты, безупречный крой и утончённая палитра оттенков воплощают современную элегантность и стиль вне времени.',
  //     'Откройте для себя гармонию комфорта и роскоши — этой весной ваш образ станет по-настоящему вдохновляющим ✨',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news99,
  //   img2: news99_1,
  //   img3: news99_2,
  //   img4: news99_3,
  //   img5: news99_4,
  //   text: [
  //     'Поздравляем с приближением Светлой Пасхи 👼🏼',
  //     'Don Bazilio открывает предзаказ на угощения к празднику:',
  //     ' ',
  //     '— Панеттоне с вяленной вишней и кремом пломбир;',
  //     '— Панеттоне с вяленной вишней и нутеллой;',
  //     '— Творожный кулич с изюмом и цукатами;',
  //     '— Шоколадные яйца в глазури;',
  //     '— Карамельные петушки.',
  //     ' ',
  //     'Уточнить стоимость и оформить заказ возможно по телефону: +7 (918) 120-00-13',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news98,
  //   text: [
  //     'Новые вкусы уже ждут вас🤍',
  //     'В ресторане Oysters в ТРК «СИТИ ЦЕНТР» обновили меню — ещё больше изысканных сочетаний, свежих ингредиентов и гастрономического удовольствия.',
  //     'Попробуйте новинки, откройте для себя новые вкусы и проведите время в атмосфере уюта и эстетики ✨',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news97,
  //   text: [
  //     'Форум «Закон и мода на перекрёстке судеб» 🤍',
  //     '25 апреля в 18:00 в кинотеатре «Монитор Сити» состоится весенний форум, где объединятся право, психология и стиль.',
  //     '🕊 Тема: брак, имущество и дети — важные вопросы, о которых стоит говорить открыто и профессионально.',
  //     'Дресс-код: розовый, золотой, белый',
  //     ' ',
  //     'В программе:',
  //     '— выступления практикующих адвокатов Гоар Галстян и Марины Вейнер',
  //     '— разборы от психологов Альбины Абдул и Марины Шастовой',
  //     '— модный показ и тренды сезона от Галины Дебровой',
  //     ' ',
  //     'Это пространство для тех, кто стремится к юридической безопасности, внутреннему балансу и уверенности в себе.',
  //     'Билеты уже в продаже — в кассе кинотеатра и на сайте kinomonitor.ru',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news96,
  //   text: [
  //     'В ТРК «СИТИ ЦЕНТР» открылся промо-подиум ESTETICA VISION 🤍',
  //     'Премиальный бренд мебели и матрасов с собственным производством более 40 000 м² и 20-летним опытом представляет коллекции, в которых сочетаются технологии, дизайн и безупречное качество.',
  //     'В ассортименте — диваны, кровати, кресла, матрасы и столы, созданные из ценных пород древесины и итальянских тканей. А благодаря собственному цеху ювелирного литья бренд реализует даже самые нестандартные дизайнерские решения.',
  //     'Оцените уровень комфорта и эстетики в ESTETICA VISION ✨',
  //     '📍1 этаж, ТРК «СИТИ ЦЕНТР»',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news95,
  //   text: [
  //     'Именинники марта, у нас для вас особенное предложение 🤍',
  //     'В пространстве Популярные в Сити действуют скидки на банкет до 10 000 ₽ — праздновать день рождения в будние дни теперь ещё выгоднее.',
  //     'Специальные условия:',
  //     '— стоимость посещения для гостей — 1 500 ₽',
  //     '— имениннику вход бесплатный',
  //     'Акция действует при праздновании дня рождения в марте в будние дни.',
  //     'Промокод: ХОЧУ В ПОПУЛЯРНЫЕ',
  //     'Количество дат ограничено — рекомендуем бронировать заранее.',
  //     'Подробности и бронирование:',
  //     '+7 918 333-17-77',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news94,
  //   text: [
  //     'Дорогие женщины!',
  //     'Пусть эта весна подарит вам легкость, свежие мечты и замечательные перемены.',
  //     'Желаем, чтобы каждый ваш день начинался с улыбки, интересных событий и приятных сюрпризов!',
  //     'ТРК «Сити Центр» всегда ждет вас за хорошими впечатлениями и стильным настроением. Поздравляем с 8 Марта!',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news93,
  //   text: [
  //     'Упакуем ваши подарки 🎁',
  //     'Совершайте покупки в ТРК «СИТИ ЦЕНТР» и получите бесплатную упаковку подарков для ваших близких ✨',
  //     ' ',
  //     'Как это работает?',
  //     '— совершите покупку в любом бутике ТРК «СИТИ ЦЕНТР»;',
  //     '— подойдите в наше «Ателье упаковки подарков» с чеком;',
  //     '— выберите понравившуюся упаковку, а мы красиво оформим ваш подарок.',
  //     ' ',
  //     'Акция действует с 6 по 8 марта',
  //     'Сделайте момент вручения подарка ещё более особенным 🤍',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news92,
  //   text: [
  //     'Иногда один цветок говорит больше, чем тысячи слов…',
  //     '8 марта молодой человек будет встречать гостей ТРК «СИТИ ЦЕНТР» и дарить розы.',
  //     'Позвольте себе этот красивый жест и окунитесь в атмосферу праздника!',
  //     'Ждём вас в ТРК «СИТИ ЦЕНТР» 🤍',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news91,
  //   text: [
  //     'Высший свет Екатеринодара ✨',
  //     '6 марта в 19:00 приглашаем вас на атмосферную лекцию-погружение в мир светской жизни Екатеринодара.',
  //     'Поговорим о моде и манерах, блистательных балах и самых громких событиях прошлого — о времени, когда каждый выход в свет был искусством.',
  //     'Спикер вечера — Андрей Ступаченко, краевед и экскурсовод, который умеет рассказывать так, что история буквально оживает.',
  //     'Участие бесплатное 🤍 Количество мест ограничено! Обязательна предварительная регистрация.',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news90,
  //   text: [
  //     'Аромат, к которому хочется возвращаться 💫',
  //     'Musk Therapy — это композиция, которая звучит как мягкая пауза посреди насыщенного дня.',
  //     'Пудровый белый мускус, сливочный сандал и едва уловимая кислинка чёрной смородины создают ощущение внутреннего баланса и спокойствия.',
  //     'Для более глубокого звучания эксперты Giorgio рекомендуют наслаивать аромат: крем для тела из коллекции, затем парфюм и ароматную дымку для волос. Так композиция становится ещё мягче и устойчивее.',
  //     'Идеальный подарок к 8 марта — тонкий, продуманный, запоминающийся 🤍',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news89,
  //   text: [
  //     'ТРК «СИТИ ЦЕНТР» поздравляет с Днем Защитника Отечества!',
  //     'Спасибо всем, кто бережет мир и безопасность, кто готов действовать решительно и честно — на службе, в работе и в семье.',
  //     'Пусть ваш труд и усилия всегда будут замечены и оценены.',
  //     'Желаем благополучия, стабильности и уверенного движения к целям. Пусть дома ждут тепло и поддержка, а впереди будет больше возможностей, побед и радостных событий.',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news88,
  //   text: [
  //     'БОЛЬШОЙ СЕМЕЙНЫЙ ВЫХОДНОЙ в «Популярные в Сити» 🤍',
  //     '22 февраля приглашаем провести день, который запомнится всей семье ✨',
  //     'Вас ждёт насыщенная праздничная программа, любимые герои, свободная игра для детей и по-настоящему тёплая атмосфера, где каждый найдёт радость и вдохновение.',
  //     ' ',
  //     'Стоимость билета — 3 000₽',
  //     'Формат: безлимит на весь день',
  //     'Подарите себе и детям выходной, который захочется повторять снова и снова 💫',
  //     ' ',
  //     'Обратите внимание: вход до 15:00 оплачивается по почасовому тарифу.',
  //     '📍3 этаж, ТРК «СИТИ ЦЕНТР»',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news87,
  //   text: [
  //     'А вы уже выбрали подарок своему мужчине? 🎁',
  //     'Советуем обратить внимание на стильные аксессуары Boss в бутике Concept Store — ',
  //     'элегантные портмоне, несессеры и другие детали, которые подчеркнут статус и вкус.',
  //     'А чтобы подарок выглядел безупречно, дополните его бесплатной упаковкой в нашем ателье подарков ✨',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news86,
  //   text: [
  //     'Упакуем ваши подарки 🎁',
  //     'Совершайте покупки в ТРК «СИТИ ЦЕНТР» и получите бесплатную упаковку подарков для ваших близких✨',
  //     ' ',
  //     'Как это работает?',
  //     '— совершите покупку в любом бутике ТРК «СИТИ ЦЕНТР»; ',
  //     '— подойдите в наше «Ателье упаковки подарков» с чеком; ',
  //     '— выберите понравившуюся упаковку, а мы красиво оформим ваш подарок.',
  //     'Сделайте момент вручения подарка ещё более особенным 🤍',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news85,
  //   text: [
  //     'Мир высокой моды — на большом экране 🍿',
  //     '25 февраля в 19:30 в кинотеатре МОНИТОР Сити состоится специальный показ фильма Кутюр (18+) — за день до всероссийской премьеры.',
  //     'Главные роли исполнили Анджелина Джоли и Луи Гаррель.',
  //     'Это история о закулисье Парижской недели высокой моды, где карьера, чувства и судьбы переплетаются в атмосфере красоты и вдохновения.',
  //     '📌В программе вечера:',
  //     '— welcome drink',
  //     '— специальный показ',
  //     '— обсуждение фильма с приглашёнными экспертами:',
  //     'Галина Деброва — имиджмейкер, стилист и основатель комьюнити «Стильный Юг»;',
  //     'Гоар Галстян — адвокат и основатель женского сообщества «Женщина и право».',
  //     'Идеальный вечер для всех, кто вдохновляется модой и большим кино 🤍',
  //     ' ',
  //     '🎟 Билеты уже в продаже на kinomonitor.ru',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news84,
  //   text: [
  //     'Откройте для себя пространство, где рождается эстетика уюта и безупречного стиля — бутик Togas в ТРК «СИТИ ЦЕНТР».',
  //     ' ',
  //     'Основанный в Греции в 1926 году, бренд на протяжении почти века создаёт текстиль и предметы интерьера, которые становятся частью красивой и гармоничной жизни.',
  //     'Изысканное постельное бельё, элегантный текстиль, мебель, коллекции для детей и аксессуары — каждая деталь отражает философию Togas: баланс комфорта, качества и утончённого вкуса.',
  //     'Позвольте вашему дому звучать по-новому — мягко, стильно и по-настоящему роскошно.',
  //     '📍 2 этаж, ТРК «СИТИ ЦЕНТР»',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news83,
  //   text: [
  //     'Настоящая романтика начинается с красивых жестов и безупречных деталей 🤍',
  //     'Бутик Togas подготовил особое предложение — –25% на каждый второй товар в чеке.',
  //     'Идеальный повод выбрать изысканные подарки для любимых и наполнить дом атмосферой красоты, уюта и тонкого вкуса ✨',
  //     'Акция действует до 15 февраля.',
  //     'Подробности уточняйте у консультантов бутика или по телефону: +7 800 555 37 71',
  //     '📍 2 этаж, ТРК «СИТИ ЦЕНТР»',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news82,
  //   text: [
  //     'Стильная зима с Paul&Shark ✨',
  //     'В бутике Paul&Shark в ТРК «СИТИ ЦЕНТР» действуют скидки до −40% на выделенный ассортимент зимней коллекции.',
  //     'Безупречное качество, функциональность и узнаваемый итальянский стиль — идеальный выбор для холодного сезона и выгодный повод обновить гардероб.',
  //     'Успейте воспользоваться предложением и выбрать своё идеальное зимнее настроение в Paul&Shark 🤍',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news81,
  //   text: [
  //     'Специальные предложения в BOGNER✨',
  //     'В бутике действуют выгодные условия на актуальные коллекции:',
  //     '— 30% на коллекцию Man / Woman FW’25',
  //     '— 30% на коллекцию FIRE+ICE FW’25',
  //     'Функциональность, премиальные материалы и безупречный стиль — идеальный момент обновить гардероб!',
  //     'Ждём вас в BOGNER в ТРК «СИТИ ЦЕНТР» 🤍',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news80,
  //   text: [
  //     'Время исключительных возможностей ✨',
  //     'В бутике TwinSet Milano действуют скидки до −90% на все коллекции.',
  //     'Итальянская элегантность, женственные силуэты и утончённые детали теперь доступны на особых условиях. Идеальный момент, чтобы обновить гардероб и позволить себе больше любимого стиля TwinSet.',
  //     'Не упустите шанс — ждём вас в ТРК «СИТИ ЦЕНТР» 🤍',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news79,
  //   text: [
  //     'Зима — лучшее время для особенных покупок ✨',
  //     'В бутике KIARA действует скидка −50% на шубы из австралийского мериноса — выбор для тех, кто ценит комфорт, стиль и качество.',
  //     'Шерсть мериноса невероятно мягкая и приятная к телу, не колется и дарит ощущение уюта с первого прикосновения. Она отлично сохраняет тепло, при этом позволяет коже дышать, обеспечивая идеальную терморегуляцию. Лёгкие, долговечные и элегантные — такие шубы станут безупречной инвестицией в ваш зимний гардероб.',
  //     'Откройте для себя тепло в премиальном исполнении в ТРК «СИТИ ЦЕНТР» 🤍',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news78,
  //   text: [
  //     'MAGIC WINTER SALE ✨',
  //     'До 30 января бутик FREYWILLE продолжает исполнять ваши мечты и дарит скидки до 50% на избранные коллекции.',
  //     'Это редкая возможность пополнить свою ювелирную коллекцию настоящими произведениями искусства — украшениями, вдохновлёнными шедеврами великих художников, мировой культурой и утончённой эстетикой бренда.',
  //     'Позвольте себе больше красоты этой зимой 🤍',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news77,
  //   text: [
  //     'Компания Chisto Blisto специализируется на профессиональной реставрации и ремонте кожаных изделий.',
  //     'Мы используем качественные материалы, современные технологии и аккуратный ручной труд.',
  //     'Наши мастера бережно восстанавливают обувь, сумки и аксессуары, возвращая им внешний вид и продлевая срок службы.',
  //     'Мы ценим доверие клиентов и стремимся к результату, который действительно радует.',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news76,
  //   text: [
  //     '26 декабря в 19:00 приглашаем вас на торжественное открытие Oysters 🦪',
  //     'Вас ожидают живая музыка, дегустация морских деликатесов, свежие устрицы, утончённая подача и безупречный вкус — всё, чтобы превратить вечер в настоящее гастрономическое событие.',
  //     'Откройте для себя новый уровень вкуса и эстетики 🤍',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news75,
  //   text: [
  //     'В преддверии новогодних праздников хотим обратить ваше внимание на график работы ТРК «СИТИ ЦЕНТР» 🤍',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news74,
  //   text: [
  //     'Художественная выставки «Снежная палитра» ❄️',
  //     '20 декабря в 18:00 приглашаем Вас на открытие выставки в кинотеатре «МОНИТОР Сити»!',
  //     'Зима — время особого волшебства, уюта и ожидания праздника. Искрящийся снег, морозный воздух и тихая красота зимних пейзажей испокон веков вдохновляли художников. Именно этому состоянию посвящена новая выставка.',
  //     'Картины предоставлены из частных коллекций Льва Давыдовича Песок и Андрея Александровича Гладченко.',
  //     'Арт-куратор проекта — Ольга Трапицына.',
  //     'Проведите зимний вечер в окружении искусства и вдохновения — ждём вас в ТРК «СИТИ ЦЕНТР» 🤍',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news73,
  //   text: [
  //     'Создайте праздничную атмосферу вместе с «Эстель Адони»',
  //     'До 31 декабря получите в подарок 5000 бонусов на покупку комплекта или 2 бюстгальтеров французского модного дома Simone Perele из новых или базовых линий!',
  //     'Гламурное, смелое и утонченное белье Simone Perele призвано подчеркнуть женскую красоту в  волшебные зимние праздники. Выразите свои чувства через волнующий образ!',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news72,
  //   text: [
  //     'Новый уровень гастрономии в ТРК «СИТИ ЦЕНТР» 🦪',
  //     'Рады сообщить, что сегодня состоялось открытие устричного ресторана Oysters! ',
  //     'Теперь атмосфера безупречного шопинга дополняется изысканными морскими деликатесами и эстетикой настоящего luxury-формата 🥂',
  //     'Свежие устрицы, утончённая подача, безупречный вкус и особое настроение — всё, чтобы превратить обычный визит в ТРК «СИТИ ЦЕНТР» в настоящее гастрономическое удовольствие.',
  //     'Приглашаем открыть для себя новый уровень гастрономии и позволить себе чуть больше роскоши в Oysters 🤍',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news71,
  //   text: [
  //     'Открытие нового бутика в ТРК «Сити Центр» 🤍',
  //     'Мы рады сообщить, что совсем скоро состоится открытие Re:premium — сети салонов электроники нового формата, где премиум не означает дорого.',
  //     'Apple, Samsung, Dyson, Sony, Xiaomi и многие другие бренды в наличии и под заказ.',
  //     'А также:',
  //     '— гарантия до 3 лет,',
  //     '— рассрочка 0-0-36,',
  //     '— trade-in.',
  //     'Покупайте премиум-технику без переплат в Re:premium ✨',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news70,
  //   img2: news70_1,
  //   img3: news70_2,
  //   text: [
  //     'Если вы искали идеальный повод заглянуть в MIU CITY — он уже здесь!',
  //     'Команда обновила меню и подготовила для вас сезонные новинки, которые невозможно пропустить 😍',
  //     'Рекомендуем попробовать:',
  //     '– Сэндвич с индейкой — сытно, свежо и очень вкусно.',
  //     '– Десерт «Красный бархат» с клубникой или',
  //     '– «Сникерс» — идеальное завершение любого дня.',
  //     '– И, конечно же, какао с пряной малиной — согревающий хит этой зимы.',
  //     'Приходите наслаждаться любимым и открывать новое — MIU CITY ждёт вас в ТРК «СИТИ ЦЕНТР» 🤍',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news69,
  //   text: [
  //     'Клиентский день MIRIAM QUEVEDO в бутике GIORGIO ✨',
  //     '9 декабря бутик GIORGIO приглашает вас на особое бьюти-событие — клиентский день Miriam Quevedo.',
  //     'Вас ждёт:',
  //     '• Профессиональная компьютерная диагностика кожи головы и волос',
  //     '• Индивидуальная консультация трихолога бренда',
  //     '• Личные рекомендации по уходу',
  //     '• Подарки при покупке продукции',
  //     '• И просто отличный повод заглянуть к нам в гости и посвятить время себе 🤍',
  //     ' ',
  //     'Будем рады видеть вас!',
  //     '📞 Запись: +7 928 845-89-64',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news68,
  //   img2: news68_2,
  //   img3: news68_3,
  //   text: [
  //     'Вы долго этого ждали — и мы рады сообщить! 🥳',
  //     'В ТРК «СИТИ ЦЕНТР» открылся офис продаж KINEXT.',
  //     'KINEXT CITY станет ультрасовременным пространством, включая в себя 15 фитнес-зон, разработанных с учетом последних мировых трендов, термальный комплекс и SPA-зону. ',
  //     'Заходите в офис продаж и станьте ближе к новой версии себя вместе с KINEXT CITY 🤍',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news67,
  //   text: [
  //     'НОВЫЙ ГОД — НОВЫЙ ТЫ: психологический интенсив 💫',
  //     '12 декабря в кинотеатре «МОНИТОР Сити» пройдёт уникальный психологический интенсив — практическая встреча для тех, кто хочет по-настоящему перезагрузиться и войти в 2026 год с ясностью, силой и рабочими инструментами для перемен.',
  //     'Спикеры форума:',
  //     'Марина Шастова — психолог-сексолог, арт-терапевт, эксперт «Первого канала».',
  //     'Елена Морозова — международно-сертифицированный медиатор, тренер, эксперт Минпросвещения России.',
  //     'Наталья Шевченко (Лебедева) — художница, чьи работы представлены в музеях и частных коллекциях по всему миру; основатель бренда «Натан».',
  //     ' ',
  //     'Это не лекция — это живой практикум, после которого вы получите:',
  //     '✓ понимание своих внутренних блоков',
  //     '✓ эмоциональную лёгкость',
  //     '✓ проект главной цели на 2026 год',
  //     '✓ инструменты самопомощи, которые работают ежедневно',
  //     ' ',
  //     '🎟 Билеты уже в продаже в кассе кинотеатра и на сайте kinomonitor.ru',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news66,
  //   text: [
  //     'Тик-так, тик-так…',
  //     'Осталось всего три дня до завершения грандиозной распродажи FREYWILLE в ТРК «СИТИ ЦЕНТР» ✨',
  //     'Момент, когда можно порадовать себя и близких утончёнными ювелирными произведениями искусства по действительно привлекательным ценам!',
  //     'До Нового года совсем немного времени, и сейчас идеальный шанс выбрать особенный подарок: украшения FREYWILLE со скидкой до 50% 🤍',
  //     'Не упустите возможность стать обладателем настоящих шедевров!',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news65,
  //   text: [
  //     'В MAX&Co начался сезон изысканных покупок ✨',
  //     'Только до 2 декабря в бутике действуют скидки до 30% — идеальный повод пополнить гардероб актуальными моделями и создать стильные образы.',
  //     'Премиальные материалы, безупречные силуэты и итальянская эстетика ждут вас в ТРК «СИТИ ЦЕНТР» 🤍',
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news64,
  //   text: [
  //     "КУРАТОРИУМ: Открытый диалог для художников 🎨",
  //     "22 ноября в 16:00 в арт-пространстве кинотеатра «Монитор Сити de Luxe»состоится событие, созданное для тех, кто живёт искусством, работает в креативной сфере и стремится к развитию в профессиональном сообществе.",
  //     " ",
  //     "В программе встречи:",
  //     "• Открытый разговор об актуальных темах современного арт-рынка",
  //     "• Профессиональный нетворкинг и знакомство с коллегами",
  //     "• Неформальное общение в кругу единомышленников",
  //     " ",
  //     "Спикеры:",
  //     "• Ольга Трапицына — художник, член Союза художников России, арт-директор галереи «Особнякъ»",
  //     "• Диана Эгина — арт-менеджер, куратор выставок, владелица салона «Салон Княже», юрист",
  //     "• Анастасия Семенова — арт-директор галереи «Арт Небо»",
  //     " ",
  //     "Эксперты арт-среды создадут продуктивную атмосферу и поделятся профессиональными инсайтами.",
  //     "📞 Участие по предварительной записи: +7 911 918 12 91",
  //     "Не упустите шанс стать частью творческого комьюнити и вдохновиться новыми идеями в ТРК «СИТИ ЦЕНТР» 🤍",
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news63,
  //   text: [
  //     "GIORGIO x FAKOSHIMA — закрытая вечеринка",
  //     "Бутик GIORGIO приглашает вас 27 ноября в 18:00 на эксклюзивное событие, созданное для тех, кто ценит эстетку, стиль и атмосферу закрытых комьюнити-ивентов.",
  //     "Вас ждёт:",
  //     "• Коллекция оптики FAKOSHIMA x БЕСПРИНЦИПНЫЕ",
  //     "• Презентация нового аромата Secret Venue FAKOSHIMA",
  //     "• DJ CET — музыкальный сет вечера",
  //     "• Авторские special cocktails",
  //     " ",
  //     "Специальные гости — Константин Шиляев и Ярослав Симонов",
  //     "Просим соблюдать dress code, чтобы вечер получился таким же эстетичным, как и его идея 🤍",
  //     "Чтобы попасть в закрытый список гостей, заполните короткую анкету.",
  //     <a
  //       href="https://inv-you.ru/giorgio-city"
  //       target="_blank"
  //       rel="noreferrer"
  //       key={"1"}
  //       className="underline-news"
  //     >
  //       Анкета для посещения мероприятия
  //     </a>,
  //     "Количество мест ограничено 🥂",
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news62,
  //   text: [
  //     "15 ноября в прямом эфире состоялся финальный розыгрыш подарков от ТРК «СИТИ ЦЕНТР»",
  //     "Благодарим каждого участника за эмоции, внимание и невероятную вовлечённость ✨",
  //     "С радостью объявляем победителей:",
  //     "Купоны №514, 466, 460 — сертификаты на 10 000₽ от РОЛЬФ",
  //     "Купон №125 — сертификат на 20 000₽ от Cosmo Store",
  //     "Купон №53 — сертификат на 20 000₽ от D’EXTERIOR",
  //     "Купоны №530, 144 — сертификаты на 20 000₽ от FREY WILLE",
  //     "Купон №25 — VIP-карта от GMT",
  //     "Купон №325 — сертификат на 20 000₽ от Paul&Shark",
  //     "Купоны №371, 437 — сертификаты на 20 000₽ от Renaissance",
  //     "Купоны №433, 318, 518 — сертификаты на 20 000₽ от Richard MTM Man",
  //     "Купоны №230, 35 — сертификаты на 20 000₽ от Van Laack",
  //     "Купон №507 — сертификат на 20 000₽ от Zotty",
  //     "Купон №164 — сертификат на 20 000₽ от X.O",
  //     " ",
  //     "Главный приз — отдых в Pullman Sochi Centre",
  //     "Победители: купон №388 и №363",
  //     "Поздравляем всех счастливчиков и благодарим каждого участника за то, что были с нами!",
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news61,
  //   text: [
  //     "Всемирный день шопинга ✨",
  //     "Приглашаем стать частью этого праздника стиля в ТРК «СИТИ ЦЕНТР» 🤍",
  //     "Вас ждут уникальные предложения, лимитированные коллекции и атмосфера, в которой покупки превращаются в удовольствие.",
  //     "Это ваш день — день, когда стоит выбрать лучшее и позволить себе немного роскоши!",
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news60,
  //   text: [
  //     "ТРК «СИТИ ЦЕНТР» — 21 год 🥂",
  //     "Приглашаем вас на день рождения главного fashion-пространства города 😍",
  //     "15 ноября с 12:00 наш атриум наполнится живой музыкой, ароматом шампанского и улыбками гостей!",
  //     "Для вас — праздничный фуршет, фотозона, фотограф и угощения за любые покупки в ТРК «СИТИ ЦЕНТР».",
  //     "Уже 21 год мы вдохновляем, удивляем и создаём атмосферу, где шопинг становится искусством 🤍",
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news59,
  //   text: [
  //     "Изысканное предложение для ценителей стиля!",
  //     "В бутике GUESS действуют скидки до 30% на новую коллекцию.",
  //     "Создайте свой неповторимый образ в ТРК «СИТИ ЦЕНТР» 🤍 ",
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news58,
  //   text: [
  //     "ЯРКИЕ КРАСКИ С FREYWILLE 🍂",
  //     "Пусть эта осень будет наполнена сиянием! Только с 15 по 31 октября FREYWILLE дарит вам уникальную возможность приобрести желанные украшения со скидкой до 50% 🤍",
  //     "Успейте пополнить свою коллекцию настоящими ювелирными шедеврами, вдохновлёнными работами известных художников, искусством и культурой мира, с приятными скидками!",
  //     "📍2 этаж, ТРК «СИТИ ЦЕНТР»",
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news57,
  //   text: [
  //     "18 октября в прямом эфире состоялся первый розыгрыш призов от ТРК «СИТИ ЦЕНТР»",
  //     "Благодарим всех участников и с радостью объявляем победителей:",
  //     "Купон №182 — VIP-карта от GMT",
  //     "Купон №232 — полотенце и кепка от CONCEPT STORE",
  //     "Купон №6 — сумка от CONCEPT STORE W",
  //     "Купон №19 — сертификат на 20 000₽ FREY WILLE",
  //     "Купон №188 — шарф и шапка от MarcCain",
  //     "Купон №115, 179, 248 — сертификаты на 20 000₽ от Renaissance",
  //     "Купон 135, 323, 183 — сертификаты  на 20 000₽ от Richard MTM Man",
  //     "Купон №123 — сертификат на 20 000₽ от Van Laack",
  //     "Купон №213 — сертификат на 20 000₽ от Zotty",
  //     "Купон №105 — очки Balenciaga от ОПТрИКА",
  //     "Купон №197 — сертификат на 20 000₽ от Estelle Adony",
  //     "Купон №83 и 212 — отдых в Pullman Sochi Centre",
  //     "Следующий розыгрыш состоится 15 ноября — у вас ещё есть шанс принять участие и выиграть суперприз 🤍",
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news56,
  //   text: [
  //     "Вечера высокого искусства продолжаются ✨",
  //     "23 октября приглашаем Вас на новую премьеру арт-проекта «Волшебные вечера» — оперу «Кармен» (16+).",
  //     "🎭 Показ приурочен к 100-летию со дня рождения Франко Дзеффирелли, легендарного режиссёра фильмов «Ромео и Джульетта» и «Травиата». Зрителей ждёт постановка, созданная с участием звёзд мировой оперной сцены и танцоров фламенко из Испании — страсть, ритм и сила испанской души в одном произведении. Опера звучит на французском языке с русскими субтитрами.",
  //     "Позвольте себе вечер, наполненный музыкой, эмоциями и атмосферой подлинного искусства.",
  //     "🎟 Билеты доступны на сайте kinomonitor.ru",
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news55,
  //   text: [
  //     "Комфортный сон — залог здоровья и отличного настроения.",
  //     "Представляем уникальную новинку из Швейцарии – инновационные пижамы CALIDA DEEPSLEEPWEAR, на покупку которых с 9 по 26 октября в выделенных салонах нашей сети вы получаете 5000 бонусов в подарок.",
  //     "С такой пижамой не страшны ни холода, ни жаркое отопление, ни зябкое межсезонье. В ассортименте три линии: согревающая – из микромодала и шерсти, балансирующая – из уникальной смеси природных волокон, и охлаждающая – из 100% волокон TENCEL™.",
  //     "Не пропустите выгодное предложение, подарите себе и близким здоровый и качественный сон!",
  //     "Акция также действует на сайте estelle.ru, где при заказе товаров из линии DEEPSLEEPWEAR на сумму свыше 25000 рублей вы получите скидку в размере 5000 рублей.",
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news52,
  //   text: [
  //     "VIPAVENUE – Ваш модный проводник в мир премиальных брендов и высококлассного сервиса. ",
  //     "Интернет-бутик является частью фэшн-ритейлера AVENUEVIP, в котором представлены более 750 ведущих мировых и российских брендов. ",
  //     "Уже более четырех лет мы работаем, как маркетплейс с самыми проверенными и надежными партнерами на российском рынке, для того, чтобы радовать Вас новым ассортиментом.",
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news51,
  //   img2: news53,
  //   img3: news54,
  //   text: [
  //     "Свой праздник мы делим с вами 🥂",
  //     "Ко Дню рождения ТРК «СИТИ ЦЕНТР» мы запускаем розыгрыш, который сделает вашу осень особенной.",
  //     "Главный приз — 4 билета на проживание в отеле Pullman Sochi Centre — уже ждёт своих обладателей.",
  //     "Как участвовать:",
  //     "— Совершайте покупки в ТРК «СИТИ ЦЕНТР» от 50 000 рублей;",
  //     "— Регистрируйте чеки;",
  //     "— Получайте номер участника;",
  //     "— Следите за онлайн-розыгрышами 18.10 и 15.11.",
  //     "Победителей пригласим на торжественное вручение подарков. Отмечайте с нами — и пусть именно вам улыбнётся удача",
  //   ],
  // },
  // {
  //   id: id++,
  //   img1: news49,
  //   text: [
  //     "Приглашаем вас погрузиться в мир искусства и вдохновения 🤍",
  //     "14 сентября в 15:00 пройдет открытие персональной выставки Ахсара Есенова — Заслуженного художника Северной Осетии-Алании.",
  //     "Экспозиция «Простые сюжеты» - это 30 живописных полотен, где в деталях раскрыта поэзия повседневности.",
  //     "Вас ждёт:",
  //     "- лёгкий фуршет 🥂",
  //     "- живое звучание саксофона 🎷",
  //     "- непринужденное общение с художником",
  //   ],
  // },
];

export { arrayNews };

//   // {
//   //   id: 4,
//   //   img: news5,
//   //   imgm: news5,
//   //   title: [
//   //     'Торопитесь на финальную распродажу в салонах мужского белья Х.О.!',
//   //   ],
//   //   text: [
//   //     {
//   //       id: 1,
//   //       t1: 'Последний шанс успеть!',
//   //     },
//   //     {
//   //       id: 2,
//   //       t1: [
//   //         'Всего 5 дней, с 24 по 28 августа, скидки до 60%! Грандиозный SALE на белье, пляжную и домашнюю одежду от ваших любимых Bikkembergs, Emporio Armani, Moschino, Hugo Boss, Dolce&Gabbana, Guess, Karl Lagerfeld и других модных брендов.',
//   //       ],
//   //     },
//   //     {
//   //       id: 3,
//   //       t1: ['Позвольте себе самое лучшее качество по доступной цене!'],
//   //     },
//   //   ],
//   // },
// ];
